import { AchievementCollectedPieces } from '@/types/achievement'

export type FacultyType =
  | 'edu'
  | 'psy'
  | 'dent'
  | 'law'
  | 'commarts'
  | 'cbs'
  | 'md'
  | 'pharm'
  | 'polsci'
  | 'sci'
  | 'spsc'
  | 'eng'
  | 'faa'
  | 'econ'
  | 'arch'
  | 'ahs'
  | 'vet'
  | 'arts'
  | 'scii'
  | 'cusar'
  | 'dorm'

export const ALL_FACULTIES = (): FacultyType[] => {
  return [
    'edu',
    'psy',
    'dent',
    'law',
    'commarts',
    'cbs',
    'md',
    'pharm',
    'polsci',
    'sci',
    'spsc',
    'eng',
    'faa',
    'econ',
    'arch',
    'ahs',
    'vet',
    'arts',
    'scii',
    'cusar',
    'dorm',
  ]
}

export interface FacultyOption {
  value: FacultyType
  variant: 1 | 2 | 4 | 5 | 6
  label: {
    th: string
    en: string
  }
  abbrLabel: {
    th: string
    en: string
  }
}

export const FACULTIES: FacultyOption[] = [
  {
    value: 'edu',
    variant: 1,
    label: { th: 'คณะครุศาสตร์', en: 'Faculty of Education' },
    abbrLabel: { th: 'ครุ', en: 'EDU' },
  },
  {
    value: 'psy',
    variant: 2,
    label: { th: 'คณะจิตวิทยา', en: 'Faculty of Psychology' },
    abbrLabel: { th: 'จิตวิทยา', en: 'PSY' },
  },
  {
    value: 'dent',
    variant: 4,
    label: { th: 'คณะทันตแพทยศาสตร์', en: 'Faculty of Dentistry' },
    abbrLabel: { th: 'ทันตะ', en: 'DENT' },
  },
  {
    value: 'law',
    variant: 5,
    label: { th: 'คณะนิติศาสตร์', en: 'Faculty of Law' },
    abbrLabel: { th: 'นิติ', en: 'LAW' },
  },
  {
    value: 'commarts',
    variant: 6,
    label: { th: 'คณะนิเทศศาสตร์', en: 'Faculty of Communication Arts' },
    abbrLabel: { th: 'นิเทศ', en: 'COMMARTS' }, //--------------------en
  },
  {
    value: 'cbs',
    variant: 1,
    label: {
      th: 'คณะพาณิชยศาสตร์และการบัญชี',
      en: 'Faculty of Commerce and Accountancy',
    },
    abbrLabel: { th: 'บัญชี/บริหาร', en: 'CBS' },
  },
  {
    value: 'md',
    variant: 2,
    label: { th: 'คณะแพทยศาสตร์', en: 'Faculty of Medicine' },
    abbrLabel: { th: 'แพทย์', en: 'MED' },
  },
  {
    value: 'pharm',
    variant: 4,
    label: { th: 'คณะเภสัชศาสตร์', en: 'Faculty of Pharmacy' },
    abbrLabel: { th: 'เภสัช', en: 'PHARM' },
  },
  {
    value: 'polsci',
    variant: 5,
    label: { th: 'คณะรัฐศาสตร์', en: 'Faculty of Political Science' },
    abbrLabel: { th: 'รัฐศาสตร์', en: 'POLSCI' },
  },
  {
    value: 'sci',
    variant: 6,
    label: { th: 'คณะวิทยาศาสตร์', en: 'Faculty of Science' },
    abbrLabel: { th: 'วิทย์', en: 'SCI' },
  },
  {
    value: 'spsc',
    variant: 1,
    label: { th: 'คณะวิทยาศาสตร์การกีฬา', en: 'Faculty of Sports Science' },
    abbrLabel: { th: 'วิทย์กีฬา', en: 'SPSC' },
  },
  {
    value: 'eng',
    variant: 2,
    label: { th: 'คณะวิศวกรรมศาสตร์', en: 'Faculty of Engineering' },
    abbrLabel: { th: 'วิศวะ', en: 'ENG' },
  },
  {
    value: 'faa',
    variant: 4,
    label: { th: 'คณะศิลปกรรมศาสตร์', en: 'Faculty of Fine and Applied Arts' },
    abbrLabel: { th: 'ศิลปกรรม', en: 'FAA' }, //------------------th
  },
  {
    value: 'econ',
    variant: 5,
    label: { th: 'คณะเศรษฐศาสตร์', en: 'Faculty of Economics' },
    abbrLabel: { th: 'เศรษฐศาสตร์', en: 'ECON' },
  },
  {
    value: 'arch',
    variant: 6,
    label: { th: 'คณะสถาปัตยกรรมศาสตร์', en: 'Faculty of Architecture' },
    abbrLabel: { th: 'สถาปัตย์', en: 'ARCH' },
  },
  {
    value: 'ahs',
    variant: 1,
    label: { th: 'คณะสหเวชศาสตร์', en: 'Faculty of Allied Health Sciences' },
    abbrLabel: { th: 'สหเวช', en: 'AHS' },
  },
  {
    value: 'vet',
    variant: 2,
    label: { th: 'คณะสัตวแพทยศาสตร์', en: 'Faculty of Veterinary Medicine' },
    abbrLabel: { th: 'สัตวแพทย์', en: 'VET' }, //--------------th
  },
  {
    value: 'arts',
    variant: 4,
    label: { th: 'คณะอักษรศาสตร์', en: 'Faculty of Arts' },
    abbrLabel: { th: 'อักษร', en: 'ARTS' },
  },
  {
    value: 'scii',
    variant: 5,
    label: {
      th: 'สถาบันนวัตกรรมบูรณาการแห่งจุฬาลงกรณ์มหาวิทยาลัย (BAScii)', //-------------
      en: 'School of Integrated Innovation (BAScii)',
    },
    abbrLabel: { th: 'BAScii', en: 'BAScii' },
  },
  {
    value: 'cusar',
    variant: 6,
    label: {
      th: 'คณะเกษตรบูรณาการ',
      en: 'School of Agricultural Resources',
    },
    abbrLabel: { th: 'เกษตร', en: 'CUSAR' },
  },
]

export interface Faculty {
  id: FacultyType
  name: string
  majors: Major[]
  imagePath: string
  location: string
}

export interface Major {
  id: string
  name: string
  description: string
  fieldDescription: string
}

export const FACULTY_MAP: Record<FacultyType, FacultyOption> =
  Object.fromEntries(FACULTIES.map((f) => [f.value, f])) as Record<
    FacultyType,
    FacultyOption
  >

export interface Faculty {
  id: FacultyType
  name: string
  majors: Major[]
  imagePath: string
  location: string
  websiteUrl: string
}

export interface Major {
  id: string
  name: string
  description: string
  fieldDescription: string
}

export const FACULTY_DATA: Faculty[] = [
  // คณะครุศาสตร์
  {
    id: 'edu',
    name: 'คณะครุศาสตร์',
    majors: [
      {
        id: 'edu1',
        name: 'ภาควิชานโยบาย การจัดการและความเป็นผู้นำทางการศึกษา',
        description:
          'เรียนเกี่ยวกับศาสตร์การพัฒนศึกษา บริหารการศึกษา นิเทศการศึกษา อุดมศึกษา ธุรกิจและอาชีวศึกษา ผลิตผู้สอนที่เน้นความเรืองปัญญาและคุณธรรม สร้าง เข้าร่วม  ชี้นำการเปลี่ยนแปลงในเครือข่ายทางการศึกษาในระดับชาติและนานาชาติ',
        fieldDescription:
          'ภาควิชาประกอบไปด้วย 6 สาขาวิชา ดังนี้ \n1. สาขาวิชาธุรกิจและอาชีวศึกษา\n2. สาขาวิชาพัฒนศึกษา\n3. สาขาวิชาอุดมศึกษา\n4. สาขาวิชาบริหารการศึกษา\n5. สาขาวิชานิเทศการศึกษา\n6. สาขาวิชาภาวะผู้นำการบริหารระบบการศึกษา (หลักสูตรนานาชาติ)',
      },
      {
        id: 'edu2',
        name: 'ภาควิชาหลักสูตรและการสอน',
        description:
          'เรียนเกี่ยวกับองค์ความรู้ และการสร้างนวัตกรรมที่ส่งเสริมหลักสูตรและการสอน ทั้งส่งเสริมให้ชุมชนมีความสัมพันธ์กับผู้เรียน ครู หลักสูตร และพัฒนาการสอน และนวัตกรรมให้ก้าวทันโลก',
        fieldDescription:
          'ภาควิชาประกอบไปด้วย 9 สาขาวิชา ดังนี้ \n1. สาขาวิชาหลักสูตรและการสอน \n2. สาขาวิชาการศึกษาปฐมวัย\n3. สาขาวิชาประถมศึกษา\n4. สาขาวิชาการสอนภาษาไทย\n5. สาขาวิชาการศึกษาคณิตศาสตร์\n6. สาขาวิชาการศึกษาวิทยาศาสตร์\n7. สาขาวิชาการสอนสังคมศึกษา\n8. สาขาวิชาสุขศึกษาและพลศึกษา\n9. สาขาวิชาการสอนภาษาต่างประเทศ และ Teaching English as a Foreign Language (TEFL)',
      },
      {
        id: 'edu3',
        name: 'ภาควิชาเทคโนโลยีและสื่อสารการศึกษา',
        description:
          'เรียนเกี่ยวกับการสร้างสรรค์ความรู้ในศาสร์ด้านเทคโนโลยีและสื่อสารการศึกษา บุกเบิกองค์ความรู้ใหม่ และสร้างนวัตกรรมด้านเทคโนโลยีและสื่อสารการศึกษาเพื่อประโยชน์ของสังคมไทยและสังคมโลก',
        fieldDescription: '-',
      },
      {
        id: 'edu4',
        name: 'ภาควิชาศิลปะ ดนตรีและนาฏศิลป์ศึกษา',
        description:
          'เรียนเกี่ยวกับศิลปศึกษาหรือดนตรีศึกษา การสร้างสรรค์การเรียนรู้แนวใหม่ สามารถเชื่อมโยงความรู้เพื่อพัฒนานวัตกรรมทางศิลปศึกษา',
        fieldDescription:
          'ภาควิชาประกอบไปด้วย 2 สาขาวิชา ดังนี้ \n1. สาขาวิชาศิลปศึกษา\n2. สาขาวิชาดนตรีศึกษา',
      },
      {
        id: 'edu5',
        name: 'ภาควิชาวิจัยและจิตวิทยาการศึกษา',
        description:
          'เรียนเกี่ยวกับการวิจัย การวัดและประเมินผลการศึกษา สถิติการศึกษา และจิตวิทยาการศึกษา เพื่อตอบสนองต่อการพัฒนานที่ยั่งยืนของประเทศ',
        fieldDescription: '-',
      },
      {
        id: 'edu6',
        name: 'ภาควิชาการศึกษาตลอดชีวิต',
        description:
          'เรียนเกี่ยวกับการศึกษาตลอดชีวิต การศึกษานอกระบบ และการศึกษาตามอัธยาศัย เพื่อให้ก้าวทันความเปลี่ยนแปลงของสังคมไทยและสังคมโลก สร้าง เผยแพร่และประยุกต์องค์ความรู้และงานวิจัย ต่อยอดองค์ความรู้ในระดับคณะ ระดับมหาวิทยาลัย และองค์กรทั้งในประเทศและต่างประเทศ',
        fieldDescription: '-',
      },
    ],
    imagePath: '/info/faculty/edu.webp',
    location: 'https://maps.app.goo.gl/v38UG7L3eFqTKWfy8',
    websiteUrl: 'https://www.edu.chula.ac.th/',
  },
  // คณะจิตวิทยา
  {
    id: 'psy',
    name: 'คณะจิตวิทยา',
    majors: [
      {
        id: 'psy1',
        name: 'หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาจิตวิทยา (B.Sc. in Psychology)',
        description:
          'เรียนจิตวิทยาในแขนงต่าง ๆ โดยกว้าง เน้นทักษะการคิดวิเคราะห์ แก้ไขปัญหา และค้นหาคำตอบอย่างเป็นวิทยศาสตร์ และการประยุกต์ความรู้จิตวิทยาเข้ากับความรู้อื่น ๆ และชีวิตประจำวัน',
        fieldDescription: '-',
      },
      {
        id: 'psy2',
        name: '*หลักสูตรนานาชาติ* JIPP (Joint International Psychology Program)',
        description:
          'หลักสูตรนานาชาติแบบ 2 ปริญญา หรือ Joint degree ร่วมมือกับ University of Queensland(UQ) ที่ประเทศออสเตรเลีย โดยจะได้รับปริญญาศิลปศาสตรบัณฑิต (สาขาจิตวิทยา) จาก UQ และปริญญาวิทยาศาสตรบัณฑิต (สาขาจิตวิทยา) จากจุฬาลงกรณ์มหาวิทยาลัย',
        fieldDescription: '-',
      },
    ],
    imagePath: '/info/faculty/psy.webp',
    location: 'https://maps.app.goo.gl/ULZ4goJU4S4iKGQ2A',
    websiteUrl: 'https://www.psy.chula.ac.th/',
  },
  // คณะทันตแพทยศาสตร์
  {
    id: 'dent',
    name: 'คณะทันตแพทยศาสตร์',
    majors: [
      {
        id: 'dent1',
        name: 'หลักสูตรทันตแพทยศาสตรบัณฑิต (ท.บ.)',
        description:
          'หลักสูตร 6 ปีที่มุ่งเน้นให้นิสิตทันตแพทย์มีความรู้และทักษะในวิชาชีพทันตกรรม รวมทั้งศาสตร์ที่เกี่ยวข้องตามข้อกำหนดมาตรฐานวิชาชีพทันตกรรม ค้นคว้าติดตามความก้าวหน้าทางวิชาการและเทคโนโลยี มีคุณธรรม จริยธรรม เพื่อให้บริการการรักษาสุขภาพในช่องปากของประชาชนได้อย่างเหมาะสม',
        fieldDescription: '-',
      },
    ],
    imagePath: '/info/faculty/dent.webp',
    location: 'https://maps.app.goo.gl/dqZ8HhyHuQKy7ojU8',
    websiteUrl: 'https://www.dent.chula.ac.th/',
  },
  // คณะนิติศาสตร์
  {
    id: 'law',
    name: 'คณะนิติศาสตร์',
    majors: [
      {
        id: 'law1',
        name: 'หลักสูตรนิติศาสตรบัณฑิต (น.บ.)',
        description:
          'เป็นหลักสูตรปริญญาตรีสำหรับผู้สำเร็จการศึกษามัธยมศึกษาปีที่ 6 หรือเทียบเท่า มีการแบ่งสาขาให้นิสิตเลือกเรียนตามความสนใจ 4 สาขา เพื่อให้เกิดความเชี่ยวชาญเฉพาะด้าน ได้แก่ สาขาวิชากฎหมายธุรกิจและภาษีอากร, กฎหมายแพ่งพาณิชย์และอาญา, กฎหมายมหาชน และกฎหมายระหว่างประเทศ',
        fieldDescription:
          '1. สาขาวิชากฎหมายธุรกิจและภาษีอากร\n2. สาขาวิชากฎหมายแพ่งพาณิชย์และอาญา\n3. สาขาวิชากฎหมายมหาชน\n4. สาขาวิชากฎหมายระหว่างประเทศ\n****ทั้งนี้ การเลือกสาขาวิชาดังกล่าวจะดำเนินการเมื่อนิสิตเรียนอยู่ในชั้นปีที่ 3 และลงทะเบียนเรียนในภาคการศึกษาปลาย อนึ่ง เมื่อสำเร็จการศึกษา นิสิตจะได้รับปริญญานิติศาสตรบัณฑิต โดยไม่มีการระบุสาขาไว้ในปริญญาบัตร',
      },
      {
        id: 'law2',
        name: 'Bachelor of Laws, experiential learning in Business and Tech Law (LLBel) (International Program)',
        description:
          'The LLBel Program at Chulalongkorn University equips students with legal, business, and technology expertise through experiential, cross-disciplinary learning. With global faculty, diverse peers, specialization tracks, and real-world practice, graduates are prepared for careers across law, business, and public service.',
        fieldDescription: '-',
      },
      {
        id: 'law3',
        name: 'หลักสูตรนิติศาสตรบัณฑิต ภาคบัณฑิต (น.บ.)',
        description:
          'ต่อยอดจากหลักสูตรนิติศาสตรบัณฑิต หลักสูตรเปิดรับนิสิตจบปริญญาตรี หรือเทียบเท่าในสาขาอื่นที่มิใช่นิติศาสตร์ โดยบัณฑิตที่จบจากหลักสูตรสามารถปฏิบัติงานได้หลากหลาย',
        fieldDescription:
          '1. สาขาวิชากฎหมายธุรกิจและภาษีอากร \n2. สาขาวิชากฎหมายแพ่งพาณิชย์และอาญา \n3. สาขาวิชากฎหมายมหาชน\n4. สาขาวิชากฎหมายระหว่างประเทศ\n****ทั้งนี้ การเลือกสาขาวิชาดังกล่าวจะดำเนินการเมื่อนิสิตเรียนอยู่ในชั้นปีที่ 3 และลงทะเบียนเรียนในภาคการศึกษาปลาย อนึ่ง เมื่อสำเร็จการศึกษา นิสิตจะได้รับปริญญานิติศาสตรบัณฑิต โดยไม่มีการระบุสาขาไว้ในปริญญาบัตร',
      },
    ],
    imagePath: '/info/faculty/law.webp',
    location:
      'https://www.google.com/maps/place/Faculty+of+Law,+Chulalongkorn+University/@13.7354035,100.5258816,17z/data=!3m1!4b1!4m6!3m5!1s0x30e29ed24512a467:0x99830f05cd376eab!8m2!3d13.7354035!4d100.5284565!16s%2Fg%2F122p31p6?entry=ttu&g_ep=EgoyMDI1MTIwOS4wIKXMDSoASAFQAw%3D%3D',
    websiteUrl: 'https://www.law.chula.ac.th/',
  },
  // คณะนิเทศศาสตร์
  {
    id: 'commarts',
    name: 'คณะนิเทศศาสตร์',
    majors: [
      {
        id: 'commarts1',
        name: 'ภาควิชาการประชาสัมพันธ์ (Public Relations)',
        description:
          'แบ่งออกเป็น 2 สาขาวิชา ได้แก่ การประชาสัมพันธ์ (Public Rlations) เเละการโฆษณาเเละการสื่อสารตราสินค้า (Advertising and Brand communications)',
        fieldDescription:
          '1. การประชาสัมพันธ์ (Public Relations) เรียนเกี่ยวกับทฤษฎี หลักการ และการปฏิบัติงานทางการประชาสัมพันธ์โดยทั่วไป และการประชาสัมพันธ์เพื่อส่งเสริมการตลาด แผนการประชาสัมพันธ์ การโน้มน้าวใจ การสร้างประชามติเพื่อประโยชน์ในงานสื่อสารสาธารณะ\n2. การโฆษณาและการสื่อสารตราสินค้า (Advertising and Brand Communications) เรียนเกี่ยวกับหลักการแนวคิดเกี่ยวกับการโฆษณา การสื่อสารการตลาดเชิงดิจิทัล พฤติกรรมผู้บริโภค การวางแผนสื่อ การรณรงค์ทางการโฆษณา การเขียนบทโฆษณา ภาพลักษณ์และชื่อเสียงองค์กรและตราสินค้า',
      },
      {
        id: 'commarts2',
        name: 'ภาควิชาการสื่อสารมวลชน (Mass Communication)',
        description:
          'เรียนภูมิทัศน์สื่อยุคปัจจุบัน แนวคิดทฤษฎีทางด้านสื่อสารมวลชน หลักการปฏิบัติด้านการออกแบบและผลิตสื่อ ความเข้าใจด้านสื่อมวลชนกับสังคมและวัฒนธรรม เน้นการเสริมสร้างการเรียนรู้ควบคู่ไปกับการปฏิบัติ บนพื้นฐานความรับผิดชอบต่อสังคม',
        fieldDescription:
          'การออกแบบและผลิตสื่อ (Media Design and Production) เรียนเกี่ยวกับแนวคิดสื่อสารศิลป์ กระบวนการออกแบบและผลิตสื่อบนจอ (On-screen Media) และสื่อเสียง (Audio Media)',
      },
      {
        id: 'commarts3',
        name: 'ภาควิชาวารสารสนเทศ (Journalism)',
        description:
          'มุ่งเน้นด้านวิทยาการข่าวสาร สื่อสิ่งพิมพ์ และสื่อสารสนเทศ ซึ่งครอบคลุมการแสวงหาข้อมูลข่าวสาร สืบค้นข้อเท็จจริง การเขียน การวิเคราะห์ และสื่อสาร ตลอดจนการจัดการและการผลิตสื่อสิ่งพิมพ์และการผลิตข้อมูลบนแพลตฟอร์มออนไลน์ทุกประเภท',
        fieldDescription:
          'วารสารสนเทศและสื่อใหม่ (Journalism, Information and New Media) เรียนเกี่ยวกับวิทยาการข้อมูลข่าวสาร การผลิตสื่อสารสนเทศบนแพลตฟอร์มต่าง ๆ การแสวงหาข้อมูลข่าวสาร สืบค้นข้อเท็จจริง การเขียน การวิเคราะห์ แนวคิดและหลักการกํากับดูแลสื่อ',
      },
      {
        id: 'commarts4',
        name: 'ภาควิชาวาทวิทยาและสื่อสารการแสดง (Speech Communication and Performing Arts)',
        description:
          'แบ่งออกเป็น 2 สาขาวิชา ได้แก่ วาทวิทยา (Speech) และ สื่อสารการแสดง (Performing Arts)',
        fieldDescription:
          '1. วาทวิทยา (Speech Communications) เรียนเกี่ยวกับองค์ประกอบและแนวคิดการสื่อสาร ทั้งภายในบุคคล ระหว่างบุคคล ภายในองค์กร กระบวนการและแนวทางการสร้างความสัมพันธ์ระหว่างบุคคล การโต้แย้ง การจัดการความขัดแย้ง วาทศาสตร์กับสังคม การเล่าเรื่อง การสัมภาษณ์ \n2. สื่อสารการแสดง (Performing Arts) เรียนเกี่ยวกับหลักการ แนวคิดด้านสุนทรียะ ปฏิบัติการด้านสื่อสารการแสดงที่ปรากฏบนเวที (Stage Production) และที่ปรากฏในสื่อ (Media Production) โดยเฉพาะอย่างยิ่งในสื่อโทรทัศน์ต่าง ๆ',
      },
      {
        id: 'commarts5',
        name: 'ภาควิชาการภาพยนตร์และภาพนิ่ง (Motion Pictures and Still Photography)',
        description:
          'มุ่งเน้นการให้ความรู้ที่เป็นศาสตร์ ไม่ว่าจะเป็นวิชาที่เกี่ยวกับทฤษฎี การวิจัย สุนทรียศาสตร์ การวางแผน การวิเคราะห์ และวิจารณ์ภาพยนตร์ ส่วนความรู้ด้านศิลปะ ได้แก่ การศึกษาในเชิงลึกของศิลปะการเขียนบทภาพยนตร์ การกำกับ การถ่ายทำภาพยนตร์ การตัดต่อ ตลอดจนศิลปะการถ่ายภาพนิ่ง',
        fieldDescription:
          'ศิลปะภาพยนตร์ (Cinematic Arts) เรียนเกี่ยวกับปฏิบัติการทางด้านสารและศิลปะภาพยนตร์และภาพนิ่ง ความเท่าทันความเปลี่ยนแปลงของบริบททางสังคมและวัฒนธรรม ทั้งในประเทศและระดับโลก และพัฒนาการที่ก้าวกระโดดของเทคโนโลยีการผลิตสื่อและการสื่อสาร',
      },
      {
        id: 'commarts6',
        name: 'หลักสูตรนานาชาติ สาขาการจัดการการสื่อสาร (BCM) B.A. (Communication Arts) in Communication Management',
        description:
          'The program focuses on marketing communications, content creation, and management skills. Students will learn about branding, advertising, public relations, digital content, and the creative aspects of both brands and businesses. The program emphasizes how to strategically manage and communicate a brand’s message across various platforms.',
        fieldDescription:
          '1. การจัดการการสื่อสาร (Communication Management): มุ้งเน้นการสื่อสารเชิงกลยุทธ์ การสื่อสารการตลาด การจัดการเเละการสร้างแบรนด์ เเละการสร้างสรรค์คอนเทนต์อย่างมีคุณภาพ The program provides a well-rounded education in communication management, with a particular emphasis on branding, marketing, and business across various contexts.',
      },
    ],
    imagePath: '/info/faculty/commarts.webp',
    location: 'https://maps.app.goo.gl/nENwDBqJisD5Ztnq6',
    websiteUrl: 'https://www.commarts.chula.ac.th/',
  },
  // คณะพาณิชยศาสตร์และการบัญชี
  {
    id: 'cbs',
    name: 'คณะพาณิชยศาสตร์และการบัญชี',
    majors: [
      {
        id: 'cbs1',
        name: 'หลักสูตรบัญชีบัณฑิต',
        description:
          'เรียนรู้ด้านการบัญชีและเทคโนโลยีสารสนเทศสำหรับงานบัญชีและการบริหารธุรกิจ มุ่งสร้างนิสิตที่มีความรู้ความสามารถด้านบัญชีและเทคโนโลยีสารสนเทศอย่างลึกซึ้ง',
        fieldDescription: '-',
      },
      {
        id: 'cbs2',
        name: 'หลักสูตรบริหารธุรกิจบัณฑิต',
        description:
          'มุ่งสร้างนิสิตให้มีทักษะและความรู้ในการบริหารธุรกิจควบคู่ไปกับจริยธรรมและคุณจรรยาบรรณทางธุรกิจ เพื่อผลักดันความก้าวหน้าของสังคมธุรกิจทั้งในระดับประเทศและระดับนานาชาติ',
        fieldDescription:
          '1 การจัดการเพื่อเป็นผู้ประกอบการธุรกิจ (Entrepreneurial Management) \n2 ระบบสารสนเทศทางการจัดการ (Management Information Systems) \n3 การธนาคารและการเงิน (Banking and Finance) \n4 การตลาด (Marketing) \n5 การจัดการโลจิสติกส์ระหว่างประเทศ (International Logistics Management) \nนิสิตในหลักสูตรจะได้บูรณาการความรู้ในด้านต่าง ๆ เหล่านี้ เพื่อการวิเคราะห์ วางแผน ตัดสินใจ ในการดำเนินธุรกิจได้อย่างมีประสิทธิภาพ อีกทั้งหลักสูตรยังช่วยให้นิสิตได้รับประสบการณ์ในการบริหารธุรกิจทั้งทางตรงและทางอ้อม ส่งผลให้นิสิตสามารถนำความรู้ไปใช้ในการทำงานในสภาพแวดล้อมทางธุรกิจที่มีพลวัตสูงในโลกปัจจุบัน',
      },
      {
        id: 'cbs3',
        name: 'หลักสูตรสถิติศาสตรบัณฑิต',
        description:
          'มุ่งเน้นให้นิสิตมีทักษะ ความรู้ และมีคุณธรรม สามารถประกอบอาชีพและเรียนรู้ตลอดชีวิตได้ด้วยตนเอง หลักสูตรเน้นการสร้างนิสิตที่มีความรู้เชิงลึกด้านสถิติ การประกันภัย และเทคโนโลยีสารสนเทศสำหรับธุรกิจ รวมถึงความรู้เกี่ยวกับโลกธุรกิจ',
        fieldDescription:
          '1 สถิติและวิทยาการข้อมูล (Statistics and Data Science)\n2 การประกันภัย (Insurance)\n3 เทคโนโลยีสารสนเทศเพื่อธุรกิจ (Information Technology for Business)',
      },
      {
        id: 'cbs4',
        name: 'หลักสูตรบริหารธุรกิจบัณฑิต (หลักสูตรนานาชาติ) Bachelor of Business Administration (BBA) International Program',
        description:
          'The curricula provide students with extensive knowledge of international accounting practices, understanding of trade development and the diversity of culture, financial analysis for modern and competitive business management, as well as brand and marketing management in the current face-paced business environment.',
        fieldDescription:
          '1 สาขาวิชาการจัดการธุรกิจระหว่างประเทศ (International Business Management) มุ่งเน้นไปที่การทำความเข้าใจการพัฒนาธุรกิจการค้าภายใต้ความหลากหลายของวัฒนธรรมโลก ซึ่งแบ่งออกเป็น 3 แขนงวิชา คือ แขนงวิชาการจัดการธุรกิจดิจิทัล แขนงวิชาการวิเคราะห์การเงินและการลงทุน และ แขนงวิชาการจัดการแบรนด์และการตลาด หลักสูตรนี้ยังเน้นถึงวิธีการจัดการธุรกิจอย่างมีประสิทธิภาพ และสามารถแข่งขันได้ในโลกธุรกิจที่มีการเปลี่ยนแปลงตลอดเวลา \n2 สาขาวิชาการบัญชี (Accounting)  ให้ความรู้อย่างครอบคลุมเกี่ยวกับแนวทางปฏิบัติทางการบัญชีระหว่างประเทศสำหรับการจัดการธุรกิจสมัยใหม่',
      },
    ],
    imagePath: '/info/faculty/cbs.webp',
    location: 'https://maps.app.goo.gl/r8MfrgePqCJQKFSL8',
    websiteUrl:
      'https://www.chula.ac.th/academic/faculty-of-commerce-and-accountancy/',
  },
  // คณะแพทยศาสตร์
  {
    id: 'md',
    name: 'คณะแพทยศาสตร์',
    majors: [
      {
        id: 'md1',
        name: 'หลักสูตรแพทยศาสตรบัณฑิต',
        description:
          'หลักสูตรปริญญาตรีวิชาชีพด้านการแพทย์ที่มุ่งผลิตบัณฑิตให้มีคุณธรรม จริยธรรม ความรู้ความสามารถในการประกอบวิชาชีพเวชกรรม ดูแลรักษาผู้ป่วยแบบองค์รวม และมีความเป็นผู้นำ เพื่อเป็นที่พึ่งของสังคม มีเนื้อหาครอบคลุมวิทยาศาสตร์การแพทย์ขั้นพื้นฐานและคลินิก พร้อมการฝึกปฏิบัติจริง เน้นทักษะการคิดวิเคราะห์และวิจัย โดยมีระยะเวลาเรียน 6 ปี',
        fieldDescription: '-',
      },
    ],
    imagePath: '/info/faculty/md.webp',
    location: 'https://maps.app.goo.gl/5qe8o1XU2Jxj7rPK8?g_st=ic',
    websiteUrl: 'https://www.md.chula.ac.th/',
  },
  // คณะเภสัชศาสตร์
  {
    id: 'pharm',
    name: 'คณะเภสัชศาสตร์',
    majors: [
      {
        id: 'pharm1',
        name: 'หลักสูตรเภสัชศาสตรบัณฑิต',
        description:
          'หลักสูตรเภสัชศาสตร์บัณฑิต เป็นหลักสูตร 6 ปี เมื่อจบหลักสูตรแล้วจะได้รับปริญญาเภสัชศาสตร์บัณฑิต (ภบ.) หลักสูตรมีความมุ่งหมายที่จะเป็นหลักสูตรชั้นนำของประเทศและมีมาตรฐานระดับสากลในการผลิตบัณฑิตเภสัชศาสตร์ บัณฑิตจะได้รับความรู้ในด้านงานเภสัชกรรม แนวทางเภสัชกรรมที่ใช้ทำงาน และความเป็นวิชาชีพเภสัชกรรมและการเรียนรู้ตลอดชีวิต',
        fieldDescription:
          '1. สาขาวิชาการบริบาลทางเภสัชกรรม ทั้งสองสาขาวิชามีการจัดการเรียนการสอนในวิชาพื้นฐาน, วิชาเฉพาะกลุ่มวิชาชีพ และการฝึกปฏิบัติวิชาชีพ ตามประกาศกำหนดของสภาเภสัชกรรม โดยในสาขาวิชาการบริบาลทางเภสัชกรรมจะมีการเน้นในรายวิชาที่เกี่ยวข้องกับการปฏิบัติงานการบริบาลทางเภสัชกรรมเพื่อดูแลผู้ป่วย ครอบครัว ชุมชน และสังคม \n2. สาขาวิชาเภสัชกรรมอุตสาหการ ทั้งสองสาขาวิชามีการจัดการเรียนการสอนในวิชาพื้นฐาน, วิชาเฉพาะกลุ่มวิชาชีพ และการฝึกปฏิบัติวิชาชีพ ตามประกาศกำหนดของสภาเภสัชกรรม โดยในสาขาวิชาเภสัชกรรมอุตสาหการจะมีการเน้นในรายวิชาที่เกี่ยวข้องกับการผลิต การควบคุมและประกันคุณภาพเภสัชภัณฑ์ การวิจัยและพัฒนายาการคุ้มครองผู้บริโภคด้านยาและผลิตภัณฑ์สุขภาพ',
      },
    ],
    imagePath: '/info/faculty/pharm.webp',
    location: 'https://maps.app.goo.gl/tN1YCBJ75JMeaT6a7',
    websiteUrl: 'https://www.pharm.chula.ac.th/',
  },
  // คณะรัฐศาสตร์
  {
    id: 'polsci',
    name: 'คณะรัฐศาสตร์',
    majors: [
      {
        id: 'polsci1',
        name: 'ภาควิชาการปกครอง (Government)',
        description:
          'คณะรัฐศาสตร์ไม่ได้มุ่งสอนศาสตร์สู่วิชาชีพโดยตรง แต่เน้นการหล่อหลอมให้นิสิตมีกระบวนการคิด การวิเคราะห์อย่างเป็นระบบ และการคำนึงถึงประโยชน์ส่วนรวมของสังคม ซึ่งล้วนเป็นรากฐานสำคัญที่สามารถต่อยอดสู่หลากหลายสายอาชีพได้',
        fieldDescription:
          'ศึกษาเกี่ยวกับการเมืองและการปกครองของรัฐและสังคมตั้งแต่อดีตจนถึงปัจจุบัน โดยวิเคราะห์ในหลากหลายมิติของการเมือง อาทิ โครงสร้างและสถาบันทางการเมือง ปรากฏการณ์และกระบวนการทางการเมือง รวมถึงแนวคิดและทฤษฎีทางการเมือง เพื่อทำความเข้าใจพลวัตของอำนาจ การตัดสินใจ และการจัดระเบียบทางสังคม-',
      },
      {
        id: 'polsci2',
        name: 'ภาควิชาความสัมพันธ์ระหว่างประเทศ (International Relations)',
        description:
          'คณะรัฐศาสตร์ไม่ได้มุ่งสอนศาสตร์สู่วิชาชีพโดยตรง แต่เน้นการหล่อหลอมให้นิสิตมีกระบวนการคิด การวิเคราะห์อย่างเป็นระบบ และการคำนึงถึงประโยชน์ส่วนรวมของสังคม ซึ่งล้วนเป็นรากฐานสำคัญที่สามารถต่อยอดสู่หลากหลายสายอาชีพได้',
        fieldDescription:
          'ศึกษาเกี่ยวกับการเมืองระหว่างประเทศ นโยบายต่างประเทศ ความสัมพันธ์ระหว่างรัฐ องค์กรระหว่างประเทศ และประวัติศาสตร์การทูต ควบคู่กับการเรียนรู้ทฤษฎีความสัมพันธ์ระหว่างประเทศ กฎหมายระหว่างประเทศ และเศรษฐกิจการเมืองโลก เพื่อทำความเข้าใจระบบโลกและบทบาทของรัฐและผู้แสดงอื่น ๆ ในเวทีระหว่างประเทศ',
      },
      {
        id: 'polsci3',
        name: 'ภาควิชาสังคมวิทยาและมานุษยวิทยา (Sociology and Anthropology)',
        description:
          'คณะรัฐศาสตร์ไม่ได้มุ่งสอนศาสตร์สู่วิชาชีพโดยตรง แต่เน้นการหล่อหลอมให้นิสิตมีกระบวนการคิด การวิเคราะห์อย่างเป็นระบบ และการคำนึงถึงประโยชน์ส่วนรวมของสังคม ซึ่งล้วนเป็นรากฐานสำคัญที่สามารถต่อยอดสู่หลากหลายสายอาชีพได้',
        fieldDescription:
          'ศึกษาโครงสร้างทางสังคมและวัฒนธรรม วิถีชีวิตและพฤติกรรมของมนุษย์ รวมถึงการเปลี่ยนแปลงและปัญหาทางสังคม เพื่อทำความเข้าใจความหลากหลายของสังคมและความสัมพันธ์ระหว่างมนุษย์ในบริบทต่าง ๆ',
      },
      {
        id: 'polsci4',
        name: 'ภาควิชารัฐประศาสนศาสตร์ (Public Administration)',
        description:
          'คณะรัฐศาสตร์ไม่ได้มุ่งสอนศาสตร์สู่วิชาชีพโดยตรง แต่เน้นการหล่อหลอมให้นิสิตมีกระบวนการคิด การวิเคราะห์อย่างเป็นระบบ และการคำนึงถึงประโยชน์ส่วนรวมของสังคม ซึ่งล้วนเป็นรากฐานสำคัญที่สามารถต่อยอดสู่หลากหลายสายอาชีพได้',
        fieldDescription:
          'ศึกษาเกี่ยวกับการบริหารจัดการภาครัฐ ครอบคลุมการบริหารทรัพยากรบุคคล การกำหนดนโยบาย การวางแผน และการบริหารการคลังของหน่วยงานและองค์กรต่าง ๆ เพื่อเสริมสร้างความรู้และทักษะในการบริหารงานภาครัฐอย่างมีประสิทธิภาพ โปร่งใส และตอบสนองต่อสังคม',
      },
      {
        id: 'polsci5',
        name: 'หลักสูตรการเมืองและโลกสัมพันธ์ศึกษา (Politics and Global Studies - PGS)',
        description:
          'คณะรัฐศาสตร์ไม่ได้มุ่งสอนศาสตร์สู่วิชาชีพโดยตรง แต่เน้นการหล่อหลอมให้นิสิตมีกระบวนการคิด การวิเคราะห์อย่างเป็นระบบ และการคำนึงถึงประโยชน์ส่วนรวมของสังคม ซึ่งล้วนเป็นรากฐานสำคัญที่สามารถต่อยอดสู่หลากหลายสายอาชีพได้',
        fieldDescription:
          'ศึกษาเกี่ยวกับการเมืองและประเด็นร่วมสมัยในระดับโลก ผ่านการบูรณาการองค์ความรู้จาก 4 ศาสตร์ ได้แก่ การปกครอง ความสัมพันธ์ระหว่างประเทศ รัฐประศาสนศาสตร์ และสังคมวิทยาและมานุษยวิทยา ในรูปแบบหลักสูตรนานาชาติของคณะรัฐศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ร่วมกับมหาวิทยาลัยในสหราชอาณาจักร 2 แห่ง ได้แก่ University of Essex และ University of Leeds รวมถึง University of Queensland (ออสเตรเลีย) และ Korea University (เกาหลีใต้) เพื่อพัฒนากระบวนการคิดเชิงวิเคราะห์ ความเข้าใจความซับซ้อนของสังคมโลก และเตรียมความพร้อมสู่การเป็นผู้นำและผู้สร้างการเปลี่ยนแปลงในระดับนานาชาติ โดยนิสิตจะได้รับปริญญาคู่ (Double Degree) จากมหาวิทยาลัยต่างประเทศที่นิสิตเข้าศึกษา',
      },
    ],
    imagePath: '/info/faculty/polsci.webp',
    location: 'https://maps.app.goo.gl/vEXK7KRokbV4fJri6',
    websiteUrl: 'https://www.polsci.chula.ac.th/',
  },
  // คณะวิทยาศาสตร์
  {
    id: 'sci',
    name: 'คณะวิทยาศาสตร์',
    majors: [
      {
        id: 'sci1',
        name: 'คณิตศาสตร์และวิทยาการคอมพิวเตอร์',
        description:
          'ภาควิชาคณิตศาสตร์และวิทยาการคอมพิวเตอร์ เป็น “แรก” ของประเทศไทย ในหลาย ๆ ด้าน เช่นเป็นแห่งแรกที่สอนในระดับปริญญาตรี โท และเอก เป็นแห่งแรกที่จัดสัมมนา และประชุมทางวิชาการทั้งในระดับประเทศและภาคพื้นเอเชียอาคเนย์ และเป็นแห่งแรกที่จัดตั้งสมาคมคณิตศาสตร์แห่งประเทศไทย',
        fieldDescription:
          'ภาควิชาคณิตศาสตร์และวิทยาการคอมพิวเตอร์ แบ่งเป็น 2 สาขาได้แก่ \n1. สาขาวิชาคณิตศาสตร์ - เรียนคณิตศาสตร์บริสุทธิ์และประยุกต์ อาทิเช่นการพิสูจน์, Algebra, Analysis, Financial Math, Stochastic และอื่น ๆ \n2. สาขาวิชาวิทยาการคอมพิวเตอร์ - มุ่งเน้นให้มีความรู้ทั้งเชิงกว้างและเชิงลึกในศาสตร์ของวิทยาการคอมพิวเตอร์ที่สามารถนำองค์ความรู้ไปประยุกต์ใช้ได้หลากหลาย ตามความนิยมในปัจจุบัน',
      },
      {
        id: 'sci2',
        name: 'เคมี',
        description:
          'ภาควิชาเคมี ครอบคลุมในหลายด้านทั้งเคมีอินทรีย์, เคมีอนินทรีย์, เคมีฟิสิกัล, เคมีวิเคราะห์, เคมีสีเขียวและความยั่งยืน เรามีห้องปฏิบัติการและเครื่องมือที่ทันสมัย และมีการร่วมมือกับทั้งภาควิชา สถาบัน และอุตสาหกรรมอื่น ๆ',
        fieldDescription: '-',
      },
      {
        id: 'sci3',
        name: 'ชีววิทยา',
        description:
          'ภาควิชาชีววิทยา คณะวิทยาศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย มุ่งเน้นการศึกษาสิ่งมีชีวิตในทุกระดับ ตั้งแต่โมเลกุล เซลล์ เนื้อเยื่อ อวัยวะ ระบบร่างกาย ไปจนถึงระบบนิเวศ พร้อมทั้งมีกิจกรรมเพื่อฝึกทักษะภาคสนามและเสริมสร้างประสบการณ์การทำงานร่วมกับผู้อื่น',
        fieldDescription:
          'ภาควิชาชีววิทยาแบ่งเป็น 2 สาขา ได้แก่ สาขาชีววิทยาและสาขาสัตววิทยา โดยมุ่งเน้นสายงานวิชาการ 5 ด้าน ได้แก่ Biomedical, Biodiversity, Biodiversity DNA, Bioecosystem และ Bioeconomy',
      },
      {
        id: 'sci4',
        name: 'ฟิสิกส์',
        description:
          'ฟิสิกส์คือพื้นฐานของวิทยาศาสตร์ทุกแขนง เราจึงจะศึกษาเกี่ยวกับธรรมชาติและปรากฏการณ์ต่าง ๆ ในจักรวาล ซึ่งมีหลากหลายแขนง ตั้งแต่กลศาสตร์ทั่วไป กลศาสตร์ควอนตัม สสารและพลังงาน ไฟฟ้าแม่เหล็ก สัมพันธภาพ ไปจนถึงนอกโลกอย่าง คอสมิก ดาราศาสตร์และจักรวาลวิทยา',
        fieldDescription: '-',
      },
      {
        id: 'sci5',
        name: 'พฤกษศาสตร์',
        description:
          'ภาควิชาพฤกษศาสตร์เป็นแหล่งความรู้ทางทั้งทางด้านพฤกษศาสตร์และพันธุศาสตร์ที่มุ่งเน้นให้ผู้เรียนได้เข้าใจถึงรากฐานของสิ่งมีชีวิต ภายในภาควิชามีการจัดตั้งพิพิธภัณฑ์พืช ศาสตราจารย์ กสิน สุวตะพันธุ์ และมีพิพิธภัณฑ์มีชีวิต ที่เป็นแหล่งรวบรวมพืชนานาชนิดเพื่อเผยแพร่ความรู้แก่ทุกคน',
        fieldDescription:
          'ภาควิชาพฤกษศาสตร์ ประกอบด้วย 2 สาขาวิชา ได้แก่ พฤกษศาสตร์ และ พันธุศาสตร์ โดยสาขาวิชาพฤกษศาสตร์ มีการเรียนการสอนและงานวิจัยที่เกี่ยวข้องกับพืช ในแง่ของความหลากหลาย การเปลี่ยนแปลงทางสรีรวิทยาในสภาพแวดล้อมที่เปลี่ยนแปลงไป ความสัมพันธ์ของพืชในระบบนิเวศ รวมทั้งการใช้ประโยชน์จากพืชและจุลินทรีย์ที่เกี่ยวข้องกับพืช เพื่อผลิตผลิตภัณฑ์ที่มีมูลค่าเพิ่มในเชิงพาณิชย์และการอนุรักษ์พื้นที่ป่า สำหรับสาขาวิชาพันธุศาสตร์ ได้มีการเรียนการสอนและงานวิจัยเกี่ยวกับพันธุกรรมในสิ่งมีชีวิตชนิดต่าง ๆ ทั้งมนุษย์ พืช สัตว์ จนถึงจุลินทรีย์ มีการนำองค์ความรู้มาวิเคราะห์ความสัมพันธ์ทางพันธุกรรมและวิวัฒนาการของสิ่งมีชีวิต และประยุกต์ใช้ในด้าน การแพทย์และนิติวิทยาศาสตร์ การปรับปรุงพันธุ์พืชและสัตว์ ตลอดจนการดัดแปลงพันธุกรรมของจุลินทรีย์เพื่อประโยชน์ในเชิงอุตสาหกรรม',
      },
      {
        id: 'sci6',
        name: 'เคมีเทคนิค',
        description:
          'ภาควิชาเคมีเทคนิคเป็นภาควิชาแรกทางสาขาวิศวกรรมเคมีของประเทศไทย และได้รับการรับรองมาตรฐานคุณภาพการศึกษาจากสภาวิศวกร (ใบประกอบวิชาชีพ กว.) เพื่อสร้างวิศวกรเคมีหรือวิศวกรกระบวนการให้กับภาคอุตสาหกรรม มุ่งเน้นงานวิจัยด้านพลังงานเชื้อเพลิง พลังงานทดแทน ที่เป็นมิตรกับสิ่งแวดล้อม',
        fieldDescription:
          'ภาควิชาเคมีเทคนิค ประกอบด้วย 1 สาขาวิชา คือ สาขาวิชาเคมีวิศวกรรม ซึ่งศึกษาเกี่ยวกับ \n1. การถ่ายโอนโมเมนตัม มวลสาร (Momentum Transfer) \n2. พลังงานจากปิโตรเลียม ปิโตรเคมี และพลังงานทดแทนรูปแบบต่างๆ \n3. พื้นฐานวิศวกรรมเคมี เช่น Unit Operation , Material Energy  Balance, Thermodynamics\n4. ความปลอดภัยในการทำงานในโรงงานอุตสาหกรรม (Safety)\n5. พัฒนาทักษะเฉพาะด้านวิศวกรรมเคมี ให้สอดคล้องกับเกณฑ์มาตรฐานคุณภาพการศึกษาวิศวกรรมศาสตร์ที่ได้รับรองจากสภาวิศวกร\n',
      },
      {
        id: 'sci7',
        name: 'ธรณีวิทยา',
        description:
          'ธรณีวิทยาที่ไม่ได้มีแค่หิน แต่เป็นการไขคำตอบเกี่ยวกับองค์ประกอบ โครงสร้าง เเละกระบวนการตามธรรมชาติของโลกด้วยหลักการทางวิทยาศาสตร์ ศึกษาผ่านหลักฐานทั้ง ซากดึกดำบรรพ์ อัญมณี แร่ หิน ปิโตรเลียม บูรณาการกับเทคโนโลยีและการสำรวจภาคสนาม มุ่งสู่การปรับตัวและพัฒนาอย่างยั่งยืน',
        fieldDescription: '-',
      },
      {
        id: 'sci8',
        name: 'วิทยาศาสตร์สิ่งแวดล้อม',
        description:
          'ภาควิชาวิทยาศาสตร์สิ่งแวดล้อม คณะวิทยาศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย คือพื้นที่ของคนที่ใช้วิทยาศาสตร์ ลงมือแก้ปัญหาสิ่งแวดล้อมจริง ตั้งแต่ดิน น้ำ อากาศ ป่า เมือง ไปจนถึงมลพิษและโลกร้อน เรียนทั้งในแล็บและภาคสนาม เพื่อคิด วิเคราะห์ ออกแบบวิธีจัดการ และ เพิ่มความยั่งยืนให้ธรรมชาติและสังคม อย่างเป็นรูปธรรม ไม่ใช่แค่เข้าใจโลก แต่ช่วยทำให้โลกดีขึ้น',
        fieldDescription:
          'แบ่งเป็น 2 สายหลัก คือ สายการจัดการทรัพยากรและสิ่งแวดล้อม ที่เน้นดิน น้ำ ป่า เมือง ระบบนิเวศ และการจัดทำรายงานความยั่งยืน และ สายเทคโนโลยีสิ่งแวดล้อม ที่เน้นระบบบำบัดน้ำเสีย การจัดการของเสีย เสียงและการสั่นสะเทือน และมลภาวะอากาศ รวมทั้งการประเมินผลกระทบสิ่งแวดล้อม (EIA) เป็นทักษะสำคัญที่เรียนร่วมกันทั้งสองสาย เพื่อสร้างนักพัฒนาสิ่งแวดล้อมที่คิดเป็น ทำเป็น และเปลี่ยนความรู้ให้เกิดผลลัพธ์ที่ยั่งยืนได้จริง',
      },
      {
        id: 'sci9',
        name: 'วิทยาศาสตร์ทางทะเล',
        description:
          'ภาควิชาวิทยาศาสตร์ทางทะเล เน้นสอนเกี่ยวกับทะเลทั้งด้านชีวภาพ เคมี ฟิสิกส์ และธรณีวิทยา ผ่านวิทยาศาตร์พื้นฐานควบคู่การลงพื้นที่จริงและสำรวจทางเรือเพื่อวิจัยด้านนิเวศวิทยา มลพิษ และการเปลี่ยนแปลงสภาพภูมิอากาศ มุ่งผลิตผู้เชี่ยวชาญเพื่ออนุรักษ์และใช้ทรัพยากรทะเลอย่างยั่งยืน',
        fieldDescription:
          '1) แขนงวิชาชีววิทยาทางทะเลและการประมง เน้นการศึกษาด้านอนุกรมวิธานและนิเวศวิทยาของสิ่งมีชีวิตในทะเล และการจัดการทรัพยากรทางทะเล \n2) แขนงวิชาสมุทรศาสตร์ฟิสิกส์ เน้นเรื่องการเคลื่อนที่ของมวลน้ำ คลื่น กระแสน้ำ และการสร้างแบบจำลองทางคณิตศาสตร์ \n3) แขนงวิชาสมุทรศาสตร์เคมี เน้นการวิเคราะห์สารประกอบในน้ำทะเล มลพิษทางทะเล และวัฏจักรของธาตุต่าง ๆ',
      },
      {
        id: 'sci10',
        name: 'ชีวเคมี',
        description:
          'ภาควิชาชีวเคมี เป็นภาควิชาที่ศึกษาเกี่ยวกับปฏิกิริยาเคมีในสิ่งมีชีวิต โดยจะศึกษาทั้งโครงสร้างและหน้าที่ของสารชีวโมเลกุล ได้แก่ โปรตีน คาร์โบไฮเดรต ไขมัน และกรดนิวคลีอิก ซึ่งเป็นการประยุกต์ใช้ความรู้ในด้านต่าง ๆ เพื่อทำความเข้าใจกระบวนการทางชีวภาพในระดับโมเลกุล',
        fieldDescription: '-',
      },
      {
        id: 'sci11',
        name: 'วัสดุศาสตร์',
        description:
          'ภาควิชาวัสดุศาสตร์มีการเรียนการสอนและวิจัยด้านเซรามิก แก้ว กระจก พอลิเมอร์ และสิ่งทอ โดยพัฒนาเนื้อหาตามเทคโนโลยีวัสดุสมัยใหม่อย่างต่อเนื่อง เพื่อผลิตบัณฑิตที่มีความรู้และความสามารถด้านวัสดุศาสตร์',
        fieldDescription:
          '1. แขนงวิชาเซรามิกและวัสดุศาสตร์ เน้นการเรียนการสอนด้านวัสดุศาสตร์และเชรามิกที่ใช้งานทางวิศวกรรม ศึกษาโครงสร้างและสมบัติเฉพาะของเซรามิก วัตถุดิบที่ใช้ในการผลิต ขั้นตอนการผลิตและ การใช้งานของทั้งวัสดุเซรามิกแบบดั้งเดิมและเซรามิกขั้นสูง \n2. แขนงวิชาพอลิเมอร์และสิ่งทอ เน้นการเรียนการสอนด้านวัสดุพอลิเมอร์ ได้แก่ พลาสติก สิ่งทอ ยาง วัสดุเชิงประกอบ และสารเคลือบผิว โดยศึกษา ครอบคลุมตั้งแต่โครงสร้างทางเคมีและสมบัติของวัสดุในด้านต่าง ๆ การสังเคราะห์ กระบวนการผลิต การตรวจสอบ สมบัติและการประยุกต์เพื่อใช้เป็นผลิตภัณฑ์ที่เชื่อมโยงกับ อุตสาหกรรมหลักของประเทศ อีกทั้งยังมีความสําคัญต่อ การขับเคลื่อนโมเดลเศรษฐกิจชีวภาพ เศรษฐกิจหมุนเวียน เศรษฐกิจสีเขียว (BCG Economy Model)',
      },
      {
        id: 'sci12',
        name: 'จุลชีววิทยา',
        description:
          'ภาคจุลชีววิทยา ศึกษาเกี่ยวกับโลกของจุลินทรีย์ ตลอดจนการศึกษาเชิงลึกเกี่ยวกับพันธุศาสตร์ สรีรวิทยา โรคติดเชื้อ ภูมิคุ้มกันวิทยา ความหลากหลาย และการประยุกต์ใช้งานในด้านการแพทย์ สิ่งแวดล้อม เกษตรกรรม อาหาร อุตสาหกรรม และเทคโนโลยีทางชีวภาพอื่น ๆ',
        fieldDescription: '-',
      },
      {
        id: 'sci13',
        name: 'เทคโนโลยีทางภาพและการพิมพ์',
        description:
          'ภาควิชาเทคโนโลยีทางภาพและการพิมพ์มุ่งเน้นการศึกษาและวิจัยด้านการสร้างภาพ การพิมพ์ และเทคโนโลยีสื่อดิจิทัล ครอบคลุมกระบวนการถ่ายภาพ ระบบการพิมพ์ เทคโนโลยีสี และการประมวลผลภาพ เพื่อตอบโจทย์อุตสาหกรรมสื่อและการสื่อสารยุคใหม่',
        fieldDescription: '-',
      },
      {
        id: 'sci14',
        name: 'เทคโนโลยีทางอาหาร',
        description:
          'ศึกษาเกี่ยวกับอุตสาหกรรมอาหาร โดยครอบคลุมถึงการเปลี่ยนแปลงทางเคมีของอาหาร จุลินทรีย์ในอาหาร หลักการกระบวนการแปรรูปอาหาร วิศวกรรมอาหาร รวมถึงบรรจุภัณฑ์อาหาร และระบบการประกันคุณภาพอาหาร และยังมีแขนงวิชาเทคโนโลยีชีวภาพที่ศึกษาการผลิตผลิตภัณฑ์จากกระบวนการชีวภาพต่างๆ',
        fieldDescription:
          'ภาควิชาฯ มี 2 แขนงวิชา คือ \n1) เทคโนโลยีทางอาหาร เป็นการศึกษาเกี่ยวกับการผลิตอาหารในระดับอุตสาหกรรม \n2) แขนงเทคโนโลยีชีวภาพ เป็นการศึกษาการใช้จุลินทรีย์ เอนไซม์ในการผลิตผลิตภัณฑ์อาหารต่างๆ รวมถึงผลิตภัณฑ์อื่นๆ ที่เกี่ยวข้อง',
      },
      {
        id: 'sci15',
        name: 'เคมีประยุกต์ (นานาชาติ)',
        description:
          'The BSAC program puts emphasis on applying theoretical chemistry concepts to practical applications and challenges posed by the needs of local and international businesses, with areas encompassing industrial, material, environmental, cosmetic, and entrepreneurial chemistry. ',
        fieldDescription:
          '1. Industrial Chemistry and Management Designed for future technical managers of chemical-related industries and businesses. The program balances scientific knowledge with practical aspects of finance, management, and accounting under the perspectives of international quality systems. \n2. Materials Chemistry Designed for undergraduates who want to obtain a deep knowledge in materials science which is a key to the advancement of the economy and current social issues. \n3. Environmental Chemistry Created for students with an aim for a career in the field of environmental evaluation and risk assessment.  The curriculum focuses on a basis of analytical chemistry with special emphasis on environmental chemistry courses and research projects. \n4. Cosmetic Chemistry and Entrepreneurship Designed for students who want to immerse themselves in the world of cosmetics with an aim for a career as an entrepreneur. The program balances chemistry concepts and strategies to create finished products to conform to customers needs with classes of business and marketing.',
      },
      {
        id: 'sci16',
        name: 'SIS (BBTech)',
        description:
          'BBTech explores diverse realms of biotechnology, encompassing different fields such as animal, plant, microbial, environmental, food, marine, bioinformatics, and biotechnology management by diving deep into cutting-edge technologies like recombinant DNA technology, applied immunology, and genomics.',
        fieldDescription:
          '-Animal Biotechnology \n-Plant Biotechnology \n-Microbial Biotechnology \n-Food Biotechnology \n-Environmental Biotechnology \n-Marine Biotechnology \n-Bioinformatics \n-Biotechnology Management',
      },
      {
        id: 'sci17',
        name: 'SIS (BISTech)',
        description:
          'BISTech integrates expertise in materials science, food technology, chemical technology, and imaging and printing technology with comprehensive management knowledge to equip future industry leaders with an in-depth understanding of manufacturing technologies and essential communication skills. ',
        fieldDescription:
          '-Chemical technology \n-Food Technology \n-Material Science \n-Imaging and Printing Technology',
      },
    ],
    location: 'https://maps.app.goo.gl/6Hm29bEcGzWCBEtz5',
    imagePath: '/info/faculty/sci.webp',
    websiteUrl: 'https://web.sc.chula.ac.th/',
  },
  // คณะวิทยาศาสตร์การกีฬา
  {
    id: 'spsc',
    name: 'คณะวิทยาศาสตร์การกีฬา',
    majors: [
      {
        id: 'spsc1',
        name: 'วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์การกีฬาและการออกกำลังกาย (Sports and Exercise Science)',
        description:
          'เป็นหลักสูตรปริญญาตรีสำหรับผู้สำเร็จการศึกษาระดับชั้นมัธยมศึกษาตอนปลาย โดยมุ่งศึกษาและประยุกต์ใช้หลักวิทยาศาสตร์กับการเคลื่อนไหว การออกกำลังกาย และการเล่นกีฬา เพื่อพัฒนาสมรรถภาพทางกาย สุขภาพ การฝึกซ้อมกีฬา และการฟื้นฟูร่างกายอย่างมีประสิทธิภาพและปลอดภัย โดยบูรณาการความรู้จากหลายศาสตร์ เช่น กายวิภาคศาสตร์ สรีรวิทยาการออกกำลังกาย ชีวกลศาสตร์ จิตวิทยาการกีฬา โภชนาการกีฬา และการทดสอบสมรรถภาพทางกาย',
        fieldDescription:
          'ทางคณะวิทยาศาสตร์การกีฬามิได้มีการแบ่งสาขา แต่จะแบ่งเป็นความถนัด 2 ด้าน ได้แก่ \n1.ด้านกีฬา (The aspect of Sports)  คือด้านที่มุ่งเน้นการศึกษาเกี่ยวกับการพัฒนาสมรรถภาพทางกายของบุคคลที่ต้องการความเป็นเลิศทางด้านกีฬา โดยจะเรียนเกี่ยวกับการเสริมสร้างสมรรถภาพทางกายของกีฬา การวางแผนช่วงการฝึกฝน เทคนิคโปรแกรมการฝึกกล้ามเนื้อ การบาเจ็บทางการกีฬา การฟื้นสภาพร่างกายหลังการบาดเจ็บกีฬา การจัดการกิจกรรมกีฬา รวมไปถึงในขณะที่เรียนผู้เรียนจะได้นำความรู้ไปปฏิบัติจริงในสถานการณ์จริงอีกด้วย ซึ่งถือว่าเป็นรายวิชาที่สำคัญและครบถ้วนต่อการนำความรู้ไปพัฒนาสมรรถภาพทางกายให้เกิดประสิทธิภาพสูงสุด และให้ผู้พัฒนาสามารถดึงศักยภาพสูงสุดของตนเองได้ \n2.ด้านสุขภาพ (The aspect of Health) คือด้านที่มุ่งเน้นการศึกษาการส่งเสริมสุขภาพของคนทั่วไป ซึ่งครอบคลุมทุกช่วงวัยไม่ว่าจะเป็นเด็ก วัยรุ่น ผู้ใหญ่วัยทำงาน ผู้สูงอายุ ไปจนถึงการดูแล และส่งเสริมสุขภาพบุคคลพิเศษในกลุ่มต่างๆ  ซึ่งในการเรียนการสอนก็จะลงลึกไปถึงปัญหาสุขภาพ ในแต่ละช่วงวัย ข้อควรระวังต่างๆ ในแต่ละโรค และวิธีการกำหนดการออกกำลังกายให้เหมาะสมเฉพาะเจาะจงกับสภาวะนั้นๆ ',
      },
    ],
    imagePath: '/info/faculty/spsc.webp',
    location: 'https://maps.app.goo.gl/vUs2nhmuBwT66tgH6',
    websiteUrl: 'https://www.spsc.chula.ac.th/',
  },
  // คณะวิศวกรรมศาสตร์
  {
    id: 'eng',
    name: 'คณะวิศวกรรมศาสตร์',
    majors: [
      {
        id: 'eng1',
        name: 'วิศวกรรมโยธา (Civil Engineering)',
        description:
          'หลักสูตรของภาควิชาได้รับการออกแบบเพื่อให้นักศึกษาได้รับความรู้ทางการศึกษาและวิชาชีพอย่างกว้างขวาง ตลอดจนเสริมสร้างประสิทธิภาพในการเป็นผู้ปฏิบัติงานและนักวิจัยในสาขาวิศวกรรมโยธาสมัยใหม่ ซึ่งครอบคลุมงานด้านการวางแผน การวิเคราะห์ การออกแบบ และการก่อสร้างอาคาร สะพาน ฐานราก เขื่อน โครงสร้างทางชลศาสตร์ และสิ่งอำนวยความสะดวกด้านการขนส่ง หลักสูตรประกอบด้วยรายวิชาคณิตศาสตร์ วิทยาศาสตร์พื้นฐานที่เกี่ยวข้อง พื้นฐานทางวิศวกรรมทั่วไป และรายวิชาเฉพาะทางด้านวิศวกรรมโยธา นอกจากนี้ นักศึกษายังต้องเรียนรายวิชาที่คัดเลือกในด้านภาษาอังกฤษ มนุษยศาสตร์ และสังคมศาสตร์ เพื่อขยายมุมมองสำหรับการประกอบอาชีพในอนาคต ห้องปฏิบัติการในสาขาต่าง ๆ และหน่วยวิจัยของภาควิชาถูกจัดตั้งขึ้นเพื่อเสริมการเรียนการสอนในชั้นเรียน และเพื่อเอื้ออำนวยต่อการศึกษาหัวข้อขั้นสูง',
        fieldDescription:
          '1. สาขาวิชาวิศวกรรมโยธา มีพื้นฐาน 4 สาขาย่อยคือ \n1.1 วิศวกรรมโครงสร้าง (Structural Engineering) – ศึกษาเกี่ยวกับการ วิเคราะห์และออกแบบโครงสร้างของสิ่งปลูกสร้าง เพื่อให้สามารถรับ น้ําหนักและแรงต่าง ๆ ได้อย่างปลอดภัย \n1.2 วิศวกรรมธรณี (Geotechnical Engineering) - ศึกษาเกี่ยวกับ พฤติกรรมของดินที่ใช้รองรับโครงสร้างต่าง ๆ เพื่อให้สามารถออกแบบ ฐานรากและโครงสร้างในดินได้อย่างปลอดภัยและมั่นคง \n1.3 วิศวกรรมบริหารงานก่อสร้าง (Construction Management) – เรียน การควบคุมงาน วางแผนโครงการ บริหารเวลา งบประมาณ และความ ปลอดภัย \n1.4 วิศวกรรมขนส่ง (Transportation Engineering) – เรียนเกี่ยวกับระบบ การเดินทาง การวางแผนถนน การจราจร และการวิเคราะห์ระบบขนส่ง',
      },
      {
        id: 'eng2',
        name: 'วิศวกรรมไฟฟ้า (Electrical Engineering)',
        description:
          'หลักสูตรระดับปริญญาตรีได้รับการออกแบบเพื่อให้นักศึกษาได้รับพื้นฐานที่กว้างขวางและมั่นคงทางวิทยาศาสตร์กายภาพและวิศวกรรมไฟฟ้า ซึ่งมีความจำเป็นสำหรับนักศึกษาวิศวกรรมไฟฟ้าในการประกอบอาชีพในอนาคตทั้งในฐานะผู้ปฏิบัติงานหรือนักวิจัย รายวิชาทางวิศวกรรมไฟฟ้าเริ่มต้นในชั้นปีที่สอง โดยประกอบด้วยวิชาวงจรไฟฟ้า แม่เหล็กไฟฟ้า และสมบัติของวัสดุไฟฟ้าและอิเล็กทรอนิกส์ ในชั้นปีที่สาม นักศึกษาจะต้องศึกษารายวิชาพื้นฐานเพิ่มเติมที่เกี่ยวข้องกับกำลังไฟฟ้า อิเล็กทรอนิกส์ การสื่อสาร และระบบควบคุม หลักสูตรยังรวมรายวิชาคณิตศาสตร์วิศวกรรมเพื่อเสริมสร้างความสามารถด้านการวิเคราะห์ของนักศึกษา ในชั้นปีที่สี่ นักศึกษาสามารถเลือกสาขาความเชี่ยวชาญได้โดยการลงทะเบียนเรียนรายวิชาเลือกจากรายชื่อที่ได้รับการอนุมัติ รวมถึงวิชาโครงงานวิศวกรรมไฟฟ้า หลักสูตรประกอบด้วยงานห้องปฏิบัติการในสาขาต่าง ๆ ของวิศวกรรมไฟฟ้า โดยมีวัตถุประสงค์เพื่อพัฒนาทักษะของนักศึกษาในการใช้งานเครื่องมือทดสอบ ความสามารถในการแก้ไขปัญหาเชิงปฏิบัติ และความสามารถในการวิเคราะห์ผลการทดสอบ',
        fieldDescription:
          '1. สาขาวิชาวิศวกรรมไฟฟ้า มีการแบ่งย่อยเป็น 3 สาขา \n1.1 ไฟฟ้าสื่อสาร เรียนเกี่ยวกับ คลื่นแม่เหล็กไฟฟ้า โครงข่ายระบบสื่อสาร การส่งข้อมูลทางโทรคมนาคม การจัดการมัลติมีเดียต่าง ๆ \n1.2 ไฟฟ้ากําลัง เรียนเกี่ยวกับ อุปกรณ์ทางไฟฟ้า การผลิตกระแสไฟฟ้า การ ออกแบบระบบไฟฟ้าและการส่งไฟฟ้า การคํานวณปรับปรุงระบบต่าง ๆ เพื่อให้ได้ประสิทธิภาพมากที่สุด \n1.3 ไฟฟ้าทั่วไป โดยหลักสูตรใหม่นี้จะต่างจากปีก่อน ๆ ตรงที่สาขาไฟฟ้า ควบคุมและอิเล็กทรอนิกส์กลายเป็นสาขาไฟฟ้าทั่วไป ซึ่งเดิมทีแล้วสองสาขานี้จะเรียนเกี่ยวกับ การสร้างแบบจําลองคณิตศาสตร์ทางไฟฟ้า การวิเคราะห์สมรรถนะของระบบไฟฟ้า อุปกรณ์ที่เกี่ยวกับการใช้กระแส ไฟฟ้าทั้งหมด การออกแบบการสร้างแผงวงจร การดูแลการทํางานของ อุปกรณ์ไฟฟ้าในโรงงาน \n2. สาขาวิชาเซมิคอนดักเตอร์ (หลักสูตรนานาชาติ) เน้นการผลิตชิปวงจรอิเล็กทรอนิกส์ เพื่อตอบโจทย์อุตสาหกรรมเทคโนโลยีขั้นสูงทั่วโลก',
      },
      {
        id: 'eng3',
        name: 'วิศวกรรมเครื่องกล (Mechanical Engineering)',
        description:
          'หลักสูตรระดับปริญญาตรีได้รับการออกแบบเพื่อให้นักศึกษาได้รับพื้นฐานที่กว้างขวางและมั่นคงทางวิทยาศาสตร์กายภาพและวิศวกรรมไฟฟ้า ซึ่งมีความจำเป็นสำหรับนักศึกษาวิศวกรรมไฟฟ้าในการประกอบอาชีพในอนาคตทั้งในฐานะผู้ปฏิบัติงานหรือนักวิจัย รายวิชาทางวิศวกรรมไฟฟ้าเริ่มต้นในชั้นปีที่สอง โดยประกอบด้วยวิชาวงจรไฟฟ้า แม่เหล็กไฟฟ้า และสมบัติของวัสดุไฟฟ้าและอิเล็กทรอนิกส์ ในชั้นปีที่สาม นักศึกษาจะต้องศึกษารายวิชาพื้นฐานเพิ่มเติมที่เกี่ยวข้องกับกำลังไฟฟ้า อิเล็กทรอนิกส์ การสื่อสาร และระบบควบคุม หลักสูตรยังรวมรายวิชาคณิตศาสตร์วิศวกรรมเพื่อเสริมสร้างความสามารถด้านการวิเคราะห์ของนักศึกษา ในชั้นปีที่สี่ นักศึกษาสามารถเลือกสาขาความเชี่ยวชาญได้โดยการลงทะเบียนเรียนรายวิชาเลือกจากรายชื่อที่ได้รับการอนุมัติ รวมถึงวิชาโครงงานวิศวกรรมไฟฟ้า หลักสูตรประกอบด้วยงานห้องปฏิบัติการในสาขาต่าง ๆ ของวิศวกรรมไฟฟ้า โดยมีวัตถุประสงค์เพื่อพัฒนาทักษะของนักศึกษาในการใช้งานเครื่องมือทดสอบ ความสามารถในการแก้ไขปัญหาเชิงปฏิบัติ และความสามารถในการวิเคราะห์ผลการทดสอบ',
        fieldDescription:
          '1. สาขาวิชาวิศวกรรมเครื่องกล \n2. สาขาวิชาวิศวกรรมยานยนต์',
      },
      {
        id: 'eng4',
        name: 'วิศวกรรมอุตสาหการ (Industrial Engineering)',
        description:
          'รายวิชาทางวิศวกรรมอุตสาหการได้รับการออกแบบเพื่อผลิตวิศวกรที่มีความเชี่ยวชาญด้านการแก้ไขปัญหาและการตัดสินใจ เพื่อให้บรรลุวัตถุประสงค์ดังกล่าว หลักสูตรจึงเน้นด้านการผลิต การวางแผนและการควบคุม การศึกษางาน การประกันและควบคุมคุณภาพ การวิเคราะห์ระบบและกระบวนการโดยทั่วไป รวมถึงการประยุกต์ใช้เทคนิคการวิจัยดำเนินงานที่มุ่งเน้นการผลิต การประมวลผลข้อมูล และพื้นฐานการเขียนโปรแกรมคอมพิวเตอร์ นอกจากนี้ นอกเหนือจากเทคนิคที่กล่าวมาแล้ว ภาควิชายังให้ความสำคัญกับการพัฒนาการศึกษาในด้านมนุษยสัมพันธ์ในอุตสาหกรรม ดังเห็นได้จากหัวข้อเกี่ยวกับความสัมพันธ์ระหว่างมนุษย์ในอุตสาหกรรม การยศาสตร์ (กิจกรรมกลุ่มย่อย) และกฎหมายอุตสาหกรรม',
        fieldDescription: '1. สาขาวิชาวิศวกรรมอุตสาหการ',
      },
      {
        id: 'eng5',
        name: 'วิศวกรรมเคมี (Chemical Engineering)',
        description:
          'หลักสูตรวิศวกรรมเคมีมุ่งเน้นการ ออกแบบ ควบคุม พัฒนา และปรับปรุงกระบวนการผลิต ที่เกี่ยวข้องกับการแปลงสารเคมีตั้งต้นให้เป็นผลิตภัณฑ์ทางเคมี รายวิชาที่เรียนจึงเน้นพื้นฐานด้านกระบวนการผลิต เช่น Mass and Energy Balance ซึ่งศึกษาการดุลมวลและพลังงานในระบบการผลิต, Physical Chemistry for Chemical Engineering ที่เกี่ยวข้องกับอุณหพลศาสตร์ รวมถึงการเรียนรู้เกี่ยวกับอุปกรณ์ในกระบวนการผลิต เช่น Heat Exchanger และระบบการไหลของสาร นอกจากนี้ยังมีการเรียนด้าน การควบคุมและการออกแบบหอกลั่น ซึ่งเป็นจุดเด่นของภาควิชา เนื่องจากเป็นภาควิชาที่เรียนหอกลั่นอย่างครบถ้วน รายวิชาที่เกี่ยวข้องกับเคมีโดยตรงมีเพียง Chemistry for Chemical Engineering และ Chemistry for Chemical Engineering Laboratory ซึ่งมุ่งเน้น Organic Chemistry และการทำปฏิบัติการ เพื่อให้นักศึกษาสามารถนำความรู้ไปประยุกต์ใช้กับกระบวนการผลิตต่าง ๆ ได้',
        fieldDescription:
          '1. สาขาวิชาวิศวกรรมเคมี \n2. สาขาวิชาวิศวกรรมเคมีและกระบวนการ (หลักสูตรนานาชาติ)',
      },
      {
        id: 'eng6',
        name: 'วิศวกรรมเหมืองแร่และปิโตรเลียม (Mining and Petroleum Engineering)',
        description:
          'เป็นสาขาที่บูรณาการความรู้ทาง "วิศวกรรมศาสตร์" เข้ากับ "ธรณีวิทยา" เพื่อบริหารจัดการทรัพยากรใต้พิภพอย่างคุ้มค่า โดยใน ปีที่ 1 จะเริ่มจากพื้นฐานวิทยาศาสตร์และวิศวกรรมทั่วไปควบคู่กับวิชาธรณีวิทยากายภาพ (Physical Geology) เพื่อให้รู้จักกำเนิดโลกและหินชนิดต่างๆ จากนั้น ปีที่ 2 จะเป็นช่วงเวลาของการผสมผสานศาสตร์ โดยเรียนวิชากลศาสตร์วิศวกรรมเหมือนสาขาอื่น แต่เจาะลึกเรื่องแร่วิทยา (Mineralogy) และธรณีวิทยาโครงสร้าง เพื่อให้เข้าใจคุณสมบัติของเปลือกโลกอย่างละเอียด เมื่อเข้าสู่ ปีที่ 3 เนื้อหาจะเข้มข้นในเชิงเทคนิคเฉพาะทางที่หาเรียนที่อื่นไม่ได้ เช่น กลศาสตร์หิน (Rock Mechanics) ซึ่งแตกต่างจากกลศาสตร์ดินของโยธา รวมถึงเทคโนโลยีการเจาะ (Drilling) และการแต่งแร่ (Mineral Processing) เพื่อแยกแร่ธาตุออกจากหิน และใน ปีที่ 4 นิสิตสามารถเลือกเน้นกลุ่มวิชาที่สนใจได้ ทั้งด้าน เหมืองแร่และอุโมงค์ ที่เน้นการออกแบบการขุดเจาะอุโมงค์รถไฟฟ้าหรือเหมืองใต้ดิน หรือด้าน พลังงานและปิโตรเลียม ที่ศึกษาเรื่องแหล่งกักเก็บน้ำมันและก๊าซธรรมชาติ ควบคู่กับการเรียนรู้เรื่องเศรษฐศาสตร์ทรัพยากรและการจัดการสิ่งแวดล้อม เพื่อให้เป็นวิศวกรที่สามารถจัดหาวัตถุดิบต้นน้ำและพลังงานป้อนสู่อุตสาหกรรมโลกได้อย่างยั่งยืนครับ',
        fieldDescription:
          '1. สาขาวิชาวิศวกรรมทรัพยากรธรณี -หลักสูตรระดับปริญญาตรีสาขาวิศวกรรมทรัพยากรธรณีมุ่งเน้นการให้ความรู้พื้นฐานในทุกด้านของการพัฒนาทรัพยากรธรณี ภายหลังจากที่นักศึกษาได้รับพื้นฐานที่กว้างขวางด้านวิทยาศาสตร์และวิศวกรรมพื้นฐานในชั้นปีที่หนึ่งและปีที่สองแล้ว นักศึกษาจะได้รับความรู้เชิงลึกด้านวิศวกรรมทรัพยากรธรณีในภาคการศึกษาที่หนึ่งของชั้นปีที่สาม ซึ่งจะเป็นพื้นฐานสนับสนุนการเรียนรายวิชาขั้นสูงด้านวิศวกรรมทรัพยากรธรณีในชั้นปีที่สามและสี่ หลักสูตรครอบคลุมความรู้แบบสหสาขาวิชาอย่างกว้างขวางเกี่ยวกับหลักการพัฒนาทรัพยากรธรณี ได้แก่ ธรณีวิทยาเหมืองแร่ การสำรวจแร่ การประมาณปริมาณสำรองแร่ การพัฒนาเหมือง วิธีการทำเหมืองทั้งเหมืองเปิดและเหมืองใต้ดิน กลศาสตร์หิน จีโอสถิติ เศรษฐศาสตร์และการจัดการทรัพยากรธรณี การแต่งแร่และการใช้ประโยชน์จากแร่ รวมถึงประเด็นด้านสิ่งแวดล้อมของการดำเนินงานเหมืองแร่และทรัพยากร ซึ่งจัดการเรียนการสอนในระดับชั้นปีที่สามและสี่ \n2. สาขาวิชาวิศวกรรมปิโตรเลียม - หลักสูตรวิศวกรรมปิโตรเลียมระดับปริญญาตรีจัดให้มีรายวิชาหลักที่ครอบคลุมทุกด้านของวิศวกรรมปิโตรเลียม ได้แก่ สมบัติของหินและของไหล วิศวกรรมแหล่งกักเก็บ การหยั่งธรณีหลุมเจาะ วิศวกรรมการเจาะ วิศวกรรมการผลิต การดำเนินงานด้านการผลิต การแปรรูปก๊าซธรรมชาติ และเศรษฐศาสตร์ปิโตรเลียม',
      },
      {
        id: 'eng7',
        name: 'วิศวกรรมสิ่งแวดล้อมและความยั่งยืน (Environmental and Sustainable Engineering)',
        description:
          'เป้าหมายของภาควิชาวิศวกรรมสิ่งแวดล้อมและความยั่งยืน คือการสอนและฝึกอบรมนักศึกษาให้เป็นวิศวกรที่มีความรู้ความสามารถ (ทั้งเชิงทฤษฎีและปฏิบัติ) ด้านการสำรวจ การวางแผนและออกแบบ การให้คำปรึกษา และการดำเนินงานในสาขาต่อไปนี้ \n1. ระบบประปาและการปรับปรุงคุณภาพน้ำ \n2. ระบบระบายน้ำและการบำบัดน้ำเสีย \n3. สุขาภิบาลสิ่งแวดล้อม \n4. สิ่งแวดล้อมอุตสาหกรรม \n5. การควบคุมมลพิษทางอากาศ \n6. การควบคุมและการจัดการมลพิษทางน้ำ \n7. สุขาภิบาลชุมชนเมืองและชนบท \n8. การจัดการขยะมูลฝอย \n9. การบำบัดของเสียอันตราย \n10. การจัดการสิ่งแวดล้อม \nนอกจากนี้ นักศึกษายังมีหน้าที่ต้องใช้ความคิดสร้างสรรค์และความรับผิดชอบต่อตนเอง อีกทั้งได้รับการส่งเสริมให้สนใจเทคนิคต่าง ๆ คาดการณ์ปัญหาในอนาคต และพัฒนาความยั่งยืนของมนุษย์และธรรมชาติ',
        fieldDescription: '1. สาขาวิชาวิศวกรรมสิ่งแวดล้อม',
      },
      {
        id: 'eng8',
        name: 'วิศวกรรมสำรวจ (Survey Engineering)',
        description:
          'เป็นหลักสูตรระยะเวลา 4 ปี ออกแบบให้นักศึกษามีความรู้พื้นฐานด้านวิศวกรรมโดยทั่วไป และมีความรู้เชิงลึกด้านการสำรวจ การทำแผนที่ และเทคโนโลยีภูมิสารสนเทศเป็นพิเศษ หลักสูตรผสมผสานทั้งภาคทฤษฎีและภาคปฏิบัติ นักศึกษาจะได้รับประสบการณ์การใช้เครื่องมือสำรวจต่าง ๆ การทำแผนที่ด้วยคอมพิวเตอร์ และเทคโนโลยีภูมิสารสนเทศ ความมั่นใจและความสามารถในการแก้ไขปัญหาเชิงปฏิบัติในสาขาวิศวกรรมสำรวจจะได้รับการเสริมสร้างผ่านการฝึกภาคสนามและการฝึกงาน ทั้งนี้ นักศึกษาสามารถศึกษาความรู้เชิงลึกเพิ่มเติมได้ โดยได้รับความเห็นชอบจากภาควิชา ผ่านโครงงานระดับปริญญาตรี การศึกษาพิเศษ และรายวิชาเลือกที่ได้รับอนุมัติตามความสนใจของนักศึกษา หลักสูตรคาดว่าจะช่วยให้นักศึกษาสามารถเข้าใจโครงสร้างและข้อกำหนดของงานสำรวจ การทำแผนที่ และเทคโนโลยีภูมิสารสนเทศ ประยุกต์ใช้ทฤษฎีและเทคนิคในการปฏิบัติงานสำรวจและทำแผนที่ทั่วไปได้อย่างมีประสิทธิภาพ ประสิทธิผล และคุ้มค่า วิเคราะห์และใช้กลศาสตร์ของเครื่องมือเพื่อประเมินความถูกต้องและความแม่นยำที่ได้ ติดตามเทคโนโลยีและพัฒนาการใหม่ ๆ ในสาขาการสำรวจ การทำแผนที่ และเทคโนโลยีภูมิสารสนเทศ',
        fieldDescription: '1. สาขาวิชาวิศวกรรมสำรวจ',
      },
      {
        id: 'eng9',
        name: 'วิศวกรรมโลหการ (Metallurgical Engineering)',
        description:
          'ภาควิชาวิศวกรรมโลหการเปิดสอนหลักสูตรด้านวิศวกรรมโลหการและวัสดุ โดยหลักสูตรได้รับการออกแบบเพื่อให้นักศึกษามีความเข้าใจอย่างกว้างขวางเกี่ยวกับวัสดุทุกประเภท ได้แก่ โลหะ เซรามิก และพอลิเมอร์ โดยเน้นความรู้ด้านโลหะเป็นหลัก หลักสูตรระดับปริญญาตรีครอบคลุมเทคนิคพื้นฐานทางวิทยาศาสตร์และวิศวกรรมที่ใช้ในวิชาชีพ มีรายวิชาที่เกี่ยวข้องกับหลักการพื้นฐานของวิทยาศาสตร์และวิศวกรรมวัสดุ กระบวนการและการขึ้นรูปวัสดุ สมบัติและการประยุกต์ใช้ของวัสดุ รวมถึงการออกแบบวัสดุและกระบวนการ นอกจากนี้ หลักสูตรยังประกอบด้วยรายวิชาด้านการปฏิบัติงานทางวิศวกรรมจำนวนมาก เช่น ปฏิบัติการในห้องปฏิบัติการต่าง ๆ โครงงานวิศวกรรม การฝึกปฏิบัติงานทางวิศวกรรม และการศึกษาดูงานในภาคอุตสาหกรรม',
        fieldDescription: '1. สาขาวิชาวิศวกรรมโลหการและวัสดุ',
      },
      {
        id: 'eng10',
        name: 'วิศวกรรมคอมพิวเตอร์ (Computer Engineering)',
        description:
          'ภาควิชาวิศวกรรมคอมพิวเตอร์ (Computer Engineering) จะเรียน เกี่ยวกับการ มาออกแบบ วิเคราะห์ และสร้าง “ระบบ” ทางคอมพิวเตอร์ เพื่อให้ ทํางานได้ตามเป้าหมายที่กําหนด โดยเราจะเรียนตั้งแต่ระดับล่างสุด เช่น โครงสร้างข้อมูลและอัลกอริทึม สถาปัตยกรรมคอมพิวเตอร์ Network ไปจนถึงขั้นการประยุกต์ทําให้เป็นระบบ ต่าง ๆ ออกมา เช่น ระบบฝังตัว Web & Application บนอุปกรณ์คอมพิวเตอร์ และมือถือที่เราใช้ทุกวัน ไปจะถึงระบบคลาวด์และ AI ขนาดใหญ่ ซึ่งเราในฐานะ วิศวกรคอมพิวเตอร์ก็เป็นคนเขียน Software ที่มีประสิทธิภาพ และถูกต้องถูก หลักการและเพื่อสร้างและควบคุมระบบพวกนี้อีกที เนื่องจากคอมพิวเตอร์เป็นศาสตร์ที่ยังพัฒนาอยู่เรื่อย ๆ ตัวหลักสูตร ก็ได้มีการปรับให้ทันสมัยเช่นกัน โดยจะมีวิชาใหม่ ๆ ให้เลือกเรียน เช่น วิชาด้าน Data Science Al/ML และ Cloud Computing ',
        fieldDescription:
          '1. สาขาวิชาวิศวกรรมคอมพิวเตอร์ \n2. สาขาวิชาวิศวกรรมคอมพิวเตอร์และเทคโนโลยีดิจิทัล (CEDT)',
      },
      {
        id: 'eng11',
        name: 'วิศวกรรมนิวเคลียร์ (Nuclear Engineering)',
        description:
          'หลักสูตรมีลักษณะสหวิทยาการ และได้รับการออกแบบให้ครอบคลุมหลักการที่หลากหลายของเทคโนโลยีนิวเคลียร์และวิศวกรรมนิวเคลียร์ ตั้งแต่พื้นฐานด้านวิทยาศาสตร์และคณิตศาสตร์ ไปจนถึงการประยุกต์ใช้งานทางวิศวกรรมเฉพาะทาง สาขาความเชี่ยวชาญประกอบด้วย วิศวกรรมพลังงานนิวเคลียร์ การประยุกต์ใช้รังสีและเทคโนโลยีนิวเคลียร์ด้านสิ่งแวดล้อมและอุตสาหกรรม เครื่องมือวัดทางนิวเคลียร์ ความมั่นคงทางนิวเคลียร์ เทคโนโลยีเครื่องเร่งอนุภาค กระบวนการใช้รังสี การป้องกันรังสี และวัสดุนิวเคลียร์ นอกจากนี้ หลักสูตรระดับปริญญาตรีและปริญญาโทยังให้ทั้งความรู้ภาคทฤษฎีและภาคปฏิบัติสำหรับผู้ที่ประสงค์จะขอรับใบอนุญาตเจ้าหน้าที่ความปลอดภัยทางรังสี (Radiation Safety Officer: RSO)',
        fieldDescription: '1. สาขาวิชาวิศวกรรมนิวเคลียร์และรังสี',
      },
      {
        id: 'eng12',
        name: 'สำนักบริหารหลักสูตรวิศวกรรมนานาชาติ, ISE (International School of Engineering)',
        description:
          'เป็นหลักสูตร ""วิศวกรรมศาสตรบัณฑิต หลักสูตรนานาชาติ"" ของจุฬาลงกรณ์มหาวิทยาลัย หรือที่เรียกกันติดปากว่า ""วิศวะอินเตอร์ จุฬาฯ"" เป็นคณะที่จัดการเรียนการสอนเป็นภาษาอังกฤษทั้งหมด เน้นความเป็นสากล และมีการร่วมมือกับมหาวิทยาลัยชั้นนำในต่างประเทศ ',
        fieldDescription:
          '1. สาขาวิชาการออกแบบและการผลิตยานยนต์ (หลักสูตรนานาชาติ) \n2. สาขาวิชาวิศวกรรมนาโน (หลักสูตรนานาชาติ) \n3. สาขาวิชาวิศวกรรมสารสนเทศและการสื่อสาร (หลักสูตรนานาชาติ) \n4. สาขาวิชาวิศวกรรมอากาศยาน (หลักสูตรนานาชาติ) \n5. สาขาวิชาวิศวกรรมหุ่นยนต์และปัญญาประดิษฐ์ (หลักสูตรนานาชาติ) \n6. สาขาวิชาวิศวกรรมเซมิคอนดักเตอร์ (หลักสูตรนานาชาติ)',
      },
    ],
    imagePath: '/info/faculty/eng.webp',
    location: 'https://maps.app.goo.gl/Yrdn7tiRvRFSh6LdA?g_st=ic',
    websiteUrl: 'https://www.eng.chula.ac.th/',
  },
  // คณะศิลปกรรมศาสตร์
  {
    id: 'faa',
    name: 'คณะศิลปกรรมศาสตร์',
    majors: [
      {
        id: 'faa1',
        name: 'ทัศนศิลป์',
        description:
          'ศึกษาทฤษฎีและการสร้างสรรค์เกี่ยวกับ Visual Arts หรือลักษณะของศิลปะบริสุทธิ์ อาทิ จิตรกรรม ประติมากรรม ภาพพิมพ์ และภาพถ่าย',
        fieldDescription:
          '(หลักสูตรปัจจุบัน) เรียนรวมทุกศาสตร์สาขา ได้แก่ จิตรกรรม ประติมากรรม ภาพพิมพ์ ศิลปะไทย และภาพถ่าย',
      },
      {
        id: 'faa2',
        name: 'ดุริยางคศิลป์',
        description:
          'ศึกษาวิชาการ ทฤษฎี และปฏิบัติการ ทางดุริยางคศาสตร์ไทยและตะวันตก เพื่อเป็นแนวทางในการสร้างสรรค์ผลิตผลทางดุริยางคศิลป์',
        fieldDescription:
          '1) สาขาดุริยางคศิลป์ไทย \n2) สาขาดุริยางคศิลป์ตะวันตก',
      },
      {
        id: 'faa3',
        name: 'นฤมิตศิลป์',
        description:
          'ศึกษาในเชิงทฤษฎีประยุกต์ศิลป์ โดยประยุกต์ผ่านพื้นฐานของศาสตร์วิจิตรศิลป์ เพื่อพัฒนาและแก้ไขปัญหาของสังคมในด้านต่างๆ ',
        fieldDescription:
          '1) เรขศิลป์ (Creative Graphics) \n2) หัตถศิลป์ (Creative Crafts) \n3) มัณฑนศิลป์ (Creative Decoration) \n4) นิทรรศการศิลป์ (Creative Exhibition)',
      },
      {
        id: 'faa4',
        name: 'นาฏยศิลป์',
        description:
          'ศึกษาหลักการทางวิชาการ ทฤษฎี และปฏิบัติการในด้านนาฏยศาสตร์ไทยและตะวันตก การบริหารจัดการการแสดง เพื่อผลิตผลงานทางนาฏยศิลป์',
        fieldDescription: '1) สาขานาฏยศิลป์ไทย \n2) สาขานาฏยศิลป์ตะวันตก',
      },
    ],
    location: 'https://share.google/9TS6eZaymKHG5xrSo',
    imagePath: '/info/faculty/faa.webp',
    websiteUrl: 'https://www.faa.chula.ac.th/',
  },
  // คณะเศรษฐศาสตร์
  {
    id: 'econ',
    name: 'คณะเศรษฐศาสตร์',
    majors: [
      {
        id: 'econ1',
        name: 'หลักสูตรเศรษฐศาสตรบัณฑิต (ศ.บ.)',
        description:
          'มุ่งเน้นการเรียนการสอนด้านเศรษฐศาสตร์ควบคู่การใช้คณิตศาสตร์และสถิติ เพื่อพัฒนาทักษะการคิดวิเคราะห์ การแก้ปัญหา และการจัดการข้อมูลเชิงเศรษฐศาสตร์ เตรียมความพร้อมให้นิสิตสู่สายงานด้านการเงิน กลยุทธ์ และการวิเคราะห์ในองค์กรต่าง ๆ ผู้เรียนจะได้ศึกษาเศรษฐกิจทั้งในและต่างประเทศ รวมถึงประเด็นร่วมสมัยและการเปลี่ยนแปลงทางการเงินในยุคใหม่',
        fieldDescription:
          'หลักสูตรไม่มีการแยกสาขา แต่ในช่วง ปี 1 ถึง ปี 2 เทอม 1 จะเรียนเป็นวิชาพื้นฐาน เช่น เศรษฐศาสตร์จุลภาค มหภาค โดยตั้งแต่ปี 2 เทอม 2 เป็นต้นไป จะสามารถเลือกเรียนวิชาได้ตามที่ต้องการ ซึ่งแต่ละวิชาจะมีข้อกำหนดอยู่ว่าจะต้องผ่านวิชาใดมาก่อนบ้าง โดยที่ในแต่ละวิชา สามารถเลือกตอนเรียนได้ตามต้องการ',
      },
      {
        id: 'econ2',
        name: 'หลักสูตรศิลปศาสตรบัณฑิต (ศศ.บ.) เศรษฐศาสตร์นานาชาติ  EBA ',
        description:
          'มุ่งเน้นการเรียนการสอนด้านเศรษฐศาสตร์ควบคู่การใช้คณิตศาสตร์และสถิติ เพื่อพัฒนาทักษะการคิดวิเคราะห์ การแก้ปัญหา และการจัดการข้อมูลเชิงเศรษฐศาสตร์ เตรียมความพร้อมให้นิสิตสู่สายงานด้านการเงิน กลยุทธ์ และการวิเคราะห์ในองค์กรต่าง ๆ ผู้เรียนจะได้ศึกษาเศรษฐกิจทั้งในและต่างประเทศ รวมถึงประเด็นร่วมสมัยและการเปลี่ยนแปลงทางการเงินในยุคใหม่',
        fieldDescription:
          'หลักสูตรไม่มีการแยกสาขา โดยในช่วงปี 1–2 จะเรียนวิชาพื้นฐานด้านเศรษฐศาสตร์ สถิติ การเงิน และการบัญชี ก่อนเลือกเรียนวิชาเฉพาะทางตามความสนใจตั้งแต่ปี 3 เป็นต้นไป เมื่อสำเร็จการศึกษาได้รับวุฒิศิลปศาสตร์บัณฑิต',
      },
    ],
    location: 'https://maps.app.goo.gl/RaFfYpJvQzeDdYyJA',
    imagePath: '/info/faculty/econ.webp',
    websiteUrl: 'https://www.econ.chula.ac.th/',
  },
  // คณะสถาปัตยกรรมศาสตร์
  {
    id: 'arch',
    name: 'คณะสถาปัตยกรรมศาสตร์',
    majors: [
      {
        id: 'arch1',
        name: 'ภาควิชาสถาปัตยกรรมศาสตร์ สาขาสถาปัตยกรรม',
        description:
          'มุ่งเน้นความเป็นวิชาชีพออกแบบทางสถาปัตยกรรม โดยคำนึงถึงการออกแบบสถาปัตยกรรมและสภาพแวดล้อมสรรค์สร้าง ที่มีการวิเคราะห์และแก้ไขปัญหาในเชิงกว้างเป็นภาพองค์รวม ตลอดจนมีความรับผิดชอบต่อสังคม',
        fieldDescription: '-',
      },
      {
        id: 'arch2',
        name: 'ภาควิชาสถาปัตยกรรมศาสตร์ สาขาสถาปัตยกรรมไทย',
        description:
          'มุ่งเน้นความเป็นวิชาชีพออกแบบทางสถาปัตยกรรมไทยโดยคำนึงถึงการออกแบบสถาปัตยกรรมและสภาพแวดล้อมสรรค์สร้าง ที่มีการวิเคราะห์และแก้ไขปัญหาในเชิงกว้างเป็นภาพองค์รวม ตลอดจนมีความรับผิดชอบต่อสังคมอย่างเหมาะสมกับกาลเทศะ',
        fieldDescription: '-',
      },
      {
        id: 'arch3',
        name: 'ภาควิชาสถาปัตยกรรมภายใน',
        description:
          'มุ่งเน้นการวางแผนและการจัดการพื้นที่โดยผสมผสานการใช้งานและศิลปะเข้าด้วยกัน จำเป็นต้องมีความรู้เกี่ยวกับรูปแบบสถาปัตยกรรม สภาพแวดล้อม พฤติกรรมมนุษย์ วัสดุก่อสร้างและเทคโนโลยี',
        fieldDescription: '-',
      },
      {
        id: 'arch4',
        name: 'ภาควิชาการวางแผนภาคและเมือง',
        description:
          'ปฏิบัติการในด้านการออกแบบเมือง (Urban Design) และด้านการวางแผน (Planning) การวิเคราะห์เชิงพื้นที่สำหรับการวางผังและออกแบบ ตลอดจนทฤษฎีและแนวคิดการพัฒนาเมืองเชิงลึกในทุกมิติทั้งเศรษฐกิจ สังคม กายภาพและสิ่งแวดล้อม',
        fieldDescription: '-',
      },
      {
        id: 'arch5',
        name: 'ภาควิชาภูมิสถาปัตยกรรม',
        description:
          'การผลิตผังบริเวณแสดงถึง การสร้างภูมิทศัน์ที่ประกอบไปด้วยการวางแผน การออกแบบ การกำหนดการใช้วัสดุพืชพันธุ์ในภูมิทัศน์ พัฒนาผังบริเวณ และระบบสาธารณูปโภคต่างๆ การพัฒนา อนุรักษ์ สร้างสรรค์ ประเมินผลกระทบของการพัฒนาและสร้างสรรค์ภูมิทัศน์นั้นต่อสิ่งแวดล้อม',
        fieldDescription: '-',
      },
      {
        id: 'arch6',
        name: 'ภาควิชาการออกแบบอุตสาหกรรม',
        description:
          'ส่งเสริมให้ผู้เรียนได้วางแผนการเรียนของตนเอง ทำให้ผู้เรียนสามารถผลิตผลงานในระดับนวัตกรรมในระบบอุตสาหกรรม หัตถอุตสาหกรรม อุตสาหกรรมดิจิตัล ตลอดจนอุตสาหกรรมใหม่ๆที่เปลี่ยนแปลงตามกระแสโลก',
        fieldDescription: '-',
      },
      {
        id: 'arch7',
        name: 'หลักสูตรนานาชาติ การออกแบบนิเทศศิลป์ CommDe',
        description:
          'เน้นการสื่อสารที่หลากหลาย ตั้งแต่การออกแบบเพื่อสิ่งพิมพ์ไปจนถึงการสื่อสารผ่านสื่อใหม่ การออกแบบกราฟิก ภาพประกอบ ภาพเคลื่อนไหว การออกแบบตามเวลา การออกแบบบนอินเทอร์เน็ต การออกแบบดิจิทัล และสื่อเกิดใหม่และสื่อแห่งอนาคต',
        fieldDescription: '-',
      },
      {
        id: 'arch8',
        name: 'หลักสูตรนานาชาติ การออกแบบสถาปัตยกรรม INDA',
        description:
          'การออกแบบและการสื่อสาร ประวัติศาสตร์และทฤษฎี ตลอดจนการก่อสร้างทางสถาปัตยกรรมและเทคโนโลยีสิ่งแวดล้อม มีจุดมุ่งหมายเพื่อแสดงให้เห็นว่าสถาปัตยกรรมเชื่อมโยงกับสาขาวิชาอื่นๆ อย่างไร',
        fieldDescription: '-',
      },
    ],
    location: 'https://maps.app.goo.gl/wRYfUTKsSASzW1uz8',
    imagePath: '/info/faculty/arch.webp',
    websiteUrl: 'https://www.arch.chula.ac.th/',
  },
  // คณะสหเวชศาสตร์
  {
    id: 'ahs',
    name: 'คณะสหเวชศาสตร์',
    majors: [
      {
        id: 'ahs1',
        name: 'เทคนิคการแพทย์ (Medical Technology)',
        description:
          'สาขาเทคนิคการแพทย์เรียนเกี่ยวกับการปฏิบัติการเกี่ยวกับสารชีวโมเลกุลของมนุษย์ เช่น เลือด ปัสสาวะ อุจจาระและเรียนกับเกี่ยวกับจุลชีพแต่ละชนิด เรียนการเจาะเลือดเพื่อตรวจความผิดปกติ',
        fieldDescription:
          '1. ภาควิชาเคมีคลินิก เรียนเกี่ยวกับการตรวจวิเคราะห์สารชีวเคมีในร่างกาย รวมถึงการตรวจสารพันธุกรรม \n2. ภาควิชาจุลทรรศน์ศาสตร์คลินิก เรียนเกี่ยวกับการตรวจวิเคราะห์และหาความผิดปกติจากเลือด และตรวจวิเคราะห์ของเหลวในร่างกาย เช่น น้ำปัสสาวะ น้ำไขข้อ น้ำอสุจิ รวมถึงการตรวจอุจจาระเพื่อหาปรสิต \n3. ภาควิชาเวชศาสตร์การธนาคารเลือดและจุลชีววิทยาคลินิก เรียนเกี่ยวกับการตรวจหาเชื้อและจำแนกชนิดของเชื้อต่าง ๆ รวมถึงการตรวจวิเคราะห์ทางภูมิคุ้มกันคลินิก และธนาคารเลือด',
      },
      {
        id: 'ahs2',
        name: 'กายภาพบําบัด (Physical Therapy)',
        description:
          'เกี่ยวข้องกับการดูแลสุขภาพในแง่ของการส่งเสริมป้องกันรักษาและฟื้นฟูสุขภาพร่างกายและจิตใจโดยใช้วิธีตามหลักวิทยาศาสตร์และการใช้ เครื่องมือหรืออุปกรณ์ทางกายภาพบำบัด โดยมีเป้าหมายให้มีสุขภาพและมี ความสามารถในการทำงานของร่างกายอย่างเต็มที่',
        fieldDescription: '-',
      },
      {
        id: 'ahs3',
        name: 'โภชนาการและการกำหนดอาหาร (Nutrition and Dietetics)',
        description:
          'เรียนเกี่ยวกับหลักโภชนาการที่เหมาะสมกับแต่ละบุคคลในวัยต่างๆ และกลุ่มโรคต่างๆ หลักการให้คำปรึกษา และโภชนบำบัดเพื่อส่งเสริมกับการรักษาของแพทย์ และหลักวิทยาศาสตร์การอาหารเบื้องต้นที่สามารถนำมาต่อยอดเพื่อวิจัยและพัฒนาผลิตภัณฑ์อาหารสุขภาพได้อีกด้วย',
        fieldDescription:
          '1. โภชนคลินิก เรียนเกี่ยวกับการให้โภชนบำบัดแก่ผู้ป่วยในโรงพยาบาล \n2. โภชนชุมชน ให้ความรู้และคิดโครงการเพื่อส่งเสริมให้คนในชุมชมมีภาวะโภชนาการที่ดีขึ้น \n3. โภชนบริการ การจัดการบริการอาหารให้ผู้ป่วยในโรงพยาบาลตามคำสั่ง ทั้งอาหารทั่วไป อาหารเฉพาะโรคและอาหารทางสายให้อาหาร',
      },
      {
        id: 'ahs4',
        name: 'รังสีเทคนิค (Radiological Technology)',
        description:
          'หลักสูตรรังสีเทคนิคศึกษาเกี่ยวกับการใช้รังสีทางการแพทย์ ทั้งด้านวินิจฉัยและรักษาโรค รวมถึงพื้นฐานวิทยาศาสตร์การแพทย์ และการฝึกปฏิบัติงานในโรงพยาบาลชั้นนำของกระทรวงสาธารณสุข โดยรังสีเทคนิค จุฬาฯ เป็นความร่วมมือระหว่างคณะสหเวชศาสตร์ คณะแพทยศาสตร์ และโรงพยาบาลจุฬาลงกรณ์',
        fieldDescription:
          'แบ่งออกเป็น 3 ด้านหลัก ได้แก่ \n1. รังสีวินิจฉัย – การใช้เครื่องมือรังสี เช่น X-ray, CT, MRI เพื่อสร้างภาพทางการแพทย์ที่ใช้ในการวินิจฉัยโรค \n2. รังสีรักษา – การใช้รังสีเพื่อรักษามะเร็งและโรคอื่น ๆ ผ่านเทคนิคต่าง ๆ เช่น รังสีรักษาภายนอกและภายใน \n3. เวชศาสตร์นิวเคลียร์ – การใช้สารกัมมันตรังสีเพื่อวินิจฉัยและรักษาโรค เช่น การตรวจ PET scan',
      },
    ],
    location: 'https://maps.app.goo.gl/NYFfZPegMsyjzeEa8',
    imagePath: '/info/faculty/ahs.webp',
    websiteUrl: 'https://www.ahs.chula.ac.th/',
  },
  // คณะสัตวแพทยศาสตร์
  {
    id: 'vet',
    name: 'คณะสัตวแพทยศาสตร์',
    majors: [
      {
        id: 'vet1',
        name: 'หลักสูตรสัตวแพทยศาสตรบัณฑิต',
        description:
          'หลักสูตร 6 ปี ศึกษาเกี่ยวกับด้านวิทยาศาสตร์การแพทย์เพื่อนำมาใช้ในการประกอบวิชาชีพ การดูแลรักษาสุขภาพสัตว์และสวัสดิภาพสัตว์ การวินิจฉัยโรค การควบคุมและป้องกันโรค รวมไปถึงทางด้านสาธารณสุข เป็นต้น',
        fieldDescription: '-',
      },
    ],
    location: 'https://maps.app.goo.gl/wzMwLsX41NHa8F8J6?g_st=ic',
    imagePath: '/info/faculty/vet.webp',
    websiteUrl: 'https://www.vet.chula.ac.th/',
  },
  // คณะอักษรศาสตร์
  {
    id: 'arts',
    name: 'คณะอักษรศาสตร์',
    majors: [
      {
        id: 'arts1',
        name: 'เอกภาษาไทย',
        description:
          'มุ่งพัฒนาสมรรถนะนิสิตให้เชี่ยวชาญด้านภาษา วรรณคดี และคติชนไทย โดยคณาจารย์ผู้ทรงคุณวุฒิหลากหลายแขนง ควบคู่ไปกับการเสริมสร้างเครือข่ายความสัมพันธ์ที่ยั่งยืนระหว่างกลุ่มนิสิต เพื่อให้ “ความรู้” งอกงามไปพร้อมกับ“ความอบอุ่น” อย่างแท้จริง',
        fieldDescription: '-',
      },
      {
        id: 'arts2',
        name: 'เอกภาษาอังกฤษ',
        description:
          'เอกอังกฤษไม่ได้เรียนเพียงแค่หลักไวยากรณ์เท่านั้น แต่ยังเรียนการใช้ภาษาอังกฤษที่ถูกต้องในหลาย ๆ บริบท การพูด การฟังที่ใช้งานได้จริง การแปลงานเขียนหลายแบบ รวมทั้งยังได้เรียนวรรณกรรมและการอ่าน คิด วิเคราะห์ และเรียนการมองภาษาในระดับโครงสร้างในกลุ่มรายวิชาภาษาศาสตร์ เพราะภาษาอังกฤษมีมากกว่าแค่กฎแกรมม่า',
        fieldDescription: '-',
      },
      {
        id: 'arts3',
        name: 'เอกประวัติศาสตร์',
        description:
          'เอกประวัติศาสตร์มีวิชาให้เลือกเรียนหลากหลาย ไม่ว่าจะเป็นประวัติศาสตร์สังคม วัฒนธรรม เพศสภาพ อารมณ์ ฯลฯ ในภูมิภาคต่าง ๆ ทั่วโลก อีกทั้งทุกคนจะได้สัมผัสวิธีการทำงานกับหลักฐานทางประวัติศาสตร์จริง ๆ ไม่ใช่แค่การจำชื่อคน และการเรียนประวัติศาสตร์จะไม่น่าเบื่ออีกต่อไป',
        fieldDescription: '-',
      },
      {
        id: 'arts4',
        name: 'เอกภูมิศาสตร์และภูมิสารสนเทศ',
        description:
          '“ภูมิศาสตร์” ไม่ใช่แค่เรื่องของแผนที่หรือการท่องจำประเทศ แต่คือการทำความเข้าใจโลกผ่านปฏิสัมพันธ์เชิงพื้นที่ระหว่างธรรมชาติกับผู้คน แบ่งเนื้อหาออกได้เป็น 3 สายย่อย ได้แก่ สายกายภาพ สายมนุษย์ และสายเทคนิค นอกจากนี้ที่สำคัญที่​สุด คือ มีกิจกรรมออกภาคสนามเกือบทุกเทอม ตั้งแต่การเดินสำรวจย่านชุมชน ขึ้นเขา ลงห้วย ไปจนถึงการได้ผจญภัยในถํ้า มีการเรียนสถิติ หรือวิชาของคณะวิศวะ รวมถึงจะได้ลองทำ Mini Project ทางภูมิศาสตร์​อยู่เสมอ',
        fieldDescription: '-',
      },
      {
        id: 'arts5',
        name: 'เอกสารสนเทศศึกษา',
        description:
          'เอกสารสนเทศพัฒนาจากบรรณารักษศาสตร์สู่การจัดการข้อมูลดิจิทัลที่เน้นความเป็นมนุษย์ ครอบคลุม Data Management, Content Creation และ Research & Innovation ฯลฯ เพื่อสร้างสรรค์เทคโนโลยีให้ตอบโจทย์ผู้ใช้ เข้าใจบริบทสังคม และจัดการมรดกทางวัฒนธรรมได้อย่างยั่งยืน ในโลกที่ข้อมูลไม่ได้อยู่แค่ในห้องสมุด',
        fieldDescription: '-',
      },
      {
        id: 'arts6',
        name: 'เอกศิลปการละคร',
        description:
          'นอกจากจะได้เรียนทักษะเฉพาะด้านเกี่ยวกับศิลปการละครที่มีมากกว่าการแสดงหรือการกำกับ ในเอกก็มีพื้นที่ให้นิสิตได้ทำโปรดักชันละครเวทีจำนวนมาก เป็นโอกาสให้ได้ลองฝึกทำงานกับศิลปะโดยนำทักษะความรู้ที่เรียนมาปฏิบัติจริง และฝึกการสื่อสาร การดีลกับผู้คนหลายแบบด้วย',
        fieldDescription: '-',
      },
      {
        id: 'arts7',
        name: 'เอกภาษาเอเชียใต้',
        description:
          'ศึกษาเกี่ยวกับอารยธรรมอินเดีย โดยจะมีจัดการเรียนการสอนครอบคลุม 3 ภาษาหลัก ได้แก่ 1. ภาษาสันสกฤต 2. ภาษาบาลี และ 3. ภาษาฮินดี นอกจากทักษะทางภาษาแล้ว ยังจะได้ศึกษาเจาะลึกในมิติต่าง ๆ ของอินเดีย ทั้งด้านประวัติศาสตร์ วรรณคดี เทวตำนาน และยังได้ศึกษาเกี่ยวกับคติความเชื่อและการสักการะบูชาเทพเจ้าตามขนบธรรมเนียมที่ถูกต้องอีกด้วย',
        fieldDescription: '-',
      },
      {
        id: 'arts8',
        name: 'เอกปรัชญา',
        description:
          'ปรัชญาคือ การสนทนาระหว่างตัวเราและโลกที่โอบอุ้มภูมิปัญญาและองค์ความรู้ของมนุษย์ สิ่งสำคัญไม่ใช่คำตอบที่ได้ แต่คือคำถามที่เกิดจากความสงสัยอันไร้ขอบเขต การเรียนปรัชญาจึงเป็นการมอบความรักต่อความรู้อย่างไม่รู้เบื่อนั่นเอง',
        fieldDescription: '-',
      },
      {
        id: 'arts9',
        name: 'เอกภาษาจีน',
        description:
          'เอกภาษาจีนศึกษาเนื้อหาเกี่ยวกับวัฒนธรรมจีนในด้านต่าง ๆ เช่น วิวัฒนาการตัวอักษรจีน วรรณกรรมจีน ภาษาจีนโบราณ ควบคู่ไปกับการเรียนสัทศาสตร์ภาษาจีน รวมไปถึงศึกษาประวัติศาสตร์และสภาพสังคมของจีนในปัจจุบัน นอกจากนี้ยังได้เรียนรู้ทักษะการฟัง-พูดและการแปลระหว่างภาษาจีนและภาษาไทยอีกด้วย',
        fieldDescription: '-',
      },
      {
        id: 'arts10',
        name: 'เอกภาษาญี่ปุ่น',
        description:
          'ถ้าพูดถึงเอกญี่ปุ่น จุฬาฯ ทุกคนก็คงนึกถึง “ภาษาญี่ปุ่น” แน่นอน แต่จริง ๆ แล้วเอกของเรามีทั้งวิชาเกี่ยวกับความรู้ทางภาษาอย่างไวยากรณ์หรือทักษะการฟัง-พูด-อ่าน-เขียน นอกจากนี้ก็ยังมีวิชาเกี่ยวกับวรรณคดี วัฒนธรรม ภาษาศาสตร์ และกลุ่มวิชาเพื่อวิชาชีพ ใครสนใจก็แวะมาเจอกันที่งาน Open House นะ',
        fieldDescription: '-',
      },
      {
        id: 'arts11',
        name: 'เอกภาษาเกาหลี',
        description:
          'มุ่งเน้นไปที่การเสริมสร้างและพัฒนาทักษะความสามารถทางภาษาเกาหลีของนิสิต ทั้งการพูด การฟัง และการเขียนอย่างเข้มข้น อีกทั้งยังมีการส่งเสริมทักษะด้านอื่น ๆ เพื่อให้นิสิตสามารถประยุกต์ความสามารถทางภาษาเข้ากับการประกอบอาชีพในอนาคตได้ โดยนิสิตสามารถเลือกศึกษารายวิชาเฉพาะทางตามความสนใจ อาทิ วิชาการแปล วิชาการล่าม วิชาวัฒนธรรม วิชาวรรณกรรม หรือวิชาภาษาศาสตร์ วิชาภาษาเกาหลีธุรกิจ เป็นต้น',
        fieldDescription: '-',
      },
      {
        id: 'arts12',
        name: 'เอกภาษาฝรั่งเศส',
        description:
          'เอกภาษาฝรั่งเศสไม่เพียงแค่เรียนภาษาฝรั่งเศสในด้านฟัง พูด อ่าน เขียน คำศัพท์และไวยากรณ์เท่านั้น แต่ยังมีวิชาในแขนงความรู้ต่าง ๆ เช่น อารยธรรม ภาษาศาสตร์ วรรณกรรม ศิลปะ ไปจนถึงการแปล การท่องเที่ยว และธุรกิจด้วย นอกจากนี้ เอกฝรั่งเศสยังสอนให้เข้าใจวัฒนธรรมและวิธีการจัดระบบความคิดแบบฝรั่งเศส',
        fieldDescription: '-',
      },
      {
        id: 'arts13',
        name: 'เอกภาษาเยอรมัน',
        description:
          'เอกเยอรมันเรียน Grammar และศัพท์ระดับ B1 ถึง C1 ได้ฝึกฟังพูดอ่านเขียน  ความรู้ด้านประวัติศาสตร์ ภูมิศาสตร์ การเมือง เศรษฐกิจ วรรณกรรมมีครบจบในหลักสูตร แต่ละวิชาได้ใช้จริง เช่น เยอรมันเพื่อธุรกิจ และการเขียน มีกิจกรรม First Meet และ Deutschcamp ประจำปี ที่สำคัญเรามีทุนเรียนภาษาและฝึกงานเสมอ',
        fieldDescription: '-',
      },
      {
        id: 'arts14',
        name: 'เอกภาษาสเปน',
        description:
          'ในเอกสเปน นอกจากจะมีบรรยากาศที่สนุกสนานเฮฮาแล้ว หลักสูตรของเรายังมีศาสตร์ที่หลากหลายทั้งฝั่งสเปนและลาตินอเมริกา ไม่ว่าจะเป็นวรรณกรรม ประวัติศาสตร์ ภาษาศาสตร์ วัฒนธรรม รวมทั้งทักษะทางวิชาชีพต่าง ๆ ในการทำงาน เช่น การแปล การล่าม การท่องเที่ยว กฎหมาย ธุรกิจ สื่อสารมวลชน ฯลฯ',
        fieldDescription: '-',
      },
      {
        id: 'arts15',
        name: 'เอกภาษาอิตาเลียน',
        description:
          'ประเทศอิตาลีถือเป็นหนึ่งในต้นธารของอารยธรรมตะวันตก การเรียนในเอกภาษาอิตาเลียนจึงไม่ได้เป็นแค่การศึกษาด้านทักษะการใช้ภาษาแต่รวมไปถึงประวัติศาสตร์ความคิด ภูมิหลังของศิลปะ วรรณกรรม อันเป็นส่วนกอปรให้เกิดความเป็นอิตาเลียนในทุกวันนี้ด้วยเช่นกัน',
        fieldDescription: '-',
      },
      {
        id: 'arts16',
        name: 'เอกภาษารัสเซีย',
        description:
          'เอกรัสเซียเรียนทั้งภาษาและวัฒนธรรม มีการเรียนทั้งภาคบรรยายและปฏิบัติ ครอบคลุมทักษะฟัง-พูด-อ่าน-เขียน การแปล วรรณกรรม ประวัติศาสตร์ ศิลปะ และสังคมการเมือง รวมถึงกิจกรรมและทัศนศึกษา เพื่อให้ใช้ภาษารัสเซียได้จริงและเข้าใจรัสเซียรอบด้าน',
        fieldDescription: '-',
      },
      {
        id: 'arts17',
        name: 'เอกวรรณกรรมโลกและการเขียนเชิงสร้างสรรค์',
        description:
          'มุ่งเน้นการอ่าน วิเคราะห์ วิจารณ์วรรณกรรมจากทั่วโลกหลากหลายภาษาและวัฒนธรรม พร้อมทั้งพัฒนาทักษะการเขียนเชิงสร้างสรรค์ในรูปแบบต่าง ๆ โดยเป็นการร่วมมือระหว่างภาควิชา วรรณคดีเปรียบเทียบ และภาควิชาภาษาอังกฤษ เพื่อให้สามารถผลิตงานเขียนที่มีเอกลักษณ์และสื่อสารได้หลากหลายวัฒนธรรม',
        fieldDescription: '-',
      },
      {
        id: 'arts18',
        name: 'เอกเทคโนโลยีภาษาและสารสนเทศ',
        description:
          'หลักสูตรที่ผสมผสานมนุษยศาสตร์กับเทคโนโลยีเข้าด้วยกัน ประกอบด้วยองค์ความรู้ 3 แขนง ได้แก่ ภาษาศาสตร์ สารสนเทศ และวิทยาการคอมพิวเตอร์ ศึกษาตั้งแต่ธรรมชาติและระบบของภาษามนุษย์โดยใช้ทฤษฎีทางวิทยาศาสตร์  การวิเคราะห์ข้อมูล การออกแบบระบบสารสนเทศ นอกจากนี้ยังมีการประยุกต์ใช้เทคโนโลยีเข้ากับงานด้านภาษาเพื่อมุ่งเน้นให้คอมพิวเตอร์สามารถตีความ ทำความเข้าใจ และจัดการภาษามนุษย์ได้ทั้งในรูปแบบภาษาพูดและภาษาเขียน เพื่อให้นิสิตมีความพร้อมและสามารถปรับตัวให้เข้ากับความท้าทายในโลกดิจิทัล',
        fieldDescription: '-',
      },
      {
        id: 'arts19',
        name: '(หลักสูตรนานาชาติ) ภาษาและวัฒนธรรม (BALAC)',
        description:
          'ศึกษาเกี่ยวกับ ภาษา วัฒนธรรม และสื่อในบริบทของโลกปัจจุบัน เพื่อทำความเข้าใจว่าสิ่งเหล่านี้มีผลต่อความคิดและพฤติกรรมของคนอย่างไร นอกจากนี้ยังได้ฝึกทักษะการคิดวิเคราะห์ การเขียน การนำเสนอ และการทำงานเป็นทีม โดยมี 3 concentrations (โท) ได้แก่ \n1. Media Culture เน้นศึกษาการวิเคราะห์สื่อ หนัง เพลง โซเชียลมีเดีย และวัฒนธรรมร่วมสมัย \n2. Global Culture เน้นศึกษาวัฒนธรรมโลก อัตลักษณ์ และประเด็นสังคม \n3. Language เน้นศึกษาการใช้ภาษาเพื่อการสื่อสาร การเขียน การนำเสนอ',
        fieldDescription: '-',
      },
    ],
    location: 'https://maps.app.goo.gl/SQnx4op4EhptLACR9?g_st=ipc',
    imagePath: '/info/faculty/arts.webp',
    websiteUrl: 'https://www.arts.chula.ac.th/',
  },
  // สถาบันนวัตกรรมบูรณาการแห่งจุฬาลงกรณ์มหาวิทยาลัย
  {
    id: 'scii',
    name: 'สถาบันนวัตกรรมบูรณาการแห่งจุฬาลงกรณ์มหาวิทยาลัย',
    majors: [
      {
        id: 'scii1',
        name: 'Applied Digital Intelligence (เป็นสาขา ไม่มีภาควิชา)',
        description:
          'มุ่งเน้นการใช้ข้อมูล AI และเทคโนโลยีดิจิทัล เพื่อพัฒนาศักยภาพในการขับเคลื่อนนวัตกรรม ผ่านการเรียนรู้แบบลงมือทำจริง นักศึกษาจะได้ฝึกประยุกต์ใช้ดิจิทัลอินเทลลิเจนซ์แก้ปัญหาในหลากหลายอุตสาหกรรม เตรียมพร้อมสู่การเป็นผู้นำในเศรษฐกิจดิจิทัล',
        fieldDescription: '-',
      },
      {
        id: 'scii2',
        name: 'Health and Wellbeing (เป็นสาขา ไม่มีภาควิชา)',
        description:
          'มุ่งพัฒนาเทคโนโลยีและนวัตกรรมเพื่อยกระดับสุขภาพทั้งในระดับบุคคลและสังคม ผ่านการเรียนรู้แบบสหสาขา นักศึกษาจะประยุกต์งานวิจัย เทคโนโลยี และแนวคิดทางธุรกิจ เพื่อแก้ปัญหาด้านสุขภาพ ส่งเสริมคุณภาพชีวิตและความเป็นอยู่ที่ดีของชุมชน',
        fieldDescription: '-',
      },
      {
        id: 'scii3',
        name: 'Smart City and Sustainable Development (เป็นสาขา ไม่มีภาควิชา)',
        description:
          'เสริมศักยภาพให้นักศึกษาออกแบบและพัฒนาโซลูชันเมืองอย่างยั่งยืน สอดคล้องกับเป้าหมาย SDGs โดยผสานเทคโนโลยีล้ำสมัยกับแนวคิดการพัฒนาที่ยั่งยืน เพื่อแก้ปัญหาเมือง ทรัพยากร และการเปลี่ยนแปลงสภาพภูมิอากาศ สร้างเมืองอัจฉริยะที่ยืดหยุ่นและเป็นมิตรต่อสิ่งแวดล้อม',
        fieldDescription: '-',
      },
    ],
    location: 'https://maps.app.goo.gl/BtArHZ9HWn5bFRxYA',
    imagePath: '/info/faculty/scii.webp',
    websiteUrl: 'https://csii.chula.ac.th/',
  },
  // คณะเกษตรศาสตร์บูรณาการ
  {
    id: 'cusar',
    name: 'คณะเกษตรศาสตร์บูรณาการ',
    majors: [
      {
        id: 'cusar1',
        name: 'การบริหารจัดการทรัพยากรการเกษตร',
        description:
          'หลักสูตรศิลปศาสตรและวิทยาศาสตรบัณฑิต (ศศ.วท.บ) สาขาวิชาการบริหารจัดการทรัพยากรการเกษตร มีแนวทางการผลิตบัณฑิตให้เป็น ""ผู้ประกอบการด้านธุรกิจการเกษตร ที่ถึงพร้อมด้วยจิตอาสา จิตสาธารณะในการพัฒนาชุมชนเกษตรกรรมในบ้านเกิด"" โดยมีแนวทางการให้ความรู้แบบองค์รวม ทั้งด้านการผลิตพืช ผลิตสัตว์ การแปรรูป การตลาด ตลอดห่วงโซ่คุณค่าของผลผลิตการเกษตรโดยเฉพาะอย่างยิ่งผลผลิตทางการเกษตรที่ใช้เป็นอาหาร รวมถึงการให้ความรู้ด้านกฎหมายที่เกี่ยวข้อง และสิ่งแวดล้อม',
        fieldDescription: '-',
      },
    ],
    location: 'https://maps.app.goo.gl/SNsRCSRWT2vdqGyW8',
    imagePath: '/info/faculty/cusar.webp',
    websiteUrl: 'https://www.cusar.chula.ac.th/',
  },
  // หอพักนิสิตจุฬาลงกรณ์มหาวิทยาลัย
  {
    id: 'dorm',
    name: 'หอพักนิสิตจุฬาลงกรณ์มหาวิทยาลัย',
    majors: [
      {
        id: 'dorm1',
        name: 'ตึกชวนชม',
        description: 'หอพักหญิง ประเภทรายเดือน',
        fieldDescription:
          'พักห้องละ 2 คน ค่าหอพัก 3,500 บาท/คน/เดือน (ไม่รวมค่าน้ำและค่าไฟ) มีเครื่องปรับอากาศ ห้องน้ำในตัว',
      },
      {
        id: 'dorm2',
        name: 'ตึกจำปี',
        description: 'หอพักชาย ประเภทรายเดือน',
        fieldDescription:
          'พักห้องละ 3-4 คน ค่าหอพัก 2,500 บาท/คน/เดือน (ไม่รวมค่าไฟ) มีเครื่องปรับอากาศ ห้องน้ำรวม',
      },
      {
        id: 'dorm3',
        name: 'ตึกพุดตาล',
        description: 'หอพักหญิง ประเภทรายเดือน',
        fieldDescription:
          'พักห้องละ 2-3 คน ค่าหอพัก 1,800 บาท/คน/เดือน (ไม่รวมค่าไฟ) ไม่มีเครื่องปรับอากาศ ห้องน้ำรวม',
      },
      {
        id: 'dorm4',
        name: 'ตึกพุดซ้อน',
        description: 'หอพักหญิง ประเภทรายเทอม',
        fieldDescription:
          'พักห้องละ 4 คน ค่าหอพัก 5,500 บาท/คน/เทอม (รวมค่าน้ำและค่าไฟ) ไม่มีเครื่องปรับอากาศ ห้องน้ำรวม',
      },
      {
        id: 'dorm5',
        name: 'ตึกจำปา',
        description: 'หอพักชาย ประเภทรายเทอม',
        fieldDescription:
          'พักห้องละ 4 คน ค่าหอพัก 4,500 บาท/คน/เทอม (รวมค่าน้ำและค่าไฟ) ไม่มีเครื่องปรับอากาศ ห้องน้ำรวม',
      },
    ],
    location: 'https://maps.app.goo.gl/j1DDqX6zEiLo2KXX6?g_st=ac',
    imagePath: '/info/faculty/dorm.webp',
    websiteUrl: 'https://www.rcu.sa.chula.ac.th/',
  },
]

export const FACULTY_KEYS: Array<keyof AchievementCollectedPieces> = [
  'edu',
  'psy',
  'pharm',
  'dent',
  'commarts',
  'ahs',
  'faa',
  'vet',
  'law',
  'arch',
  'eng',
  'arts',
  'md',
  'sci',
  'econ',
  'polsci',
  'cbs',
  'spsc',
  'scii',
  'cusar',
]
