export type FacultyType =
  | 'edu'
  | 'psy'
  | 'dent'
  | 'law'
  | 'commarts'
  | 'cbs'
  | 'md'
  | 'pharm'
  | 'polsci'
  | 'sci'
  | 'spsc'
  | 'eng'
  | 'faa'
  | 'econ'
  | 'arch'
  | 'ahs'
  | 'vet'
  | 'arts'
  | 'scii'
  | 'cusar'
  | 'dorm'

export interface FacultyOption {
  value: FacultyType
  variant: 1 | 2 | 3 | 4 | 5 | 6
  label: {
    th: string
    en: string
  }
}

export const FACULTIES: FacultyOption[] = [
  {
    value: 'edu',
    variant: 1,
    label: { th: 'คณะครุศาสตร์', en: 'Faculty of Education' },
  },
  {
    value: 'psy',
    variant: 2,
    label: { th: 'คณะจิตวิทยา', en: 'Faculty of Psychology' },
  },
  {
    value: 'dent',
    variant: 3,
    label: { th: 'คณะทันตแพทยศาสตร์', en: 'Faculty of Dentistry' },
  },
  {
    value: 'law',
    variant: 4,
    label: { th: 'คณะนิติศาสตร์', en: 'Faculty of Law' },
  },
  {
    value: 'commarts',
    variant: 5,
    label: { th: 'คณะนิเทศศาสตร์', en: 'Faculty of Communication Arts' },
  },
  {
    value: 'cbs',
    variant: 6,
    label: {
      th: 'คณะพาณิชยศาสตร์และการบัญชี',
      en: 'Faculty of Commerce and Accountancy',
    },
  },
  {
    value: 'md',
    variant: 1,
    label: { th: 'คณะแพทยศาสตร์', en: 'Faculty of Medicine' },
  },
  {
    value: 'pharm',
    variant: 2,
    label: { th: 'คณะเภสัชศาสตร์', en: 'Faculty of Pharmacy' },
  },
  {
    value: 'polsci',
    variant: 3,
    label: { th: 'คณะรัฐศาสตร์', en: 'Faculty of Political Science' },
  },
  {
    value: 'sci',
    variant: 4,
    label: { th: 'คณะวิทยาศาสตร์', en: 'Faculty of Science' },
  },
  {
    value: 'spsc',
    variant: 5,
    label: { th: 'คณะวิทยาศาสตร์การกีฬา', en: 'Faculty of Sports Science' },
  },
  {
    value: 'eng',
    variant: 6,
    label: { th: 'คณะวิศวกรรมศาสตร์', en: 'Faculty of Engineering' },
  },
  {
    value: 'faa',
    variant: 1,
    label: { th: 'คณะศิลปกรรมศาสตร์', en: 'Faculty of Fine and Applied Arts' },
  },
  {
    value: 'econ',
    variant: 2,
    label: { th: 'คณะเศรษฐศาสตร์', en: 'Faculty of Economics' },
  },
  {
    value: 'arch',
    variant: 3,
    label: { th: 'คณะสถาปัตยกรรมศาสตร์', en: 'Faculty of Architecture' },
  },
  {
    value: 'ahs',
    variant: 4,
    label: { th: 'คณะสหเวชศาสตร์', en: 'Faculty of Allied Health Sciences' },
  },
  {
    value: 'vet',
    variant: 5,
    label: { th: 'คณะสัตวแพทยศาสตร์', en: 'Faculty of Veterinary Medicine' },
  },
  {
    value: 'arts',
    variant: 6,
    label: { th: 'คณะอักษรศาสตร์', en: 'Faculty of Arts' },
  },
  {
    value: 'scii',
    variant: 1,
    label: {
      th: 'สถาบันนวัตกรรมบูรณาการแห่งจุฬาลงกรณ์มหาวิทยาลัย (BAScii)',
      en: 'School of Integrated Innovation (BAScii)',
    },
  },
  {
    value: 'cusar',
    variant: 2,
    label: {
      th: 'สำนักวิชาทรัพยากรการเกษตร',
      en: 'School of Agricultural Resources',
    },
  },
]

export interface Faculty {
  id: FacultyType
  name: string
  majors: Major[]
  imagePath: string
  location: string
}

export interface Major {
  id: string
  name: string
  description: string
  fieldDescription: string
}

export const FACULTY_DATA: Faculty[] = [
  // คณะครุศาสตร์
  {
    id: 'edu',
    name: 'คณะครุศาสตร์',
    majors: [
      {
        id: 'edu1',
        name: 'ภาควิชานโยบาย การจัดการและความเป็นผู้นำทางการศึกษา',
        description:
          'เรียนเกี่ยวกับศาสตร์การพัฒนศึกษา บริหารการศึกษา นิเทศการศึกษา อุดมศึกษา ธุรกิจและอาชีวศึกษา ผลิตผู้สอนที่เน้นความเรืองปัญญาและคุณธรรม สร้าง เข้าร่วม  ชี้นำการเปลี่ยนแปลงในเครือข่ายทางการศึกษาในระดับชาติและนานาชาติ',
        fieldDescription:
          'ภาควิชาประกอบไปด้วย 6 สาขาวิชา ดังนี้ \n1. สาขาวิชาธุรกิจและอาชีวศึกษา\n2. สาขาวิชาพัฒนศึกษา\n3. สาขาวิชาอุดมศึกษา\n4. สาขาวิชาบริหารการศึกษา\n5. สาขาวิชานิเทศการศึกษา\n6. สาขาวิชาภาวะผู้นำการบริหารระบบการศึกษา (หลักสูตรนานาชาติ)',
      },
      {
        id: 'edu2',
        name: 'ภาควิชาหลักสูตรและการสอน',
        description:
          'เรียนเกี่ยวกับองค์ความรู้ และการสร้างนวัตกรรมที่ส่งเสริมหลักสูตรและการสอน ทั้งส่งเสริมให้ชุมชนมีความสัมพันธ์กับผู้เรียน ครู หลักสูตร และพัฒนาการสอน และนวัตกรรมให้ก้าวทันโลก',
        fieldDescription:
          'ภาควิชาประกอบไปด้วย 9 สาขาวิชา ดังนี้ \n1. สาขาวิชาหลักสูตรและการสอน \n2. สาขาวิชาการศึกษาปฐมวัย\n3. สาขาวิชาประถมศึกษา\n4. สาขาวิชาการสอนภาษาไทย\n5. สาขาวิชาการศึกษาคณิตศาสตร์\n6. สาขาวิชาการศึกษาวิทยาศาสตร์\n7. สาขาวิชาการสอนสังคมศึกษา\n8. สาขาวิชาสุขศึกษาและพลศึกษา\n9. สาขาวิชาการสอนภาษาต่างประเทศ และ Teaching English as a Foreign Language (TEFL)',
      },
      {
        id: 'edu3',
        name: 'ภาควิชาเทคโนโลยีและสื่อสารการศึกษา',
        description:
          'เรียนเกี่ยวกับการสร้างสรรค์ความรู้ในศาสร์ด้านเทคโนโลยีและสื่อสารการศึกษา บุกเบิกองค์ความรู้ใหม่ และสร้างนวัตกรรมด้านเทคโนโลยีและสื่อสารการศึกษาเพื่อประโยชน์ของสังคมไทยและสังคมโลก',
        fieldDescription: '-',
      },
      {
        id: 'edu4',
        name: 'ภาควิชาศิลปะ ดนตรีและนาฏศิลป์ศึกษา',
        description:
          'เรียนเกี่ยวกับศิลปศึกษาหรือดนตรีศึกษา การสร้างสรรค์การเรียนรู้แนวใหม่ สามารถเชื่อมโยงความรู้เพื่อพัฒนานวัตกรรมทางศิลปศึกษา',
        fieldDescription:
          'ภาควิชาประกอบไปด้วย 2 สาขาวิชา ดังนี้ \n1. สาขาวิชาศิลปศึกษา\n2. สาขาวิชาดนตรีศึกษา',
      },
      {
        id: 'edu5',
        name: 'ภาควิชาวิจัยและจิตวิทยาการศึกษา',
        description:
          'เรียนเกี่ยวกับการวิจัย การวัดและประเมินผลการศึกษา สถิติการศึกษา และจิตวิทยาการศึกษา เพื่อตอบสนองต่อการพัฒนานที่ยั่งยืนของประเทศ',
        fieldDescription: '-',
      },
      {
        id: 'edu6',
        name: 'ภาควิชาการศึกษาตลอดชีวิต',
        description:
          'เรียนเกี่ยวกับการศึกษาตลอดชีวิต การศึกษานอกระบบ และการศึกษาตามอัธยาศัย เพื่อให้ก้าวทันความเปลี่ยนแปลงของสังคมไทยและสังคมโลก สร้าง เผยแพร่และประยุกต์องค์ความรู้และงานวิจัย ต่อยอดองค์ความรู้ในระดับคณะ ระดับมหาวิทยาลัย และองค์กรทั้งในประเทศและต่างประเทศ',
        fieldDescription: '-',
      },
    ],
    imagePath: '/info/faculty/edu.webp',
    location: 'https://maps.app.goo.gl/v38UG7L3eFqTKWfy8',
  },
  // คณะจิตวิทยา
  {
    id: 'psy',
    name: 'คณะจิตวิทยา',
    majors: [
      {
        id: 'psy1',
        name: 'หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาจิตวิทยา (B.Sc. in Psychology)',
        description:
          'เรียนจิตวิทยาในแขนงต่าง ๆ โดยกว้าง เน้นทักษะการคิดวิเคราะห์ แก้ไขปัญหา และค้นหาคำตอบอย่างเป็นวิทยศาสตร์ และการประยุกต์ความรู้จิตวิทยาเข้ากับความรู้อื่น ๆ และชีวิตประจำวัน',
        fieldDescription: '-',
      },
      {
        id: 'psy2',
        name: '*หลักสูตรนานาชาติ* JIPP (Joint International Psychology Program)',
        description:
          'หลักสูตรนานาชาติแบบ 2 ปริญญา หรือ Joint degree ร่วมมือกับ University of Queensland(UQ) ที่ประเทศออสเตรเลีย โดยจะได้รับปริญญาศิลปศาสตรบัณฑิต (สาขาจิตวิทยา) จาก UQ และปริญญาวิทยาศาสตรบัณฑิต (สาขาจิตวิทยา) จากจุฬาลงกรณ์มหาวิทยาลัย',
        fieldDescription: '-',
      },
    ],
    imagePath: '/info/faculty/psy.webp',
    location: 'https://maps.app.goo.gl/ULZ4goJU4S4iKGQ2A',
  },
  // คณะทันตแพทยศาสตร์
  {
    id: 'dent',
    name: 'คณะทันตแพทยศาสตร์',
    majors: [
      {
        id: 'dent1',
        name: 'หลักสูตรทันตแพทยศาสตรบัณฑิต (ท.บ.)',
        description:
          'หลักสูตร 6 ปีที่มุ่งเน้นให้นิสิตทันตแพทย์มีความรู้และทักษะในวิชาชีพทันตกรรม รวมทั้งศาสตร์ที่เกี่ยวข้องตามข้อกำหนดมาตรฐานวิชาชีพทันตกรรม ค้นคว้าติดตามความก้าวหน้าทางวิชาการและเทคโนโลยี มีคุณธรรม จริยธรรม เพื่อให้บริการการรักษาสุขภาพในช่องปากของประชาชนได้อย่างเหมาะสม',
        fieldDescription: '-',
      },
    ],
    imagePath: '/info/faculty/dent.webp',
    location: 'https://maps.app.goo.gl/dqZ8HhyHuQKy7ojU8',
  },
  // คณะนิติศาสตร์
  {
    id: 'law',
    name: 'คณะนิติศาสตร์',
    majors: [
      {
        id: 'law1',
        name: 'หลักสูตรนิติศาสตรบัณฑิต (น.บ.)',
        description:
          'เป็นหลักสูตรปริญญาตรีสำหรับผู้สำเร็จการศึกษามัธยมศึกษาปีที่ 6 หรือเทียบเท่า มีการแบ่งสาขาให้นิสิตเลือกเรียนตามความสนใจ 4 สาขา เพื่อให้เกิดความเชี่ยวชาญเฉพาะด้าน ได้แก่ สาขาวิชากฎหมายธุรกิจและภาษีอากร, กฎหมายแพ่งพาณิชย์และอาญา, กฎหมายมหาชน และกฎหมายระหว่างประเทศ',
        fieldDescription:
          '1. สาขาวิชากฎหมายธุรกิจและภาษีอากร\n2. สาขาวิชากฎหมายแพ่งพาณิชย์และอาญา\n3. สาขาวิชากฎหมายมหาชน\n4. สาขาวิชากฎหมายระหว่างประเทศ\n****ทั้งนี้ การเลือกสาขาวิชาดังกล่าวจะดำเนินการเมื่อนิสิตเรียนอยู่ในชั้นปีที่ 3 และลงทะเบียนเรียนในภาคการศึกษาปลาย อนึ่ง เมื่อสำเร็จการศึกษา นิสิตจะได้รับปริญญานิติศาสตรบัณฑิต โดยไม่มีการระบุสาขาไว้ในปริญญาบัตร',
      },
      {
        id: 'law2',
        name: 'Bachelor of Laws, experiential learning in Business and Tech Law (LLBel) (International Program)',
        description:
          'The LLBel Program at Chulalongkorn University equips students with legal, business, and technology expertise through experiential, cross-disciplinary learning. With global faculty, diverse peers, specialization tracks, and real-world practice, graduates are prepared for careers across law, business, and public service.',
        fieldDescription: '-',
      },
      {
        id: 'law3',
        name: 'หลักสูตรนิติศาสตรบัณฑิต ภาคบัณฑิต (น.บ.)',
        description:
          'ต่อยอดจากหลักสูตรนิติศาสตรบัณฑิต หลักสูตรเปิดรับนิสิตจบปริญญาตรี หรือเทียบเท่าในสาขาอื่นที่มิใช่นิติศาสตร์ โดยบัณฑิตที่จบจากหลักสูตรสามารถปฏิบัติงานได้หลากหลาย',
        fieldDescription:
          '1. สาขาวิชากฎหมายธุรกิจและภาษีอากร \n2. สาขาวิชากฎหมายแพ่งพาณิชย์และอาญา \n3. สาขาวิชากฎหมายมหาชน\n4. สาขาวิชากฎหมายระหว่างประเทศ\n****ทั้งนี้ การเลือกสาขาวิชาดังกล่าวจะดำเนินการเมื่อนิสิตเรียนอยู่ในชั้นปีที่ 3 และลงทะเบียนเรียนในภาคการศึกษาปลาย อนึ่ง เมื่อสำเร็จการศึกษา นิสิตจะได้รับปริญญานิติศาสตรบัณฑิต โดยไม่มีการระบุสาขาไว้ในปริญญาบัตร',
      },
    ],
    imagePath: '/info/faculty/law.webp',
    location:
      'https://www.google.com/maps/place/Faculty+of+Law,+Chulalongkorn+University/@13.7354035,100.5258816,17z/data=!3m1!4b1!4m6!3m5!1s0x30e29ed24512a467:0x99830f05cd376eab!8m2!3d13.7354035!4d100.5284565!16s%2Fg%2F122p31p6?entry=ttu&g_ep=EgoyMDI1MTIwOS4wIKXMDSoASAFQAw%3D%3D',
  },
  // คณะนิเทศศาสตร์
  {
    id: 'commarts',
    name: 'คณะนิเทศศาสตร์',
    majors: [
      {
        id: 'commarts1',
        name: 'ภาควิชาการประชาสัมพันธ์ (Public Relations)',
        description:
          'แบ่งออกเป็น 2 สาขาวิชา ได้แก่ การประชาสัมพันธ์ (Public Rlations) เเละการโฆษณาเเละการสื่อสารตราสินค้า (Advertising and Brand communications)',
        fieldDescription:
          '1. การประชาสัมพันธ์ (Public Relations) เรียนเกี่ยวกับทฤษฎี หลักการ และการปฏิบัติงานทางการประชาสัมพันธ์โดยทั่วไป และการประชาสัมพันธ์เพื่อส่งเสริมการตลาด แผนการประชาสัมพันธ์ การโน้มน้าวใจ การสร้างประชามติเพื่อประโยชน์ในงานสื่อสารสาธารณะ\n2. การโฆษณาและการสื่อสารตราสินค้า (Advertising and Brand Communications) เรียนเกี่ยวกับหลักการแนวคิดเกี่ยวกับการโฆษณา การสื่อสารการตลาดเชิงดิจิทัล พฤติกรรมผู้บริโภค การวางแผนสื่อ การรณรงค์ทางการโฆษณา การเขียนบทโฆษณา ภาพลักษณ์และชื่อเสียงองค์กรและตราสินค้า',
      },
      {
        id: 'commarts2',
        name: 'ภาควิชาการสื่อสารมวลชน (Mass Communication)',
        description:
          'เรียนภูมิทัศน์สื่อยุคปัจจุบัน แนวคิดทฤษฎีทางด้านสื่อสารมวลชน หลักการปฏิบัติด้านการออกแบบและผลิตสื่อ ความเข้าใจด้านสื่อมวลชนกับสังคมและวัฒนธรรม เน้นการเสริมสร้างการเรียนรู้ควบคู่ไปกับการปฏิบัติ บนพื้นฐานความรับผิดชอบต่อสังคม',
        fieldDescription:
          'การออกแบบและผลิตสื่อ (Media Design and Production) เรียนเกี่ยวกับแนวคิดสื่อสารศิลป์ กระบวนการออกแบบและผลิตสื่อบนจอ (On-screen Media) และสื่อเสียง (Audio Media)',
      },
      {
        id: 'commarts3',
        name: 'ภาควิชาวารสารสนเทศ (Journalism)',
        description:
          'มุ่งเน้นด้านวิทยาการข่าวสาร สื่อสิ่งพิมพ์ และสื่อสารสนเทศ ซึ่งครอบคลุมการแสวงหาข้อมูลข่าวสาร สืบค้นข้อเท็จจริง การเขียน การวิเคราะห์ และสื่อสาร ตลอดจนการจัดการและการผลิตสื่อสิ่งพิมพ์และการผลิตข้อมูลบนแพลตฟอร์มออนไลน์ทุกประเภท',
        fieldDescription:
          'วารสารสนเทศและสื่อใหม่ (Journalism, Information and New Media) เรียนเกี่ยวกับวิทยาการข้อมูลข่าวสาร การผลิตสื่อสารสนเทศบนแพลตฟอร์มต่าง ๆ การแสวงหาข้อมูลข่าวสาร สืบค้นข้อเท็จจริง การเขียน การวิเคราะห์ แนวคิดและหลักการกํากับดูแลสื่อ',
      },
      {
        id: 'commarts4',
        name: 'ภาควิชาวาทวิทยาและสื่อสารการแสดง (Speech Communication and Performing Arts)',
        description:
          'แบ่งออกเป็น 2 สาขาวิชา ได้แก่ วาทวิทยา (Speech) และ สื่อสารการแสดง (Performing Arts)',
        fieldDescription:
          '1. วาทวิทยา (Speech Communications) เรียนเกี่ยวกับองค์ประกอบและแนวคิดการสื่อสาร ทั้งภายในบุคคล ระหว่างบุคคล ภายในองค์กร กระบวนการและแนวทางการสร้างความสัมพันธ์ระหว่างบุคคล การโต้แย้ง การจัดการความขัดแย้ง วาทศาสตร์กับสังคม การเล่าเรื่อง การสัมภาษณ์ \n2. สื่อสารการแสดง (Performing Arts) เรียนเกี่ยวกับหลักการ แนวคิดด้านสุนทรียะ ปฏิบัติการด้านสื่อสารการแสดงที่ปรากฏบนเวที (Stage Production) และที่ปรากฏในสื่อ (Media Production) โดยเฉพาะอย่างยิ่งในสื่อโทรทัศน์ต่าง ๆ',
      },
      {
        id: 'commarts5',
        name: 'ภาควิชาการภาพยนตร์และภาพนิ่ง (Motion Pictures and Still Photography)',
        description:
          'มุ่งเน้นการให้ความรู้ที่เป็นศาสตร์ ไม่ว่าจะเป็นวิชาที่เกี่ยวกับทฤษฎี การวิจัย สุนทรียศาสตร์ การวางแผน การวิเคราะห์ และวิจารณ์ภาพยนตร์ ส่วนความรู้ด้านศิลปะ ได้แก่ การศึกษาในเชิงลึกของศิลปะการเขียนบทภาพยนตร์ การกำกับ การถ่ายทำภาพยนตร์ การตัดต่อ ตลอดจนศิลปะการถ่ายภาพนิ่ง',
        fieldDescription:
          'ศิลปะภาพยนตร์ (Cinematic Arts) เรียนเกี่ยวกับปฏิบัติการทางด้านสารและศิลปะภาพยนตร์และภาพนิ่ง ความเท่าทันความเปลี่ยนแปลงของบริบททางสังคมและวัฒนธรรม ทั้งในประเทศและระดับโลก และพัฒนาการที่ก้าวกระโดดของเทคโนโลยีการผลิตสื่อและการสื่อสาร',
      },
      {
        id: 'commarts6',
        name: 'หลักสูตรนานาชาติ สาขาการจัดการการสื่อสาร (BCM) B.A. (Communication Arts) in Communication Management',
        description:
          'The program focuses on marketing communications, content creation, and management skills. Students will learn about branding, advertising, public relations, digital content, and the creative aspects of both brands and businesses. The program emphasizes how to strategically manage and communicate a brand’s message across various platforms.',
        fieldDescription:
          '1. การจัดการการสื่อสาร (Communication Management): มุ้งเน้นการสื่อสารเชิงกลยุทธ์ การสื่อสารการตลาด การจัดการเเละการสร้างแบรนด์ เเละการสร้างสรรค์คอนเทนต์อย่างมีคุณภาพ The program provides a well-rounded education in communication management, with a particular emphasis on branding, marketing, and business across various contexts.',
      },
    ],
    imagePath: '/info/faculty/commarts.webp',
    location: 'https://maps.app.goo.gl/nENwDBqJisD5Ztnq6',
  },
  // คณะพาณิชยศาสตร์และการบัญชี
  {
    id: 'cbs',
    name: 'คณะพาณิชยศาสตร์และการบัญชี',
    majors: [
      {
        id: 'cbs1',
        name: 'หลักสูตรบัญชีบัณฑิต',
        description:
          'เรียนรู้ด้านการบัญชีและเทคโนโลยีสารสนเทศสำหรับงานบัญชีและการบริหารธุรกิจ มุ่งสร้างนิสิตที่มีความรู้ความสามารถด้านบัญชีและเทคโนโลยีสารสนเทศอย่างลึกซึ้ง',
        fieldDescription: '-',
      },
      {
        id: 'cbs2',
        name: 'หลักสูตรบริหารธุรกิจบัณฑิต',
        description:
          'มุ่งสร้างนิสิตให้มีทักษะและความรู้ในการบริหารธุรกิจควบคู่ไปกับจริยธรรมและคุณจรรยาบรรณทางธุรกิจ เพื่อผลักดันความก้าวหน้าของสังคมธุรกิจทั้งในระดับประเทศและระดับนานาชาติ',
        fieldDescription:
          '1 การจัดการเพื่อเป็นผู้ประกอบการธุรกิจ (Entrepreneurial Management) \n2 ระบบสารสนเทศทางการจัดการ (Management Information Systems) \n3 การธนาคารและการเงิน (Banking and Finance) \n4 การตลาด (Marketing) \n5 การจัดการโลจิสติกส์ระหว่างประเทศ (International Logistics Management) \nนิสิตในหลักสูตรจะได้บูรณาการความรู้ในด้านต่าง ๆ เหล่านี้ เพื่อการวิเคราะห์ วางแผน ตัดสินใจ ในการดำเนินธุรกิจได้อย่างมีประสิทธิภาพ อีกทั้งหลักสูตรยังช่วยให้นิสิตได้รับประสบการณ์ในการบริหารธุรกิจทั้งทางตรงและทางอ้อม ส่งผลให้นิสิตสามารถนำความรู้ไปใช้ในการทำงานในสภาพแวดล้อมทางธุรกิจที่มีพลวัตสูงในโลกปัจจุบัน',
      },
      {
        id: 'cbs3',
        name: 'หลักสูตรสถิติศาสตรบัณฑิต',
        description:
          'มุ่งเน้นให้นิสิตมีทักษะ ความรู้ และมีคุณธรรม สามารถประกอบอาชีพและเรียนรู้ตลอดชีวิตได้ด้วยตนเอง หลักสูตรเน้นการสร้างนิสิตที่มีความรู้เชิงลึกด้านสถิติ การประกันภัย และเทคโนโลยีสารสนเทศสำหรับธุรกิจ รวมถึงความรู้เกี่ยวกับโลกธุรกิจ',
        fieldDescription:
          '1 สถิติและวิทยาการข้อมูล (Statistics and Data Science)\n2 การประกันภัย (Insurance)\n3 เทคโนโลยีสารสนเทศเพื่อธุรกิจ (Information Technology for Business)',
      },
      {
        id: 'cbs4',
        name: 'หลักสูตรบริหารธุรกิจบัณฑิต (หลักสูตรนานาชาติ) Bachelor of Business Administration (BBA) International Program',
        description:
          'The curricula provide students with extensive knowledge of international accounting practices, understanding of trade development and the diversity of culture, financial analysis for modern and competitive business management, as well as brand and marketing management in the current face-paced business environment.',
        fieldDescription:
          '1 สาขาวิชาการจัดการธุรกิจระหว่างประเทศ (International Business Management) มุ่งเน้นไปที่การทำความเข้าใจการพัฒนาธุรกิจการค้าภายใต้ความหลากหลายของวัฒนธรรมโลก ซึ่งแบ่งออกเป็น 3 แขนงวิชา คือ แขนงวิชาการจัดการธุรกิจดิจิทัล แขนงวิชาการวิเคราะห์การเงินและการลงทุน และ แขนงวิชาการจัดการแบรนด์และการตลาด หลักสูตรนี้ยังเน้นถึงวิธีการจัดการธุรกิจอย่างมีประสิทธิภาพ และสามารถแข่งขันได้ในโลกธุรกิจที่มีการเปลี่ยนแปลงตลอดเวลา \n2 สาขาวิชาการบัญชี (Accounting)  ให้ความรู้อย่างครอบคลุมเกี่ยวกับแนวทางปฏิบัติทางการบัญชีระหว่างประเทศสำหรับการจัดการธุรกิจสมัยใหม่',
      },
    ],
    imagePath: '/info/faculty/cbs.webp',
    location: 'https://maps.app.goo.gl/r8MfrgePqCJQKFSL8',
  },
  // คณะแพทยศาสตร์
  {
    id: 'md',
    name: 'คณะแพทยศาสตร์',
    majors: [
      {
        id: 'md1',
        name: 'หลักสูตรแพทยศาสตรบัณฑิต',
        description:
          'หลักสูตรปริญญาตรีวิชาชีพด้านการแพทย์ที่มุ่งผลิตบัณฑิตให้มีคุณธรรม จริยธรรม ความรู้ความสามารถในการประกอบวิชาชีพเวชกรรม ดูแลรักษาผู้ป่วยแบบองค์รวม และมีความเป็นผู้นำ เพื่อเป็นที่พึ่งของสังคม มีเนื้อหาครอบคลุมวิทยาศาสตร์การแพทย์ขั้นพื้นฐานและคลินิก พร้อมการฝึกปฏิบัติจริง เน้นทักษะการคิดวิเคราะห์และวิจัย โดยมีระยะเวลาเรียน 6 ปี',
        fieldDescription: '-',
      },
    ],
    imagePath: '/info/faculty/md.webp',
    location: 'https://maps.app.goo.gl/5qe8o1XU2Jxj7rPK8?g_st=ic',
  },
  // คณะเภสัชศาสตร์
  {
    id: 'pharm',
    name: 'คณะเภสัชศาสตร์',
    majors: [
      {
        id: 'pharm1',
        name: 'หลักสูตรเภสัชศาสตรบัณฑิต',
        description:
          'หลักสูตรเภสัชศาสตร์บัณฑิต เป็นหลักสูตร 6 ปี เมื่อจบหลักสูตรแล้วจะได้รับปริญญาเภสัชศาสตร์บัณฑิต (ภบ.) หลักสูตรมีความมุ่งหมายที่จะเป็นหลักสูตรชั้นนำของประเทศและมีมาตรฐานระดับสากลในการผลิตบัณฑิตเภสัชศาสตร์ บัณฑิตจะได้รับความรู้ในด้านงานเภสัชกรรม แนวทางเภสัชกรรมที่ใช้ทำงาน และความเป็นวิชาชีพเภสัชกรรมและการเรียนรู้ตลอดชีวิต',
        fieldDescription:
          '1. สาขาวิชาการบริบาลทางเภสัชกรรม ทั้งสองสาขาวิชามีการจัดการเรียนการสอนในวิชาพื้นฐาน, วิชาเฉพาะกลุ่มวิชาชีพ และการฝึกปฏิบัติวิชาชีพ ตามประกาศกำหนดของสภาเภสัชกรรม โดยในสาขาวิชาการบริบาลทางเภสัชกรรมจะมีการเน้นในรายวิชาที่เกี่ยวข้องกับการปฏิบัติงานการบริบาลทางเภสัชกรรมเพื่อดูแลผู้ป่วย ครอบครัว ชุมชน และสังคม \n2. สาขาวิชาเภสัชกรรมอุตสาหการ ทั้งสองสาขาวิชามีการจัดการเรียนการสอนในวิชาพื้นฐาน, วิชาเฉพาะกลุ่มวิชาชีพ และการฝึกปฏิบัติวิชาชีพ ตามประกาศกำหนดของสภาเภสัชกรรม โดยในสาขาวิชาเภสัชกรรมอุตสาหการจะมีการเน้นในรายวิชาที่เกี่ยวข้องกับการผลิต การควบคุมและประกันคุณภาพเภสัชภัณฑ์ การวิจัยและพัฒนายาการคุ้มครองผู้บริโภคด้านยาและผลิตภัณฑ์สุขภาพ',
      },
    ],
    imagePath: '/info/faculty/pharm.webp',
    location: 'https://maps.app.goo.gl/tN1YCBJ75JMeaT6a7',
  },
  // คณะรัฐศาสตร์
  {
    id: 'polsci',
    name: 'คณะรัฐศาสตร์',
    majors: [
      {
        id: 'polsci1',
        name: 'ภาควิชาการปกครอง (Government)',
        description:
          'คณะรัฐศาสตร์ไม่ได้มุ่งสอนศาสตร์สู่วิชาชีพโดยตรง แต่เน้นการหล่อหลอมให้นิสิตมีกระบวนการคิด การวิเคราะห์อย่างเป็นระบบ และการคำนึงถึงประโยชน์ส่วนรวมของสังคม ซึ่งล้วนเป็นรากฐานสำคัญที่สามารถต่อยอดสู่หลากหลายสายอาชีพได้',
        fieldDescription:
          'ศึกษาเกี่ยวกับการเมืองและการปกครองของรัฐและสังคมตั้งแต่อดีตจนถึงปัจจุบัน โดยวิเคราะห์ในหลากหลายมิติของการเมือง อาทิ โครงสร้างและสถาบันทางการเมือง ปรากฏการณ์และกระบวนการทางการเมือง รวมถึงแนวคิดและทฤษฎีทางการเมือง เพื่อทำความเข้าใจพลวัตของอำนาจ การตัดสินใจ และการจัดระเบียบทางสังคม-',
      },
      {
        id: 'polsci2',
        name: 'ภาควิชาความสัมพันธ์ระหว่างประเทศ (International Relations)',
        description:
          'คณะรัฐศาสตร์ไม่ได้มุ่งสอนศาสตร์สู่วิชาชีพโดยตรง แต่เน้นการหล่อหลอมให้นิสิตมีกระบวนการคิด การวิเคราะห์อย่างเป็นระบบ และการคำนึงถึงประโยชน์ส่วนรวมของสังคม ซึ่งล้วนเป็นรากฐานสำคัญที่สามารถต่อยอดสู่หลากหลายสายอาชีพได้',
        fieldDescription:
          'ศึกษาเกี่ยวกับการเมืองระหว่างประเทศ นโยบายต่างประเทศ ความสัมพันธ์ระหว่างรัฐ องค์กรระหว่างประเทศ และประวัติศาสตร์การทูต ควบคู่กับการเรียนรู้ทฤษฎีความสัมพันธ์ระหว่างประเทศ กฎหมายระหว่างประเทศ และเศรษฐกิจการเมืองโลก เพื่อทำความเข้าใจระบบโลกและบทบาทของรัฐและผู้แสดงอื่น ๆ ในเวทีระหว่างประเทศ',
      },
      {
        id: 'polsci3',
        name: 'ภาควิชาสังคมวิทยาและมานุษยวิทยา (Sociology and Anthropology)',
        description:
          'คณะรัฐศาสตร์ไม่ได้มุ่งสอนศาสตร์สู่วิชาชีพโดยตรง แต่เน้นการหล่อหลอมให้นิสิตมีกระบวนการคิด การวิเคราะห์อย่างเป็นระบบ และการคำนึงถึงประโยชน์ส่วนรวมของสังคม ซึ่งล้วนเป็นรากฐานสำคัญที่สามารถต่อยอดสู่หลากหลายสายอาชีพได้',
        fieldDescription:
          'ศึกษาโครงสร้างทางสังคมและวัฒนธรรม วิถีชีวิตและพฤติกรรมของมนุษย์ รวมถึงการเปลี่ยนแปลงและปัญหาทางสังคม เพื่อทำความเข้าใจความหลากหลายของสังคมและความสัมพันธ์ระหว่างมนุษย์ในบริบทต่าง ๆ',
      },
      {
        id: 'polsci4',
        name: 'ภาควิชารัฐประศาสนศาสตร์ (Public Administration)',
        description:
          'คณะรัฐศาสตร์ไม่ได้มุ่งสอนศาสตร์สู่วิชาชีพโดยตรง แต่เน้นการหล่อหลอมให้นิสิตมีกระบวนการคิด การวิเคราะห์อย่างเป็นระบบ และการคำนึงถึงประโยชน์ส่วนรวมของสังคม ซึ่งล้วนเป็นรากฐานสำคัญที่สามารถต่อยอดสู่หลากหลายสายอาชีพได้',
        fieldDescription:
          'ศึกษาเกี่ยวกับการบริหารจัดการภาครัฐ ครอบคลุมการบริหารทรัพยากรบุคคล การกำหนดนโยบาย การวางแผน และการบริหารการคลังของหน่วยงานและองค์กรต่าง ๆ เพื่อเสริมสร้างความรู้และทักษะในการบริหารงานภาครัฐอย่างมีประสิทธิภาพ โปร่งใส และตอบสนองต่อสังคม',
      },
      {
        id: 'polsci5',
        name: 'หลักสูตรการเมืองและโลกสัมพันธ์ศึกษา (Politics and Global Studies - PGS)',
        description:
          'คณะรัฐศาสตร์ไม่ได้มุ่งสอนศาสตร์สู่วิชาชีพโดยตรง แต่เน้นการหล่อหลอมให้นิสิตมีกระบวนการคิด การวิเคราะห์อย่างเป็นระบบ และการคำนึงถึงประโยชน์ส่วนรวมของสังคม ซึ่งล้วนเป็นรากฐานสำคัญที่สามารถต่อยอดสู่หลากหลายสายอาชีพได้',
        fieldDescription:
          'ศึกษาเกี่ยวกับการเมืองและประเด็นร่วมสมัยในระดับโลก ผ่านการบูรณาการองค์ความรู้จาก 4 ศาสตร์ ได้แก่ การปกครอง ความสัมพันธ์ระหว่างประเทศ รัฐประศาสนศาสตร์ และสังคมวิทยาและมานุษยวิทยา ในรูปแบบหลักสูตรนานาชาติของคณะรัฐศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ร่วมกับมหาวิทยาลัยในสหราชอาณาจักร 2 แห่ง ได้แก่ University of Essex และ University of Leeds รวมถึง University of Queensland (ออสเตรเลีย) และ Korea University (เกาหลีใต้) เพื่อพัฒนากระบวนการคิดเชิงวิเคราะห์ ความเข้าใจความซับซ้อนของสังคมโลก และเตรียมความพร้อมสู่การเป็นผู้นำและผู้สร้างการเปลี่ยนแปลงในระดับนานาชาติ โดยนิสิตจะได้รับปริญญาคู่ (Double Degree) จากมหาวิทยาลัยต่างประเทศที่นิสิตเข้าศึกษา',
      },
    ],
    imagePath: '/info/faculty/polsci.webp',
    location: 'https://maps.app.goo.gl/vEXK7KRokbV4fJri6',
  },
  // คณะวิทยาศาสตร์
  {
    id: 'sci',
    name: 'คณะวิทยาศาสตร์',
    majors: [
      {
        id: 'sci1',
        name: 'คณิตศาสตร์และวิทยาการคอมพิวเตอร์',
        description:
          'ภาควิชาคณิตศาสตร์และวิทยาการคอมพิวเตอร์ เป็น “แรก” ของประเทศไทย ในหลาย ๆ ด้าน เช่นเป็นแห่งแรกที่สอนในระดับปริญญาตรี โท และเอก เป็นแห่งแรกที่จัดสัมมนา และประชุมทางวิชาการทั้งในระดับประเทศและภาคพื้นเอเชียอาคเนย์ และเป็นแห่งแรกที่จัดตั้งสมาคมคณิตศาสตร์แห่งประเทศไทย',
        fieldDescription:
          'ภาควิชาคณิตศาสตร์และวิทยาการคอมพิวเตอร์ แบ่งเป็น 2 สาขาได้แก่ \n1. สาขาวิชาคณิตศาสตร์ - เรียนคณิตศาสตร์บริสุทธิ์และประยุกต์ อาทิเช่นการพิสูจน์, Algebra, Analysis, Financial Math, Stochastic และอื่น ๆ \n2. สาขาวิชาวิทยาการคอมพิวเตอร์ - มุ่งเน้นให้มีความรู้ทั้งเชิงกว้างและเชิงลึกในศาสตร์ของวิทยาการคอมพิวเตอร์ที่สามารถนำองค์ความรู้ไปประยุกต์ใช้ได้หลากหลาย ตามความนิยมในปัจจุบัน',
      },
      {
        id: 'sci2',
        name: 'เคมี',
        description:
          'ภาควิชาเคมี ครอบคลุมในหลายด้านทั้งเคมีอินทรีย์, เคมีอนินทรีย์, เคมีฟิสิกัล, เคมีวิเคราะห์, เคมีสีเขียวและความยั่งยืน เรามีห้องปฏิบัติการและเครื่องมือที่ทันสมัย และมีการร่วมมือกับทั้งภาควิชา สถาบัน และอุตสาหกรรมอื่น ๆ',
        fieldDescription: '-',
      },
      {
        id: 'sci3',
        name: 'ชีววิทยา',
        description:
          'ภาควิชาชีววิทยา คณะวิทยาศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย มุ่งเน้นการศึกษาสิ่งมีชีวิตในทุกระดับ ตั้งแต่โมเลกุล เซลล์ เนื้อเยื่อ อวัยวะ ระบบร่างกาย ไปจนถึงระบบนิเวศ พร้อมทั้งมีกิจกรรมเพื่อฝึกทักษะภาคสนามและเสริมสร้างประสบการณ์การทำงานร่วมกับผู้อื่น',
        fieldDescription:
          'ภาควิชาชีววิทยาแบ่งเป็น 2 สาขา ได้แก่ สาขาชีววิทยาและสาขาสัตววิทยา โดยมุ่งเน้นสายงานวิชาการ 5 ด้าน ได้แก่ Biomedical, Biodiversity, Biodiversity DNA, Bioecosystem และ Bioeconomy',
      },
      {
        id: 'sci4',
        name: 'ฟิสิกส์',
        description:
          'ฟิสิกส์คือพื้นฐานของวิทยาศาสตร์ทุกแขนง เราจึงจะศึกษาเกี่ยวกับธรรมชาติและปรากฏการณ์ต่าง ๆ ในจักรวาล ซึ่งมีหลากหลายแขนง ตั้งแต่กลศาสตร์ทั่วไป กลศาสตร์ควอนตัม สสารและพลังงาน ไฟฟ้าแม่เหล็ก สัมพันธภาพ ไปจนถึงนอกโลกอย่าง คอสมิก ดาราศาสตร์และจักรวาลวิทยา',
        fieldDescription: '-',
      },
      {
        id: 'sci5',
        name: 'พฤกษศาสตร์',
        description:
          'ภาควิชาพฤกษศาสตร์เป็นแหล่งความรู้ทางทั้งทางด้านพฤกษศาสตร์และพันธุศาสตร์ที่มุ่งเน้นให้ผู้เรียนได้เข้าใจถึงรากฐานของสิ่งมีชีวิต ภายในภาควิชามีการจัดตั้งพิพิธภัณฑ์พืช ศาสตราจารย์ กสิน สุวตะพันธุ์ และมีพิพิธภัณฑ์มีชีวิต ที่เป็นแหล่งรวบรวมพืชนานาชนิดเพื่อเผยแพร่ความรู้แก่ทุกคน',
        fieldDescription:
          'ภาควิชาพฤกษศาสตร์ ประกอบด้วย 2 สาขาวิชา ได้แก่ พฤกษศาสตร์ และ พันธุศาสตร์ โดยสาขาวิชาพฤกษศาสตร์ มีการเรียนการสอนและงานวิจัยที่เกี่ยวข้องกับพืช ในแง่ของความหลากหลาย การเปลี่ยนแปลงทางสรีรวิทยาในสภาพแวดล้อมที่เปลี่ยนแปลงไป ความสัมพันธ์ของพืชในระบบนิเวศ รวมทั้งการใช้ประโยชน์จากพืชและจุลินทรีย์ที่เกี่ยวข้องกับพืช เพื่อผลิตผลิตภัณฑ์ที่มีมูลค่าเพิ่มในเชิงพาณิชย์และการอนุรักษ์พื้นที่ป่า สำหรับสาขาวิชาพันธุศาสตร์ ได้มีการเรียนการสอนและงานวิจัยเกี่ยวกับพันธุกรรมในสิ่งมีชีวิตชนิดต่าง ๆ ทั้งมนุษย์ พืช สัตว์ จนถึงจุลินทรีย์ มีการนำองค์ความรู้มาวิเคราะห์ความสัมพันธ์ทางพันธุกรรมและวิวัฒนาการของสิ่งมีชีวิต และประยุกต์ใช้ในด้าน การแพทย์และนิติวิทยาศาสตร์ การปรับปรุงพันธุ์พืชและสัตว์ ตลอดจนการดัดแปลงพันธุกรรมของจุลินทรีย์เพื่อประโยชน์ในเชิงอุตสาหกรรม',
      },
      {
        id: 'sci6',
        name: 'เคมีเทคนิค',
        description:
          'ภาควิชาเคมีเทคนิคเป็นภาควิชาแรกทางสาขาวิศวกรรมเคมีของประเทศไทย และได้รับการรับรองมาตรฐานคุณภาพการศึกษาจากสภาวิศวกร (ใบประกอบวิชาชีพ กว.) เพื่อสร้างวิศวกรเคมีหรือวิศวกรกระบวนการให้กับภาคอุตสาหกรรม มุ่งเน้นงานวิจัยด้านพลังงานเชื้อเพลิง พลังงานทดแทน ที่เป็นมิตรกับสิ่งแวดล้อม',
        fieldDescription:
          'ภาควิชาเคมีเทคนิค ประกอบด้วย 1 สาขาวิชา คือ สาขาวิชาเคมีวิศวกรรม ซึ่งศึกษาเกี่ยวกับ \n1. การถ่ายโอนโมเมนตัม มวลสาร (Momentum Transfer) \n2. พลังงานจากปิโตรเลียม ปิโตรเคมี และพลังงานทดแทนรูปแบบต่างๆ \n3. พื้นฐานวิศวกรรมเคมี เช่น Unit Operation , Material Energy  Balance, Thermodynamics\n4. ความปลอดภัยในการทำงานในโรงงานอุตสาหกรรม (Safety)\n5. พัฒนาทักษะเฉพาะด้านวิศวกรรมเคมี ให้สอดคล้องกับเกณฑ์มาตรฐานคุณภาพการศึกษาวิศวกรรมศาสตร์ที่ได้รับรองจากสภาวิศวกร\n',
      },
      {
        id: 'sci7',
        name: 'ธรณีวิทยา',
        description:
          'ธรณีวิทยาที่ไม่ได้มีแค่หิน แต่เป็นการไขคำตอบเกี่ยวกับองค์ประกอบ โครงสร้าง เเละกระบวนการตามธรรมชาติของโลกด้วยหลักการทางวิทยาศาสตร์ ศึกษาผ่านหลักฐานทั้ง ซากดึกดำบรรพ์ อัญมณี แร่ หิน ปิโตรเลียม บูรณาการกับเทคโนโลยีและการสำรวจภาคสนาม มุ่งสู่การปรับตัวและพัฒนาอย่างยั่งยืน',
        fieldDescription: '-',
      },
      {
        id: 'sci8',
        name: 'วิทยาศาสตร์สิ่งแวดล้อม',
        description:
          'ภาควิชาวิทยาศาสตร์สิ่งแวดล้อม คณะวิทยาศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย คือพื้นที่ของคนที่ใช้วิทยาศาสตร์ ลงมือแก้ปัญหาสิ่งแวดล้อมจริง ตั้งแต่ดิน น้ำ อากาศ ป่า เมือง ไปจนถึงมลพิษและโลกร้อน เรียนทั้งในแล็บและภาคสนาม เพื่อคิด วิเคราะห์ ออกแบบวิธีจัดการ และ เพิ่มความยั่งยืนให้ธรรมชาติและสังคม อย่างเป็นรูปธรรม ไม่ใช่แค่เข้าใจโลก แต่ช่วยทำให้โลกดีขึ้น',
        fieldDescription:
          'แบ่งเป็น 2 สายหลัก คือ สายการจัดการทรัพยากรและสิ่งแวดล้อม ที่เน้นดิน น้ำ ป่า เมือง ระบบนิเวศ และการจัดทำรายงานความยั่งยืน และ สายเทคโนโลยีสิ่งแวดล้อม ที่เน้นระบบบำบัดน้ำเสีย การจัดการของเสีย เสียงและการสั่นสะเทือน และมลภาวะอากาศ รวมทั้งการประเมินผลกระทบสิ่งแวดล้อม (EIA) เป็นทักษะสำคัญที่เรียนร่วมกันทั้งสองสาย เพื่อสร้างนักพัฒนาสิ่งแวดล้อมที่คิดเป็น ทำเป็น และเปลี่ยนความรู้ให้เกิดผลลัพธ์ที่ยั่งยืนได้จริง',
      },
      {
        id: 'sci9',
        name: 'วิทยาศาสตร์ทางทะเล',
        description:
          'ภาควิชาวิทยาศาสตร์ทางทะเล เน้นสอนเกี่ยวกับทะเลทั้งด้านชีวภาพ เคมี ฟิสิกส์ และธรณีวิทยา ผ่านวิทยาศาตร์พื้นฐานควบคู่การลงพื้นที่จริงและสำรวจทางเรือเพื่อวิจัยด้านนิเวศวิทยา มลพิษ และการเปลี่ยนแปลงสภาพภูมิอากาศ มุ่งผลิตผู้เชี่ยวชาญเพื่ออนุรักษ์และใช้ทรัพยากรทะเลอย่างยั่งยืน',
        fieldDescription:
          '1) แขนงวิชาชีววิทยาทางทะเลและการประมง เน้นการศึกษาด้านอนุกรมวิธานและนิเวศวิทยาของสิ่งมีชีวิตในทะเล และการจัดการทรัพยากรทางทะเล \n2) แขนงวิชาสมุทรศาสตร์ฟิสิกส์ เน้นเรื่องการเคลื่อนที่ของมวลน้ำ คลื่น กระแสน้ำ และการสร้างแบบจำลองทางคณิตศาสตร์ \n3) แขนงวิชาสมุทรศาสตร์เคมี เน้นการวิเคราะห์สารประกอบในน้ำทะเล มลพิษทางทะเล และวัฏจักรของธาตุต่าง ๆ',
      },
      {
        id: 'sci10',
        name: 'ชีวเคมี',
        description:
          'ภาควิชาชีวเคมี เป็นภาควิชาที่ศึกษาเกี่ยวกับปฏิกิริยาเคมีในสิ่งมีชีวิต โดยจะศึกษาทั้งโครงสร้างและหน้าที่ของสารชีวโมเลกุล ได้แก่ โปรตีน คาร์โบไฮเดรต ไขมัน และกรดนิวคลีอิก ซึ่งเป็นการประยุกต์ใช้ความรู้ในด้านต่าง ๆ เพื่อทำความเข้าใจกระบวนการทางชีวภาพในระดับโมเลกุล',
        fieldDescription: '-',
      },
      {
        id: 'sci11',
        name: 'วัสดุศาสตร์',
        description:
          'ภาควิชาวัสดุศาสตร์มีการเรียนการสอนและวิจัยด้านเซรามิก แก้ว กระจก พอลิเมอร์ และสิ่งทอ โดยพัฒนาเนื้อหาตามเทคโนโลยีวัสดุสมัยใหม่อย่างต่อเนื่อง เพื่อผลิตบัณฑิตที่มีความรู้และความสามารถด้านวัสดุศาสตร์',
        fieldDescription:
          '1. แขนงวิชาเซรามิกและวัสดุศาสตร์ เน้นการเรียนการสอนด้านวัสดุศาสตร์และเชรามิกที่ใช้งานทางวิศวกรรม ศึกษาโครงสร้างและสมบัติเฉพาะของเซรามิก วัตถุดิบที่ใช้ในการผลิต ขั้นตอนการผลิตและ การใช้งานของทั้งวัสดุเซรามิกแบบดั้งเดิมและเซรามิกขั้นสูง \n2. แขนงวิชาพอลิเมอร์และสิ่งทอ เน้นการเรียนการสอนด้านวัสดุพอลิเมอร์ ได้แก่ พลาสติก สิ่งทอ ยาง วัสดุเชิงประกอบ และสารเคลือบผิว โดยศึกษา ครอบคลุมตั้งแต่โครงสร้างทางเคมีและสมบัติของวัสดุในด้านต่าง ๆ การสังเคราะห์ กระบวนการผลิต การตรวจสอบ สมบัติและการประยุกต์เพื่อใช้เป็นผลิตภัณฑ์ที่เชื่อมโยงกับ อุตสาหกรรมหลักของประเทศ อีกทั้งยังมีความสําคัญต่อ การขับเคลื่อนโมเดลเศรษฐกิจชีวภาพ เศรษฐกิจหมุนเวียน เศรษฐกิจสีเขียว (BCG Economy Model)',
      },
      {
        id: 'sci12',
        name: 'จุลชีววิทยา',
        description:
          'ภาคจุลชีววิทยา ศึกษาเกี่ยวกับโลกของจุลินทรีย์ ตลอดจนการศึกษาเชิงลึกเกี่ยวกับพันธุศาสตร์ สรีรวิทยา โรคติดเชื้อ ภูมิคุ้มกันวิทยา ความหลากหลาย และการประยุกต์ใช้งานในด้านการแพทย์ สิ่งแวดล้อม เกษตรกรรม อาหาร อุตสาหกรรม และเทคโนโลยีทางชีวภาพอื่น ๆ',
        fieldDescription: '-',
      },
      {
        id: 'sci13',
        name: 'เทคโนโลยีทางภาพและการพิมพ์',
        description:
          'ภาควิชาเทคโนโลยีทางภาพและการพิมพ์มุ่งเน้นการศึกษาและวิจัยด้านการสร้างภาพ การพิมพ์ และเทคโนโลยีสื่อดิจิทัล ครอบคลุมกระบวนการถ่ายภาพ ระบบการพิมพ์ เทคโนโลยีสี และการประมวลผลภาพ เพื่อตอบโจทย์อุตสาหกรรมสื่อและการสื่อสารยุคใหม่',
        fieldDescription: '-',
      },
      {
        id: 'sci14',
        name: 'เทคโนโลยีทางอาหาร',
        description:
          'ศึกษาเกี่ยวกับอุตสาหกรรมอาหาร โดยครอบคลุมถึงการเปลี่ยนแปลงทางเคมีของอาหาร จุลินทรีย์ในอาหาร หลักการกระบวนการแปรรูปอาหาร วิศวกรรมอาหาร รวมถึงบรรจุภัณฑ์อาหาร และระบบการประกันคุณภาพอาหาร และยังมีแขนงวิชาเทคโนโลยีชีวภาพที่ศึกษาการผลิตผลิตภัณฑ์จากกระบวนการชีวภาพต่างๆ',
        fieldDescription:
          'ภาควิชาฯ มี 2 แขนงวิชา คือ \n1) เทคโนโลยีทางอาหาร เป็นการศึกษาเกี่ยวกับการผลิตอาหารในระดับอุตสาหกรรม \n2) แขนงเทคโนโลยีชีวภาพ เป็นการศึกษาการใช้จุลินทรีย์ เอนไซม์ในการผลิตผลิตภัณฑ์อาหารต่างๆ รวมถึงผลิตภัณฑ์อื่นๆ ที่เกี่ยวข้อง',
      },
      {
        id: 'sci15',
        name: 'เคมีประยุกต์ (นานาชาติ)',
        description:
          'The BSAC program puts emphasis on applying theoretical chemistry concepts to practical applications and challenges posed by the needs of local and international businesses, with areas encompassing industrial, material, environmental, cosmetic, and entrepreneurial chemistry. ',
        fieldDescription:
          '1. Industrial Chemistry and Management Designed for future technical managers of chemical-related industries and businesses. The program balances scientific knowledge with practical aspects of finance, management, and accounting under the perspectives of international quality systems. \n2. Materials Chemistry Designed for undergraduates who want to obtain a deep knowledge in materials science which is a key to the advancement of the economy and current social issues. \n3. Environmental Chemistry Created for students with an aim for a career in the field of environmental evaluation and risk assessment.  The curriculum focuses on a basis of analytical chemistry with special emphasis on environmental chemistry courses and research projects. \n4. Cosmetic Chemistry and Entrepreneurship Designed for students who want to immerse themselves in the world of cosmetics with an aim for a career as an entrepreneur. The program balances chemistry concepts and strategies to create finished products to conform to customers needs with classes of business and marketing.',
      },
      {
        id: 'sci16',
        name: 'SIS (BBTech)',
        description:
          'BBTech explores diverse realms of biotechnology, encompassing different fields such as animal, plant, microbial, environmental, food, marine, bioinformatics, and biotechnology management by diving deep into cutting-edge technologies like recombinant DNA technology, applied immunology, and genomics.',
        fieldDescription:
          '-Animal Biotechnology \n-Plant Biotechnology \n-Microbial Biotechnology \n-Food Biotechnology \n-Environmental Biotechnology \n-Marine Biotechnology \n-Bioinformatics \n-Biotechnology Management',
      },
      {
        id: 'sci17',
        name: 'SIS (BISTech)',
        description:
          'BISTech integrates expertise in materials science, food technology, chemical technology, and imaging and printing technology with comprehensive management knowledge to equip future industry leaders with an in-depth understanding of manufacturing technologies and essential communication skills. ',
        fieldDescription:
          '-Chemical technology \n-Food Technology \n-Material Science \n-Imaging and Printing Technology',
      },
    ],
    location: 'https://maps.app.goo.gl/6Hm29bEcGzWCBEtz5',
    imagePath: '/info/faculty/sci.webp',
  },
  // คณะวิทยาศาสตร์การกีฬา
  {
    id: 'spsc',
    name: 'คณะวิทยาศาสตร์การกีฬา',
    majors: [
      {
        id: 'spsc1',
        name: 'วิทยาศาสตรบัณฑิต สาขาวิชาวิทยาศาสตร์การกีฬาและการออกกำลังกาย (Sports and Exercise Science)',
        description:
          'เป็นหลักสูตรปริญญาตรีสำหรับผู้สำเร็จการศึกษาระดับชั้นมัธยมศึกษาตอนปลาย โดยมุ่งศึกษาและประยุกต์ใช้หลักวิทยาศาสตร์กับการเคลื่อนไหว การออกกำลังกาย และการเล่นกีฬา เพื่อพัฒนาสมรรถภาพทางกาย สุขภาพ การฝึกซ้อมกีฬา และการฟื้นฟูร่างกายอย่างมีประสิทธิภาพและปลอดภัย โดยบูรณาการความรู้จากหลายศาสตร์ เช่น กายวิภาคศาสตร์ สรีรวิทยาการออกกำลังกาย ชีวกลศาสตร์ จิตวิทยาการกีฬา โภชนาการกีฬา และการทดสอบสมรรถภาพทางกาย',
        fieldDescription:
          'ทางคณะวิทยาศาสตร์การกีฬามิได้มีการแบ่งสาขา แต่จะแบ่งเป็นความถนัด 2 ด้าน ได้แก่ \n1.ด้านกีฬา (The aspect of Sports)  คือด้านที่มุ่งเน้นการศึกษาเกี่ยวกับการพัฒนาสมรรถภาพทางกายของบุคคลที่ต้องการความเป็นเลิศทางด้านกีฬา โดยจะเรียนเกี่ยวกับการเสริมสร้างสมรรถภาพทางกายของกีฬา การวางแผนช่วงการฝึกฝน เทคนิคโปรแกรมการฝึกกล้ามเนื้อ การบาเจ็บทางการกีฬา การฟื้นสภาพร่างกายหลังการบาดเจ็บกีฬา การจัดการกิจกรรมกีฬา รวมไปถึงในขณะที่เรียนผู้เรียนจะได้นำความรู้ไปปฏิบัติจริงในสถานการณ์จริงอีกด้วย ซึ่งถือว่าเป็นรายวิชาที่สำคัญและครบถ้วนต่อการนำความรู้ไปพัฒนาสมรรถภาพทางกายให้เกิดประสิทธิภาพสูงสุด และให้ผู้พัฒนาสามารถดึงศักยภาพสูงสุดของตนเองได้ \n2.ด้านสุขภาพ (The aspect of Health) คือด้านที่มุ่งเน้นการศึกษาการส่งเสริมสุขภาพของคนทั่วไป ซึ่งครอบคลุมทุกช่วงวัยไม่ว่าจะเป็นเด็ก วัยรุ่น ผู้ใหญ่วัยทำงาน ผู้สูงอายุ ไปจนถึงการดูแล และส่งเสริมสุขภาพบุคคลพิเศษในกลุ่มต่างๆ  ซึ่งในการเรียนการสอนก็จะลงลึกไปถึงปัญหาสุขภาพ ในแต่ละช่วงวัย ข้อควรระวังต่างๆ ในแต่ละโรค และวิธีการกำหนดการออกกำลังกายให้เหมาะสมเฉพาะเจาะจงกับสภาวะนั้นๆ ',
      },
    ],
    imagePath: '/info/faculty/spsc.webp',
    location: 'https://maps.app.goo.gl/vUs2nhmuBwT66tgH6',
  },
  // คณะวิศวกรรมศาสตร์
  {
    id: 'eng',
    name: 'คณะวิศวกรรมศาสตร์',
    majors: [
      {
        id: 'eng1',
        name: 'วิศวกรรมโยธา (Civil Engineering)',
        description:
          'หลักสูตรของภาควิชาได้รับการออกแบบเพื่อให้นักศึกษาได้รับความรู้ทางการศึกษาและวิชาชีพอย่างกว้างขวาง ตลอดจนเสริมสร้างประสิทธิภาพในการเป็นผู้ปฏิบัติงานและนักวิจัยในสาขาวิศวกรรมโยธาสมัยใหม่ ซึ่งครอบคลุมงานด้านการวางแผน การวิเคราะห์ การออกแบบ และการก่อสร้างอาคาร สะพาน ฐานราก เขื่อน โครงสร้างทางชลศาสตร์ และสิ่งอำนวยความสะดวกด้านการขนส่ง หลักสูตรประกอบด้วยรายวิชาคณิตศาสตร์ วิทยาศาสตร์พื้นฐานที่เกี่ยวข้อง พื้นฐานทางวิศวกรรมทั่วไป และรายวิชาเฉพาะทางด้านวิศวกรรมโยธา นอกจากนี้ นักศึกษายังต้องเรียนรายวิชาที่คัดเลือกในด้านภาษาอังกฤษ มนุษยศาสตร์ และสังคมศาสตร์ เพื่อขยายมุมมองสำหรับการประกอบอาชีพในอนาคต ห้องปฏิบัติการในสาขาต่าง ๆ และหน่วยวิจัยของภาควิชาถูกจัดตั้งขึ้นเพื่อเสริมการเรียนการสอนในชั้นเรียน และเพื่อเอื้ออำนวยต่อการศึกษาหัวข้อขั้นสูง',
        fieldDescription:
          '1. สาขาวิชาวิศวกรรมโยธา มีพื้นฐาน 4 สาขาย่อยคือ \n1.1 วิศวกรรมโครงสร้าง (Structural Engineering) – ศึกษาเกี่ยวกับการ วิเคราะห์และออกแบบโครงสร้างของสิ่งปลูกสร้าง เพื่อให้สามารถรับ น้ําหนักและแรงต่าง ๆ ได้อย่างปลอดภัย \n1.2 วิศวกรรมธรณี (Geotechnical Engineering) - ศึกษาเกี่ยวกับ พฤติกรรมของดินที่ใช้รองรับโครงสร้างต่าง ๆ เพื่อให้สามารถออกแบบ ฐานรากและโครงสร้างในดินได้อย่างปลอดภัยและมั่นคง \n1.3 วิศวกรรมบริหารงานก่อสร้าง (Construction Management) – เรียน การควบคุมงาน วางแผนโครงการ บริหารเวลา งบประมาณ และความ ปลอดภัย \n1.4 วิศวกรรมขนส่ง (Transportation Engineering) – เรียนเกี่ยวกับระบบ การเดินทาง การวางแผนถนน การจราจร และการวิเคราะห์ระบบขนส่ง',
      },
      {
        id: 'eng2',
        name: 'วิศวกรรมไฟฟ้า (Electrical Engineering)',
        description:
          'หลักสูตรระดับปริญญาตรีได้รับการออกแบบเพื่อให้นักศึกษาได้รับพื้นฐานที่กว้างขวางและมั่นคงทางวิทยาศาสตร์กายภาพและวิศวกรรมไฟฟ้า ซึ่งมีความจำเป็นสำหรับนักศึกษาวิศวกรรมไฟฟ้าในการประกอบอาชีพในอนาคตทั้งในฐานะผู้ปฏิบัติงานหรือนักวิจัย รายวิชาทางวิศวกรรมไฟฟ้าเริ่มต้นในชั้นปีที่สอง โดยประกอบด้วยวิชาวงจรไฟฟ้า แม่เหล็กไฟฟ้า และสมบัติของวัสดุไฟฟ้าและอิเล็กทรอนิกส์ ในชั้นปีที่สาม นักศึกษาจะต้องศึกษารายวิชาพื้นฐานเพิ่มเติมที่เกี่ยวข้องกับกำลังไฟฟ้า อิเล็กทรอนิกส์ การสื่อสาร และระบบควบคุม หลักสูตรยังรวมรายวิชาคณิตศาสตร์วิศวกรรมเพื่อเสริมสร้างความสามารถด้านการวิเคราะห์ของนักศึกษา ในชั้นปีที่สี่ นักศึกษาสามารถเลือกสาขาความเชี่ยวชาญได้โดยการลงทะเบียนเรียนรายวิชาเลือกจากรายชื่อที่ได้รับการอนุมัติ รวมถึงวิชาโครงงานวิศวกรรมไฟฟ้า หลักสูตรประกอบด้วยงานห้องปฏิบัติการในสาขาต่าง ๆ ของวิศวกรรมไฟฟ้า โดยมีวัตถุประสงค์เพื่อพัฒนาทักษะของนักศึกษาในการใช้งานเครื่องมือทดสอบ ความสามารถในการแก้ไขปัญหาเชิงปฏิบัติ และความสามารถในการวิเคราะห์ผลการทดสอบ',
        fieldDescription:
          '1. สาขาวิชาวิศวกรรมไฟฟ้า มีการแบ่งย่อยเป็น 3 สาขา \n1.1 ไฟฟ้าสื่อสาร เรียนเกี่ยวกับ คลื่นแม่เหล็กไฟฟ้า โครงข่ายระบบสื่อสาร การส่งข้อมูลทางโทรคมนาคม การจัดการมัลติมีเดียต่าง ๆ \n1.2 ไฟฟ้ากําลัง เรียนเกี่ยวกับ อุปกรณ์ทางไฟฟ้า การผลิตกระแสไฟฟ้า การ ออกแบบระบบไฟฟ้าและการส่งไฟฟ้า การคํานวณปรับปรุงระบบต่าง ๆ เพื่อให้ได้ประสิทธิภาพมากที่สุด \n1.3 ไฟฟ้าทั่วไป โดยหลักสูตรใหม่นี้จะต่างจากปีก่อน ๆ ตรงที่สาขาไฟฟ้า ควบคุมและอิเล็กทรอนิกส์กลายเป็นสาขาไฟฟ้าทั่วไป ซึ่งเดิมทีแล้วสองสาขานี้จะเรียนเกี่ยวกับ การสร้างแบบจําลองคณิตศาสตร์ทางไฟฟ้า การวิเคราะห์สมรรถนะของระบบไฟฟ้า อุปกรณ์ที่เกี่ยวกับการใช้กระแส ไฟฟ้าทั้งหมด การออกแบบการสร้างแผงวงจร การดูแลการทํางานของ อุปกรณ์ไฟฟ้าในโรงงาน \n2. สาขาวิชาเซมิคอนดักเตอร์ (หลักสูตรนานาชาติ) เน้นการผลิตชิปวงจรอิเล็กทรอนิกส์ เพื่อตอบโจทย์อุตสาหกรรมเทคโนโลยีขั้นสูงทั่วโลก',
      },
      {
        id: 'eng3',
        name: 'วิศวกรรมเครื่องกล (Mechanical Engineering)',
        description:
          'หลักสูตรระดับปริญญาตรีได้รับการออกแบบเพื่อให้นักศึกษาได้รับพื้นฐานที่กว้างขวางและมั่นคงทางวิทยาศาสตร์กายภาพและวิศวกรรมไฟฟ้า ซึ่งมีความจำเป็นสำหรับนักศึกษาวิศวกรรมไฟฟ้าในการประกอบอาชีพในอนาคตทั้งในฐานะผู้ปฏิบัติงานหรือนักวิจัย รายวิชาทางวิศวกรรมไฟฟ้าเริ่มต้นในชั้นปีที่สอง โดยประกอบด้วยวิชาวงจรไฟฟ้า แม่เหล็กไฟฟ้า และสมบัติของวัสดุไฟฟ้าและอิเล็กทรอนิกส์ ในชั้นปีที่สาม นักศึกษาจะต้องศึกษารายวิชาพื้นฐานเพิ่มเติมที่เกี่ยวข้องกับกำลังไฟฟ้า อิเล็กทรอนิกส์ การสื่อสาร และระบบควบคุม หลักสูตรยังรวมรายวิชาคณิตศาสตร์วิศวกรรมเพื่อเสริมสร้างความสามารถด้านการวิเคราะห์ของนักศึกษา ในชั้นปีที่สี่ นักศึกษาสามารถเลือกสาขาความเชี่ยวชาญได้โดยการลงทะเบียนเรียนรายวิชาเลือกจากรายชื่อที่ได้รับการอนุมัติ รวมถึงวิชาโครงงานวิศวกรรมไฟฟ้า หลักสูตรประกอบด้วยงานห้องปฏิบัติการในสาขาต่าง ๆ ของวิศวกรรมไฟฟ้า โดยมีวัตถุประสงค์เพื่อพัฒนาทักษะของนักศึกษาในการใช้งานเครื่องมือทดสอบ ความสามารถในการแก้ไขปัญหาเชิงปฏิบัติ และความสามารถในการวิเคราะห์ผลการทดสอบ',
        fieldDescription:
          '1. สาขาวิชาวิศวกรรมเครื่องกล \n2. สาขาวิชาวิศวกรรมยานยนต์',
      },
      {
        id: 'eng4',
        name: 'วิศวกรรมอุตสาหการ (Industrial Engineering)',
        description:
          'รายวิชาทางวิศวกรรมอุตสาหการได้รับการออกแบบเพื่อผลิตวิศวกรที่มีความเชี่ยวชาญด้านการแก้ไขปัญหาและการตัดสินใจ เพื่อให้บรรลุวัตถุประสงค์ดังกล่าว หลักสูตรจึงเน้นด้านการผลิต การวางแผนและการควบคุม การศึกษางาน การประกันและควบคุมคุณภาพ การวิเคราะห์ระบบและกระบวนการโดยทั่วไป รวมถึงการประยุกต์ใช้เทคนิคการวิจัยดำเนินงานที่มุ่งเน้นการผลิต การประมวลผลข้อมูล และพื้นฐานการเขียนโปรแกรมคอมพิวเตอร์ นอกจากนี้ นอกเหนือจากเทคนิคที่กล่าวมาแล้ว ภาควิชายังให้ความสำคัญกับการพัฒนาการศึกษาในด้านมนุษยสัมพันธ์ในอุตสาหกรรม ดังเห็นได้จากหัวข้อเกี่ยวกับความสัมพันธ์ระหว่างมนุษย์ในอุตสาหกรรม การยศาสตร์ (กิจกรรมกลุ่มย่อย) และกฎหมายอุตสาหกรรม',
        fieldDescription: '1. สาขาวิชาวิศวกรรมอุตสาหการ',
      },
      {
        id: 'eng5',
        name: 'วิศวกรรมเคมี (Chemical Engineering)',
        description:
          'หลักสูตรวิศวกรรมเคมีมุ่งเน้นการ ออกแบบ ควบคุม พัฒนา และปรับปรุงกระบวนการผลิต ที่เกี่ยวข้องกับการแปลงสารเคมีตั้งต้นให้เป็นผลิตภัณฑ์ทางเคมี รายวิชาที่เรียนจึงเน้นพื้นฐานด้านกระบวนการผลิต เช่น Mass and Energy Balance ซึ่งศึกษาการดุลมวลและพลังงานในระบบการผลิต, Physical Chemistry for Chemical Engineering ที่เกี่ยวข้องกับอุณหพลศาสตร์ รวมถึงการเรียนรู้เกี่ยวกับอุปกรณ์ในกระบวนการผลิต เช่น Heat Exchanger และระบบการไหลของสาร นอกจากนี้ยังมีการเรียนด้าน การควบคุมและการออกแบบหอกลั่น ซึ่งเป็นจุดเด่นของภาควิชา เนื่องจากเป็นภาควิชาที่เรียนหอกลั่นอย่างครบถ้วน รายวิชาที่เกี่ยวข้องกับเคมีโดยตรงมีเพียง Chemistry for Chemical Engineering และ Chemistry for Chemical Engineering Laboratory ซึ่งมุ่งเน้น Organic Chemistry และการทำปฏิบัติการ เพื่อให้นักศึกษาสามารถนำความรู้ไปประยุกต์ใช้กับกระบวนการผลิตต่าง ๆ ได้',
        fieldDescription:
          '1. สาขาวิชาวิศวกรรมเคมี \n2. สาขาวิชาวิศวกรรมเคมีและกระบวนการ (หลักสูตรนานาชาติ)',
      },
      {
        id: 'eng6',
        name: 'วิศวกรรมเหมืองแร่และปิโตรเลียม (Mining and Petroleum Engineering)',
        description:
          'เป็นสาขาที่บูรณาการความรู้ทาง "วิศวกรรมศาสตร์" เข้ากับ "ธรณีวิทยา" เพื่อบริหารจัดการทรัพยากรใต้พิภพอย่างคุ้มค่า โดยใน ปีที่ 1 จะเริ่มจากพื้นฐานวิทยาศาสตร์และวิศวกรรมทั่วไปควบคู่กับวิชาธรณีวิทยากายภาพ (Physical Geology) เพื่อให้รู้จักกำเนิดโลกและหินชนิดต่างๆ จากนั้น ปีที่ 2 จะเป็นช่วงเวลาของการผสมผสานศาสตร์ โดยเรียนวิชากลศาสตร์วิศวกรรมเหมือนสาขาอื่น แต่เจาะลึกเรื่องแร่วิทยา (Mineralogy) และธรณีวิทยาโครงสร้าง เพื่อให้เข้าใจคุณสมบัติของเปลือกโลกอย่างละเอียด เมื่อเข้าสู่ ปีที่ 3 เนื้อหาจะเข้มข้นในเชิงเทคนิคเฉพาะทางที่หาเรียนที่อื่นไม่ได้ เช่น กลศาสตร์หิน (Rock Mechanics) ซึ่งแตกต่างจากกลศาสตร์ดินของโยธา รวมถึงเทคโนโลยีการเจาะ (Drilling) และการแต่งแร่ (Mineral Processing) เพื่อแยกแร่ธาตุออกจากหิน และใน ปีที่ 4 นิสิตสามารถเลือกเน้นกลุ่มวิชาที่สนใจได้ ทั้งด้าน เหมืองแร่และอุโมงค์ ที่เน้นการออกแบบการขุดเจาะอุโมงค์รถไฟฟ้าหรือเหมืองใต้ดิน หรือด้าน พลังงานและปิโตรเลียม ที่ศึกษาเรื่องแหล่งกักเก็บน้ำมันและก๊าซธรรมชาติ ควบคู่กับการเรียนรู้เรื่องเศรษฐศาสตร์ทรัพยากรและการจัดการสิ่งแวดล้อม เพื่อให้เป็นวิศวกรที่สามารถจัดหาวัตถุดิบต้นน้ำและพลังงานป้อนสู่อุตสาหกรรมโลกได้อย่างยั่งยืนครับ',
        fieldDescription:
          '1. สาขาวิชาวิศวกรรมทรัพยากรธรณี -หลักสูตรระดับปริญญาตรีสาขาวิศวกรรมทรัพยากรธรณีมุ่งเน้นการให้ความรู้พื้นฐานในทุกด้านของการพัฒนาทรัพยากรธรณี ภายหลังจากที่นักศึกษาได้รับพื้นฐานที่กว้างขวางด้านวิทยาศาสตร์และวิศวกรรมพื้นฐานในชั้นปีที่หนึ่งและปีที่สองแล้ว นักศึกษาจะได้รับความรู้เชิงลึกด้านวิศวกรรมทรัพยากรธรณีในภาคการศึกษาที่หนึ่งของชั้นปีที่สาม ซึ่งจะเป็นพื้นฐานสนับสนุนการเรียนรายวิชาขั้นสูงด้านวิศวกรรมทรัพยากรธรณีในชั้นปีที่สามและสี่ หลักสูตรครอบคลุมความรู้แบบสหสาขาวิชาอย่างกว้างขวางเกี่ยวกับหลักการพัฒนาทรัพยากรธรณี ได้แก่ ธรณีวิทยาเหมืองแร่ การสำรวจแร่ การประมาณปริมาณสำรองแร่ การพัฒนาเหมือง วิธีการทำเหมืองทั้งเหมืองเปิดและเหมืองใต้ดิน กลศาสตร์หิน จีโอสถิติ เศรษฐศาสตร์และการจัดการทรัพยากรธรณี การแต่งแร่และการใช้ประโยชน์จากแร่ รวมถึงประเด็นด้านสิ่งแวดล้อมของการดำเนินงานเหมืองแร่และทรัพยากร ซึ่งจัดการเรียนการสอนในระดับชั้นปีที่สามและสี่ \n2. สาขาวิชาวิศวกรรมปิโตรเลียม - หลักสูตรวิศวกรรมปิโตรเลียมระดับปริญญาตรีจัดให้มีรายวิชาหลักที่ครอบคลุมทุกด้านของวิศวกรรมปิโตรเลียม ได้แก่ สมบัติของหินและของไหล วิศวกรรมแหล่งกักเก็บ การหยั่งธรณีหลุมเจาะ วิศวกรรมการเจาะ วิศวกรรมการผลิต การดำเนินงานด้านการผลิต การแปรรูปก๊าซธรรมชาติ และเศรษฐศาสตร์ปิโตรเลียม',
      },
      {
        id: 'eng7',
        name: 'วิศวกรรมสิ่งแวดล้อมและความยั่งยืน (Environmental and Sustainable Engineering)',
        description:
          'เป้าหมายของภาควิชาวิศวกรรมสิ่งแวดล้อมและความยั่งยืน คือการสอนและฝึกอบรมนักศึกษาให้เป็นวิศวกรที่มีความรู้ความสามารถ (ทั้งเชิงทฤษฎีและปฏิบัติ) ด้านการสำรวจ การวางแผนและออกแบบ การให้คำปรึกษา และการดำเนินงานในสาขาต่อไปนี้ \n1. ระบบประปาและการปรับปรุงคุณภาพน้ำ \n2. ระบบระบายน้ำและการบำบัดน้ำเสีย \n3. สุขาภิบาลสิ่งแวดล้อม \n4. สิ่งแวดล้อมอุตสาหกรรม \n5. การควบคุมมลพิษทางอากาศ \n6. การควบคุมและการจัดการมลพิษทางน้ำ \n7. สุขาภิบาลชุมชนเมืองและชนบท \n8. การจัดการขยะมูลฝอย \n9. การบำบัดของเสียอันตราย \n10. การจัดการสิ่งแวดล้อม \nนอกจากนี้ นักศึกษายังมีหน้าที่ต้องใช้ความคิดสร้างสรรค์และความรับผิดชอบต่อตนเอง อีกทั้งได้รับการส่งเสริมให้สนใจเทคนิคต่าง ๆ คาดการณ์ปัญหาในอนาคต และพัฒนาความยั่งยืนของมนุษย์และธรรมชาติ',
        fieldDescription: '1. สาขาวิชาวิศวกรรมสิ่งแวดล้อม',
      },
      {
        id: 'eng8',
        name: 'วิศวกรรมสำรวจ (Survey Engineering)',
        description:
          'เป็นหลักสูตรระยะเวลา 4 ปี ออกแบบให้นักศึกษามีความรู้พื้นฐานด้านวิศวกรรมโดยทั่วไป และมีความรู้เชิงลึกด้านการสำรวจ การทำแผนที่ และเทคโนโลยีภูมิสารสนเทศเป็นพิเศษ หลักสูตรผสมผสานทั้งภาคทฤษฎีและภาคปฏิบัติ นักศึกษาจะได้รับประสบการณ์การใช้เครื่องมือสำรวจต่าง ๆ การทำแผนที่ด้วยคอมพิวเตอร์ และเทคโนโลยีภูมิสารสนเทศ ความมั่นใจและความสามารถในการแก้ไขปัญหาเชิงปฏิบัติในสาขาวิศวกรรมสำรวจจะได้รับการเสริมสร้างผ่านการฝึกภาคสนามและการฝึกงาน ทั้งนี้ นักศึกษาสามารถศึกษาความรู้เชิงลึกเพิ่มเติมได้ โดยได้รับความเห็นชอบจากภาควิชา ผ่านโครงงานระดับปริญญาตรี การศึกษาพิเศษ และรายวิชาเลือกที่ได้รับอนุมัติตามความสนใจของนักศึกษา หลักสูตรคาดว่าจะช่วยให้นักศึกษาสามารถเข้าใจโครงสร้างและข้อกำหนดของงานสำรวจ การทำแผนที่ และเทคโนโลยีภูมิสารสนเทศ ประยุกต์ใช้ทฤษฎีและเทคนิคในการปฏิบัติงานสำรวจและทำแผนที่ทั่วไปได้อย่างมีประสิทธิภาพ ประสิทธิผล และคุ้มค่า วิเคราะห์และใช้กลศาสตร์ของเครื่องมือเพื่อประเมินความถูกต้องและความแม่นยำที่ได้ ติดตามเทคโนโลยีและพัฒนาการใหม่ ๆ ในสาขาการสำรวจ การทำแผนที่ และเทคโนโลยีภูมิสารสนเทศ',
        fieldDescription: '1. สาขาวิชาวิศวกรรมสำรวจ',
      },
      {
        id: 'eng9',
        name: 'วิศวกรรมโลหการ (Metallurgical Engineering)',
        description:
          'ภาควิชาวิศวกรรมโลหการเปิดสอนหลักสูตรด้านวิศวกรรมโลหการและวัสดุ โดยหลักสูตรได้รับการออกแบบเพื่อให้นักศึกษามีความเข้าใจอย่างกว้างขวางเกี่ยวกับวัสดุทุกประเภท ได้แก่ โลหะ เซรามิก และพอลิเมอร์ โดยเน้นความรู้ด้านโลหะเป็นหลัก หลักสูตรระดับปริญญาตรีครอบคลุมเทคนิคพื้นฐานทางวิทยาศาสตร์และวิศวกรรมที่ใช้ในวิชาชีพ มีรายวิชาที่เกี่ยวข้องกับหลักการพื้นฐานของวิทยาศาสตร์และวิศวกรรมวัสดุ กระบวนการและการขึ้นรูปวัสดุ สมบัติและการประยุกต์ใช้ของวัสดุ รวมถึงการออกแบบวัสดุและกระบวนการ นอกจากนี้ หลักสูตรยังประกอบด้วยรายวิชาด้านการปฏิบัติงานทางวิศวกรรมจำนวนมาก เช่น ปฏิบัติการในห้องปฏิบัติการต่าง ๆ โครงงานวิศวกรรม การฝึกปฏิบัติงานทางวิศวกรรม และการศึกษาดูงานในภาคอุตสาหกรรม',
        fieldDescription: '1. สาขาวิชาวิศวกรรมโลหการและวัสดุ',
      },
      {
        id: 'eng10',
        name: 'วิศวกรรมคอมพิวเตอร์ (Computer Engineering)',
        description:
          'ภาควิชาวิศวกรรมคอมพิวเตอร์ (Computer Engineering) จะเรียน เกี่ยวกับการ มาออกแบบ วิเคราะห์ และสร้าง “ระบบ” ทางคอมพิวเตอร์ เพื่อให้ ทํางานได้ตามเป้าหมายที่กําหนด โดยเราจะเรียนตั้งแต่ระดับล่างสุด เช่น โครงสร้างข้อมูลและอัลกอริทึม สถาปัตยกรรมคอมพิวเตอร์ Network ไปจนถึงขั้นการประยุกต์ทําให้เป็นระบบ ต่าง ๆ ออกมา เช่น ระบบฝังตัว Web & Application บนอุปกรณ์คอมพิวเตอร์ และมือถือที่เราใช้ทุกวัน ไปจะถึงระบบคลาวด์และ AI ขนาดใหญ่ ซึ่งเราในฐานะ วิศวกรคอมพิวเตอร์ก็เป็นคนเขียน Software ที่มีประสิทธิภาพ และถูกต้องถูก หลักการและเพื่อสร้างและควบคุมระบบพวกนี้อีกที เนื่องจากคอมพิวเตอร์เป็นศาสตร์ที่ยังพัฒนาอยู่เรื่อย ๆ ตัวหลักสูตร ก็ได้มีการปรับให้ทันสมัยเช่นกัน โดยจะมีวิชาใหม่ ๆ ให้เลือกเรียน เช่น วิชาด้าน Data Science Al/ML และ Cloud Computing ',
        fieldDescription:
          '1. สาขาวิชาวิศวกรรมคอมพิวเตอร์ \n2. สาขาวิชาวิศวกรรมคอมพิวเตอร์และเทคโนโลยีดิจิทัล (CEDT)',
      },
      {
        id: 'eng11',
        name: 'วิศวกรรมนิวเคลียร์ (Nuclear Engineering)',
        description:
          'หลักสูตรมีลักษณะสหวิทยาการ และได้รับการออกแบบให้ครอบคลุมหลักการที่หลากหลายของเทคโนโลยีนิวเคลียร์และวิศวกรรมนิวเคลียร์ ตั้งแต่พื้นฐานด้านวิทยาศาสตร์และคณิตศาสตร์ ไปจนถึงการประยุกต์ใช้งานทางวิศวกรรมเฉพาะทาง สาขาความเชี่ยวชาญประกอบด้วย วิศวกรรมพลังงานนิวเคลียร์ การประยุกต์ใช้รังสีและเทคโนโลยีนิวเคลียร์ด้านสิ่งแวดล้อมและอุตสาหกรรม เครื่องมือวัดทางนิวเคลียร์ ความมั่นคงทางนิวเคลียร์ เทคโนโลยีเครื่องเร่งอนุภาค กระบวนการใช้รังสี การป้องกันรังสี และวัสดุนิวเคลียร์ นอกจากนี้ หลักสูตรระดับปริญญาตรีและปริญญาโทยังให้ทั้งความรู้ภาคทฤษฎีและภาคปฏิบัติสำหรับผู้ที่ประสงค์จะขอรับใบอนุญาตเจ้าหน้าที่ความปลอดภัยทางรังสี (Radiation Safety Officer: RSO)',
        fieldDescription: '1. สาขาวิชาวิศวกรรมนิวเคลียร์และรังสี',
      },
      {
        id: 'eng12',
        name: 'สำนักบริหารหลักสูตรวิศวกรรมนานาชาติ, ISE (International School of Engineering)',
        description:
          'เป็นหลักสูตร ""วิศวกรรมศาสตรบัณฑิต หลักสูตรนานาชาติ"" ของจุฬาลงกรณ์มหาวิทยาลัย หรือที่เรียกกันติดปากว่า ""วิศวะอินเตอร์ จุฬาฯ"" เป็นคณะที่จัดการเรียนการสอนเป็นภาษาอังกฤษทั้งหมด เน้นความเป็นสากล และมีการร่วมมือกับมหาวิทยาลัยชั้นนำในต่างประเทศ ',
        fieldDescription:
          '1. สาขาวิชาการออกแบบและการผลิตยานยนต์ (หลักสูตรนานาชาติ) \n2. สาขาวิชาวิศวกรรมนาโน (หลักสูตรนานาชาติ) \n3. สาขาวิชาวิศวกรรมสารสนเทศและการสื่อสาร (หลักสูตรนานาชาติ) \n4. สาขาวิชาวิศวกรรมอากาศยาน (หลักสูตรนานาชาติ) \n5. สาขาวิชาวิศวกรรมหุ่นยนต์และปัญญาประดิษฐ์ (หลักสูตรนานาชาติ) \n6. สาขาวิชาวิศวกรรมเซมิคอนดักเตอร์ (หลักสูตรนานาชาติ)',
      },
    ],
    imagePath: '/info/faculty/eng.webp',
    location: 'https://maps.app.goo.gl/Yrdn7tiRvRFSh6LdA?g_st=ic',
  },
  // คณะศิลปกรรมศาสตร์
  {
    id: 'faa',
    name: 'คณะศิลปกรรมศาสตร์',
    majors: [
      {
        id: 'faa1',
        name: 'ทัศนศิลป์',
        description:
          'ศึกษาทฤษฎีและการสร้างสรรค์เกี่ยวกับ Visual Arts หรือลักษณะของศิลปะบริสุทธิ์ อาทิ จิตรกรรม ประติมากรรม ภาพพิมพ์ และภาพถ่าย',
        fieldDescription:
          '(หลักสูตรปัจจุบัน) เรียนรวมทุกศาสตร์สาขา ได้แก่ จิตรกรรม ประติมากรรม ภาพพิมพ์ ศิลปะไทย และภาพถ่าย',
      },
      {
        id: 'faa2',
        name: 'ดุริยางคศิลป์',
        description:
          'ศึกษาวิชาการ ทฤษฎี และปฏิบัติการ ทางดุริยางคศาสตร์ไทยและตะวันตก เพื่อเป็นแนวทางในการสร้างสรรค์ผลิตผลทางดุริยางคศิลป์',
        fieldDescription:
          '1) สาขาดุริยางคศิลป์ไทย \n2) สาขาดุริยางคศิลป์ตะวันตก',
      },
      {
        id: 'faa3',
        name: 'นฤมิตศิลป์',
        description:
          'ศึกษาในเชิงทฤษฎีประยุกต์ศิลป์ โดยประยุกต์ผ่านพื้นฐานของศาสตร์วิจิตรศิลป์ เพื่อพัฒนาและแก้ไขปัญหาของสังคมในด้านต่างๆ ',
        fieldDescription:
          '1) เรขศิลป์ (Creative Graphics) \n2) หัตถศิลป์ (Creative Crafts) \n3) มัณฑนศิลป์ (Creative Decoration) \n4) นิทรรศการศิลป์ (Creative Exhibition)',
      },
      {
        id: 'faa4',
        name: 'นาฏยศิลป์',
        description:
          'ศึกษาหลักการทางวิชาการ ทฤษฎี และปฏิบัติการในด้านนาฏยศาสตร์ไทยและตะวันตก การบริหารจัดการการแสดง เพื่อผลิตผลงานทางนาฏยศิลป์',
        fieldDescription: '1) สาขานาฏยศิลป์ไทย \n2) สาขานาฏยศิลป์ตะวันตก',
      },
    ],
    location: 'https://share.google/9TS6eZaymKHG5xrSo',
    imagePath: '/info/faculty/faa.webp',
  },
  // คณะเศรษฐศาสตร์
  {
    id: 'econ',
    name: 'คณะเศรษฐศาสตร์',
    majors: [
      {
        id: 'econ1',
        name: 'หลักสูตรเศรษฐศาสตรบัณฑิต (ศ.บ.)',
        description:
          'มุ่งเน้นการเรียนการสอนด้านเศรษฐศาสตร์ควบคู่การใช้คณิตศาสตร์และสถิติ เพื่อพัฒนาทักษะการคิดวิเคราะห์ การแก้ปัญหา และการจัดการข้อมูลเชิงเศรษฐศาสตร์ เตรียมความพร้อมให้นิสิตสู่สายงานด้านการเงิน กลยุทธ์ และการวิเคราะห์ในองค์กรต่าง ๆ ผู้เรียนจะได้ศึกษาเศรษฐกิจทั้งในและต่างประเทศ รวมถึงประเด็นร่วมสมัยและการเปลี่ยนแปลงทางการเงินในยุคใหม่',
        fieldDescription:
          'หลักสูตรไม่มีการแยกสาขา แต่ในช่วง ปี 1 ถึง ปี 2 เทอม 1 จะเรียนเป็นวิชาพื้นฐาน เช่น เศรษฐศาสตร์จุลภาค มหภาค โดยตั้งแต่ปี 2 เทอม 2 เป็นต้นไป จะสามารถเลือกเรียนวิชาได้ตามที่ต้องการ ซึ่งแต่ละวิชาจะมีข้อกำหนดอยู่ว่าจะต้องผ่านวิชาใดมาก่อนบ้าง โดยที่ในแต่ละวิชา สามารถเลือกตอนเรียนได้ตามต้องการ',
      },
      {
        id: 'econ2',
        name: 'หลักสูตรศิลปศาสตรบัณฑิต (ศศ.บ.) เศรษฐศาสตร์นานาชาติ  EBA ',
        description:
          'มุ่งเน้นการเรียนการสอนด้านเศรษฐศาสตร์ควบคู่การใช้คณิตศาสตร์และสถิติ เพื่อพัฒนาทักษะการคิดวิเคราะห์ การแก้ปัญหา และการจัดการข้อมูลเชิงเศรษฐศาสตร์ เตรียมความพร้อมให้นิสิตสู่สายงานด้านการเงิน กลยุทธ์ และการวิเคราะห์ในองค์กรต่าง ๆ ผู้เรียนจะได้ศึกษาเศรษฐกิจทั้งในและต่างประเทศ รวมถึงประเด็นร่วมสมัยและการเปลี่ยนแปลงทางการเงินในยุคใหม่',
        fieldDescription:
          'หลักสูตรไม่มีการแยกสาขา โดยในช่วงปี 1–2 จะเรียนวิชาพื้นฐานด้านเศรษฐศาสตร์ สถิติ การเงิน และการบัญชี ก่อนเลือกเรียนวิชาเฉพาะทางตามความสนใจตั้งแต่ปี 3 เป็นต้นไป เมื่อสำเร็จการศึกษาได้รับวุฒิศิลปศาสตร์บัณฑิต',
      },
    ],
    location: 'https://maps.app.goo.gl/RaFfYpJvQzeDdYyJA',
    imagePath: '/info/faculty/econ.webp',
  },
  // คณะสถาปัตยกรรมศาสตร์
  {
    id: 'arch',
    name: 'คณะสถาปัตยกรรมศาสตร์',
    majors: [
      {
        id: 'arch1',
        name: 'ภาควิชาสถาปัตยกรรมศาสตร์ สาขาสถาปัตยกรรม',
        description:
          'มุ่งเน้นความเป็นวิชาชีพออกแบบทางสถาปัตยกรรม โดยคำนึงถึงการออกแบบสถาปัตยกรรมและสภาพแวดล้อมสรรค์สร้าง ที่มีการวิเคราะห์และแก้ไขปัญหาในเชิงกว้างเป็นภาพองค์รวม ตลอดจนมีความรับผิดชอบต่อสังคม',
        fieldDescription: '-',
      },
      {
        id: 'arch2',
        name: 'ภาควิชาสถาปัตยกรรมศาสตร์ สาขาสถาปัตยกรรมไทย',
        description:
          'มุ่งเน้นความเป็นวิชาชีพออกแบบทางสถาปัตยกรรมไทยโดยคำนึงถึงการออกแบบสถาปัตยกรรมและสภาพแวดล้อมสรรค์สร้าง ที่มีการวิเคราะห์และแก้ไขปัญหาในเชิงกว้างเป็นภาพองค์รวม ตลอดจนมีความรับผิดชอบต่อสังคมอย่างเหมาะสมกับกาลเทศะ',
        fieldDescription: '-',
      },
      {
        id: 'arch3',
        name: 'ภาควิชาสถาปัตยกรรมภายใน',
        description:
          'มุ่งเน้นการวางแผนและการจัดการพื้นที่โดยผสมผสานการใช้งานและศิลปะเข้าด้วยกัน จำเป็นต้องมีความรู้เกี่ยวกับรูปแบบสถาปัตยกรรม สภาพแวดล้อม พฤติกรรมมนุษย์ วัสดุก่อสร้างและเทคโนโลยี',
        fieldDescription: '-',
      },
      {
        id: 'arch4',
        name: 'ภาควิชาการวางแผนภาคและเมือง',
        description:
          'ปฏิบัติการในด้านการออกแบบเมือง (Urban Design) และด้านการวางแผน (Planning) การวิเคราะห์เชิงพื้นที่สำหรับการวางผังและออกแบบ ตลอดจนทฤษฎีและแนวคิดการพัฒนาเมืองเชิงลึกในทุกมิติทั้งเศรษฐกิจ สังคม กายภาพและสิ่งแวดล้อม',
        fieldDescription: '-',
      },
      {
        id: 'arch5',
        name: 'ภาควิชาภูมิสถาปัตยกรรม',
        description:
          'การผลิตผังบริเวณแสดงถึง การสร้างภูมิทศัน์ที่ประกอบไปด้วยการวางแผน การออกแบบ การกำหนดการใช้วัสดุพืชพันธุ์ในภูมิทัศน์ พัฒนาผังบริเวณ และระบบสาธารณูปโภคต่างๆ การพัฒนา อนุรักษ์ สร้างสรรค์ ประเมินผลกระทบของการพัฒนาและสร้างสรรค์ภูมิทัศน์นั้นต่อสิ่งแวดล้อม',
        fieldDescription: '-',
      },
      {
        id: 'arch6',
        name: 'ภาควิชาการออกแบบอุตสาหกรรม',
        description:
          'ส่งเสริมให้ผู้เรียนได้วางแผนการเรียนของตนเอง ทำให้ผู้เรียนสามารถผลิตผลงานในระดับนวัตกรรมในระบบอุตสาหกรรม หัตถอุตสาหกรรม อุตสาหกรรมดิจิตัล ตลอดจนอุตสาหกรรมใหม่ๆที่เปลี่ยนแปลงตามกระแสโลก',
        fieldDescription: '-',
      },
      {
        id: 'arch7',
        name: 'หลักสูตรนานาชาติ การออกแบบนิเทศศิลป์ CommDe',
        description:
          'เน้นการสื่อสารที่หลากหลาย ตั้งแต่การออกแบบเพื่อสิ่งพิมพ์ไปจนถึงการสื่อสารผ่านสื่อใหม่ การออกแบบกราฟิก ภาพประกอบ ภาพเคลื่อนไหว การออกแบบตามเวลา การออกแบบบนอินเทอร์เน็ต การออกแบบดิจิทัล และสื่อเกิดใหม่และสื่อแห่งอนาคต',
        fieldDescription: '-',
      },
      {
        id: 'arch8',
        name: 'หลักสูตรนานาชาติ การออกแบบสถาปัตยกรรม INDA',
        description:
          'การออกแบบและการสื่อสาร ประวัติศาสตร์และทฤษฎี ตลอดจนการก่อสร้างทางสถาปัตยกรรมและเทคโนโลยีสิ่งแวดล้อม มีจุดมุ่งหมายเพื่อแสดงให้เห็นว่าสถาปัตยกรรมเชื่อมโยงกับสาขาวิชาอื่นๆ อย่างไร',
        fieldDescription: '-',
      },
    ],
    location: 'https://maps.app.goo.gl/wRYfUTKsSASzW1uz8',
    imagePath: '/info/faculty/arch.webp',
  },
  // คณะสหเวชศาสตร์
  {
    id: 'ahs',
    name: 'คณะสหเวชศาสตร์',
    majors: [
      {
        id: 'ahs1',
        name: 'เทคนิคการแพทย์ (Medical Technology)',
        description:
          'สาขาเทคนิคการแพทย์เรียนเกี่ยวกับการปฏิบัติการเกี่ยวกับสารชีวโมเลกุลของมนุษย์ เช่น เลือด ปัสสาวะ อุจจาระและเรียนกับเกี่ยวกับจุลชีพแต่ละชนิด เรียนการเจาะเลือดเพื่อตรวจความผิดปกติ',
        fieldDescription:
          '1. ภาควิชาเคมีคลินิก เรียนเกี่ยวกับการตรวจวิเคราะห์สารชีวเคมีในร่างกาย รวมถึงการตรวจสารพันธุกรรม \n2. ภาควิชาจุลทรรศน์ศาสตร์คลินิก เรียนเกี่ยวกับการตรวจวิเคราะห์และหาความผิดปกติจากเลือด และตรวจวิเคราะห์ของเหลวในร่างกาย เช่น น้ำปัสสาวะ น้ำไขข้อ น้ำอสุจิ รวมถึงการตรวจอุจจาระเพื่อหาปรสิต \n3. ภาควิชาเวชศาสตร์การธนาคารเลือดและจุลชีววิทยาคลินิก เรียนเกี่ยวกับการตรวจหาเชื้อและจำแนกชนิดของเชื้อต่าง ๆ รวมถึงการตรวจวิเคราะห์ทางภูมิคุ้มกันคลินิก และธนาคารเลือด',
      },
      {
        id: 'ahs2',
        name: 'กายภาพบําบัด (Physical Therapy)',
        description:
          'เกี่ยวข้องกับการดูแลสุขภาพในแง่ของการส่งเสริมป้องกันรักษาและฟื้นฟูสุขภาพร่างกายและจิตใจโดยใช้วิธีตามหลักวิทยาศาสตร์และการใช้ เครื่องมือหรืออุปกรณ์ทางกายภาพบำบัด โดยมีเป้าหมายให้มีสุขภาพและมี ความสามารถในการทำงานของร่างกายอย่างเต็มที่',
        fieldDescription: '-',
      },
      {
        id: 'ahs3',
        name: 'โภชนาการและการกำหนดอาหาร (Nutrition and Dietetics)',
        description:
          'เรียนเกี่ยวกับหลักโภชนาการที่เหมาะสมกับแต่ละบุคคลในวัยต่างๆ และกลุ่มโรคต่างๆ หลักการให้คำปรึกษา และโภชนบำบัดเพื่อส่งเสริมกับการรักษาของแพทย์ และหลักวิทยาศาสตร์การอาหารเบื้องต้นที่สามารถนำมาต่อยอดเพื่อวิจัยและพัฒนาผลิตภัณฑ์อาหารสุขภาพได้อีกด้วย',
        fieldDescription:
          '1. โภชนคลินิก เรียนเกี่ยวกับการให้โภชนบำบัดแก่ผู้ป่วยในโรงพยาบาล \n2. โภชนชุมชน ให้ความรู้และคิดโครงการเพื่อส่งเสริมให้คนในชุมชมมีภาวะโภชนาการที่ดีขึ้น \n3. โภชนบริการ การจัดการบริการอาหารให้ผู้ป่วยในโรงพยาบาลตามคำสั่ง ทั้งอาหารทั่วไป อาหารเฉพาะโรคและอาหารทางสายให้อาหาร',
      },
      {
        id: 'ahs4',
        name: 'รังสีเทคนิค (Radiological Technology)',
        description:
          'หลักสูตรรังสีเทคนิคศึกษาเกี่ยวกับการใช้รังสีทางการแพทย์ ทั้งด้านวินิจฉัยและรักษาโรค รวมถึงพื้นฐานวิทยาศาสตร์การแพทย์ และการฝึกปฏิบัติงานในโรงพยาบาลชั้นนำของกระทรวงสาธารณสุข โดยรังสีเทคนิค จุฬาฯ เป็นความร่วมมือระหว่างคณะสหเวชศาสตร์ คณะแพทยศาสตร์ และโรงพยาบาลจุฬาลงกรณ์',
        fieldDescription:
          'แบ่งออกเป็น 3 ด้านหลัก ได้แก่ \n1. รังสีวินิจฉัย – การใช้เครื่องมือรังสี เช่น X-ray, CT, MRI เพื่อสร้างภาพทางการแพทย์ที่ใช้ในการวินิจฉัยโรค \n2. รังสีรักษา – การใช้รังสีเพื่อรักษามะเร็งและโรคอื่น ๆ ผ่านเทคนิคต่าง ๆ เช่น รังสีรักษาภายนอกและภายใน \n3. เวชศาสตร์นิวเคลียร์ – การใช้สารกัมมันตรังสีเพื่อวินิจฉัยและรักษาโรค เช่น การตรวจ PET scan',
      },
    ],
    location: 'https://maps.app.goo.gl/NYFfZPegMsyjzeEa8',
    imagePath: '/info/faculty/ahs.webp',
  },
  // คณะสัตวแพทยศาสตร์
  {
    id: 'vet',
    name: 'คณะสัตวแพทยศาสตร์',
    majors: [
      {
        id: 'vet1',
        name: 'หลักสูตรสัตวแพทยศาสตรบัณฑิต',
        description:
          'หลักสูตร 6 ปี ศึกษาเกี่ยวกับด้านวิทยาศาสตร์การแพทย์เพื่อนำมาใช้ในการประกอบวิชาชีพ การดูแลรักษาสุขภาพสัตว์และสวัสดิภาพสัตว์ การวินิจฉัยโรค การควบคุมและป้องกันโรค รวมไปถึงทางด้านสาธารณสุข เป็นต้น',
        fieldDescription: '-',
      },
    ],
    location: 'https://maps.app.goo.gl/wzMwLsX41NHa8F8J6?g_st=ic',
    imagePath: '/info/faculty/vet.webp',
  },
  // คณะอักษรศาสตร์
  {
    id: 'arts',
    name: 'คณะอักษรศาสตร์',
    majors: [
      {
        id: 'arts1',
        name: 'เอกภาษาไทย',
        description:
          'มุ่งพัฒนาสมรรถนะนิสิตให้เชี่ยวชาญด้านภาษา วรรณคดี และคติชนไทย โดยคณาจารย์ผู้ทรงคุณวุฒิหลากหลายแขนง ควบคู่ไปกับการเสริมสร้างเครือข่ายความสัมพันธ์ที่ยั่งยืนระหว่างกลุ่มนิสิต เพื่อให้ “ความรู้” งอกงามไปพร้อมกับ“ความอบอุ่น” อย่างแท้จริง',
        fieldDescription: '-',
      },
      {
        id: 'arts2',
        name: 'เอกภาษาอังกฤษ',
        description:
          'เอกอังกฤษไม่ได้เรียนเพียงแค่หลักไวยากรณ์เท่านั้น แต่ยังเรียนการใช้ภาษาอังกฤษที่ถูกต้องในหลาย ๆ บริบท การพูด การฟังที่ใช้งานได้จริง การแปลงานเขียนหลายแบบ รวมทั้งยังได้เรียนวรรณกรรมและการอ่าน คิด วิเคราะห์ และเรียนการมองภาษาในระดับโครงสร้างในกลุ่มรายวิชาภาษาศาสตร์ เพราะภาษาอังกฤษมีมากกว่าแค่กฎแกรมม่า',
        fieldDescription: '-',
      },
      {
        id: 'arts3',
        name: 'เอกประวัติศาสตร์',
        description:
          'เอกประวัติศาสตร์มีวิชาให้เลือกเรียนหลากหลาย ไม่ว่าจะเป็นประวัติศาสตร์สังคม วัฒนธรรม เพศสภาพ อารมณ์ ฯลฯ ในภูมิภาคต่าง ๆ ทั่วโลก อีกทั้งทุกคนจะได้สัมผัสวิธีการทำงานกับหลักฐานทางประวัติศาสตร์จริง ๆ ไม่ใช่แค่การจำชื่อคน และการเรียนประวัติศาสตร์จะไม่น่าเบื่ออีกต่อไป',
        fieldDescription: '-',
      },
      {
        id: 'arts4',
        name: 'เอกภูมิศาสตร์และภูมิสารสนเทศ',
        description:
          '“ภูมิศาสตร์” ไม่ใช่แค่เรื่องของแผนที่หรือการท่องจำประเทศ แต่คือการทำความเข้าใจโลกผ่านปฏิสัมพันธ์เชิงพื้นที่ระหว่างธรรมชาติกับผู้คน แบ่งเนื้อหาออกได้เป็น 3 สายย่อย ได้แก่ สายกายภาพ สายมนุษย์ และสายเทคนิค นอกจากนี้ที่สำคัญที่​สุด คือ มีกิจกรรมออกภาคสนามเกือบทุกเทอม ตั้งแต่การเดินสำรวจย่านชุมชน ขึ้นเขา ลงห้วย ไปจนถึงการได้ผจญภัยในถํ้า มีการเรียนสถิติ หรือวิชาของคณะวิศวะ รวมถึงจะได้ลองทำ Mini Project ทางภูมิศาสตร์​อยู่เสมอ',
        fieldDescription: '-',
      },
      {
        id: 'arts5',
        name: 'เอกสารสนเทศศึกษา',
        description:
          'เอกสารสนเทศพัฒนาจากบรรณารักษศาสตร์สู่การจัดการข้อมูลดิจิทัลที่เน้นความเป็นมนุษย์ ครอบคลุม Data Management, Content Creation และ Research & Innovation ฯลฯ เพื่อสร้างสรรค์เทคโนโลยีให้ตอบโจทย์ผู้ใช้ เข้าใจบริบทสังคม และจัดการมรดกทางวัฒนธรรมได้อย่างยั่งยืน ในโลกที่ข้อมูลไม่ได้อยู่แค่ในห้องสมุด',
        fieldDescription: '-',
      },
      {
        id: 'arts6',
        name: 'เอกศิลปการละคร',
        description:
          'นอกจากจะได้เรียนทักษะเฉพาะด้านเกี่ยวกับศิลปการละครที่มีมากกว่าการแสดงหรือการกำกับ ในเอกก็มีพื้นที่ให้นิสิตได้ทำโปรดักชันละครเวทีจำนวนมาก เป็นโอกาสให้ได้ลองฝึกทำงานกับศิลปะโดยนำทักษะความรู้ที่เรียนมาปฏิบัติจริง และฝึกการสื่อสาร การดีลกับผู้คนหลายแบบด้วย',
        fieldDescription: '-',
      },
      {
        id: 'arts7',
        name: 'เอกภาษาเอเชียใต้',
        description:
          'ศึกษาเกี่ยวกับอารยธรรมอินเดีย โดยจะมีจัดการเรียนการสอนครอบคลุม 3 ภาษาหลัก ได้แก่ 1. ภาษาสันสกฤต 2. ภาษาบาลี และ 3. ภาษาฮินดี นอกจากทักษะทางภาษาแล้ว ยังจะได้ศึกษาเจาะลึกในมิติต่าง ๆ ของอินเดีย ทั้งด้านประวัติศาสตร์ วรรณคดี เทวตำนาน และยังได้ศึกษาเกี่ยวกับคติความเชื่อและการสักการะบูชาเทพเจ้าตามขนบธรรมเนียมที่ถูกต้องอีกด้วย',
        fieldDescription: '-',
      },
      {
        id: 'arts8',
        name: 'เอกปรัชญา',
        description:
          'ปรัชญาคือ การสนทนาระหว่างตัวเราและโลกที่โอบอุ้มภูมิปัญญาและองค์ความรู้ของมนุษย์ สิ่งสำคัญไม่ใช่คำตอบที่ได้ แต่คือคำถามที่เกิดจากความสงสัยอันไร้ขอบเขต การเรียนปรัชญาจึงเป็นการมอบความรักต่อความรู้อย่างไม่รู้เบื่อนั่นเอง',
        fieldDescription: '-',
      },
      {
        id: 'arts9',
        name: 'เอกภาษาจีน',
        description:
          'เอกภาษาจีนศึกษาเนื้อหาเกี่ยวกับวัฒนธรรมจีนในด้านต่าง ๆ เช่น วิวัฒนาการตัวอักษรจีน วรรณกรรมจีน ภาษาจีนโบราณ ควบคู่ไปกับการเรียนสัทศาสตร์ภาษาจีน รวมไปถึงศึกษาประวัติศาสตร์และสภาพสังคมของจีนในปัจจุบัน นอกจากนี้ยังได้เรียนรู้ทักษะการฟัง-พูดและการแปลระหว่างภาษาจีนและภาษาไทยอีกด้วย',
        fieldDescription: '-',
      },
      {
        id: 'arts10',
        name: 'เอกภาษาญี่ปุ่น',
        description:
          'ถ้าพูดถึงเอกญี่ปุ่น จุฬาฯ ทุกคนก็คงนึกถึง “ภาษาญี่ปุ่น” แน่นอน แต่จริง ๆ แล้วเอกของเรามีทั้งวิชาเกี่ยวกับความรู้ทางภาษาอย่างไวยากรณ์หรือทักษะการฟัง-พูด-อ่าน-เขียน นอกจากนี้ก็ยังมีวิชาเกี่ยวกับวรรณคดี วัฒนธรรม ภาษาศาสตร์ และกลุ่มวิชาเพื่อวิชาชีพ ใครสนใจก็แวะมาเจอกันที่งาน Open House นะ',
        fieldDescription: '-',
      },
      {
        id: 'arts11',
        name: 'เอกภาษาเกาหลี',
        description:
          'มุ่งเน้นไปที่การเสริมสร้างและพัฒนาทักษะความสามารถทางภาษาเกาหลีของนิสิต ทั้งการพูด การฟัง และการเขียนอย่างเข้มข้น อีกทั้งยังมีการส่งเสริมทักษะด้านอื่น ๆ เพื่อให้นิสิตสามารถประยุกต์ความสามารถทางภาษาเข้ากับการประกอบอาชีพในอนาคตได้ โดยนิสิตสามารถเลือกศึกษารายวิชาเฉพาะทางตามความสนใจ อาทิ วิชาการแปล วิชาการล่าม วิชาวัฒนธรรม วิชาวรรณกรรม หรือวิชาภาษาศาสตร์ วิชาภาษาเกาหลีธุรกิจ เป็นต้น',
        fieldDescription: '-',
      },
      {
        id: 'arts12',
        name: 'เอกภาษาฝรั่งเศส',
        description:
          'เอกภาษาฝรั่งเศสไม่เพียงแค่เรียนภาษาฝรั่งเศสในด้านฟัง พูด อ่าน เขียน คำศัพท์และไวยากรณ์เท่านั้น แต่ยังมีวิชาในแขนงความรู้ต่าง ๆ เช่น อารยธรรม ภาษาศาสตร์ วรรณกรรม ศิลปะ ไปจนถึงการแปล การท่องเที่ยว และธุรกิจด้วย นอกจากนี้ เอกฝรั่งเศสยังสอนให้เข้าใจวัฒนธรรมและวิธีการจัดระบบความคิดแบบฝรั่งเศส',
        fieldDescription: '-',
      },
      {
        id: 'arts13',
        name: 'เอกภาษาเยอรมัน',
        description:
          'เอกเยอรมันเรียน Grammar และศัพท์ระดับ B1 ถึง C1 ได้ฝึกฟังพูดอ่านเขียน  ความรู้ด้านประวัติศาสตร์ ภูมิศาสตร์ การเมือง เศรษฐกิจ วรรณกรรมมีครบจบในหลักสูตร แต่ละวิชาได้ใช้จริง เช่น เยอรมันเพื่อธุรกิจ และการเขียน มีกิจกรรม First Meet และ Deutschcamp ประจำปี ที่สำคัญเรามีทุนเรียนภาษาและฝึกงานเสมอ',
        fieldDescription: '-',
      },
      {
        id: 'arts14',
        name: 'เอกภาษาสเปน',
        description:
          'ในเอกสเปน นอกจากจะมีบรรยากาศที่สนุกสนานเฮฮาแล้ว หลักสูตรของเรายังมีศาสตร์ที่หลากหลายทั้งฝั่งสเปนและลาตินอเมริกา ไม่ว่าจะเป็นวรรณกรรม ประวัติศาสตร์ ภาษาศาสตร์ วัฒนธรรม รวมทั้งทักษะทางวิชาชีพต่าง ๆ ในการทำงาน เช่น การแปล การล่าม การท่องเที่ยว กฎหมาย ธุรกิจ สื่อสารมวลชน ฯลฯ',
        fieldDescription: '-',
      },
      {
        id: 'arts15',
        name: 'เอกภาษาอิตาเลียน',
        description:
          'ประเทศอิตาลีถือเป็นหนึ่งในต้นธารของอารยธรรมตะวันตก การเรียนในเอกภาษาอิตาเลียนจึงไม่ได้เป็นแค่การศึกษาด้านทักษะการใช้ภาษาแต่รวมไปถึงประวัติศาสตร์ความคิด ภูมิหลังของศิลปะ วรรณกรรม อันเป็นส่วนกอปรให้เกิดความเป็นอิตาเลียนในทุกวันนี้ด้วยเช่นกัน',
        fieldDescription: '-',
      },
      {
        id: 'arts16',
        name: 'เอกภาษารัสเซีย',
        description:
          'เอกรัสเซียเรียนทั้งภาษาและวัฒนธรรม มีการเรียนทั้งภาคบรรยายและปฏิบัติ ครอบคลุมทักษะฟัง-พูด-อ่าน-เขียน การแปล วรรณกรรม ประวัติศาสตร์ ศิลปะ และสังคมการเมือง รวมถึงกิจกรรมและทัศนศึกษา เพื่อให้ใช้ภาษารัสเซียได้จริงและเข้าใจรัสเซียรอบด้าน',
        fieldDescription: '-',
      },
      {
        id: 'arts17',
        name: 'เอกวรรณกรรมโลกและการเขียนเชิงสร้างสรรค์',
        description:
          'มุ่งเน้นการอ่าน วิเคราะห์ วิจารณ์วรรณกรรมจากทั่วโลกหลากหลายภาษาและวัฒนธรรม พร้อมทั้งพัฒนาทักษะการเขียนเชิงสร้างสรรค์ในรูปแบบต่าง ๆ โดยเป็นการร่วมมือระหว่างภาควิชา วรรณคดีเปรียบเทียบ และภาควิชาภาษาอังกฤษ เพื่อให้สามารถผลิตงานเขียนที่มีเอกลักษณ์และสื่อสารได้หลากหลายวัฒนธรรม',
        fieldDescription: '-',
      },
      {
        id: 'arts18',
        name: 'เอกเทคโนโลยีภาษาและสารสนเทศ',
        description:
          'หลักสูตรที่ผสมผสานมนุษยศาสตร์กับเทคโนโลยีเข้าด้วยกัน ประกอบด้วยองค์ความรู้ 3 แขนง ได้แก่ ภาษาศาสตร์ สารสนเทศ และวิทยาการคอมพิวเตอร์ ศึกษาตั้งแต่ธรรมชาติและระบบของภาษามนุษย์โดยใช้ทฤษฎีทางวิทยาศาสตร์  การวิเคราะห์ข้อมูล การออกแบบระบบสารสนเทศ นอกจากนี้ยังมีการประยุกต์ใช้เทคโนโลยีเข้ากับงานด้านภาษาเพื่อมุ่งเน้นให้คอมพิวเตอร์สามารถตีความ ทำความเข้าใจ และจัดการภาษามนุษย์ได้ทั้งในรูปแบบภาษาพูดและภาษาเขียน เพื่อให้นิสิตมีความพร้อมและสามารถปรับตัวให้เข้ากับความท้าทายในโลกดิจิทัล',
        fieldDescription: '-',
      },
      {
        id: 'arts19',
        name: '(หลักสูตรนานาชาติ) ภาษาและวัฒนธรรม (BALAC)',
        description:
          'ศึกษาเกี่ยวกับ ภาษา วัฒนธรรม และสื่อในบริบทของโลกปัจจุบัน เพื่อทำความเข้าใจว่าสิ่งเหล่านี้มีผลต่อความคิดและพฤติกรรมของคนอย่างไร นอกจากนี้ยังได้ฝึกทักษะการคิดวิเคราะห์ การเขียน การนำเสนอ และการทำงานเป็นทีม โดยมี 3 concentrations (โท) ได้แก่ \n1. Media Culture เน้นศึกษาการวิเคราะห์สื่อ หนัง เพลง โซเชียลมีเดีย และวัฒนธรรมร่วมสมัย \n2. Global Culture เน้นศึกษาวัฒนธรรมโลก อัตลักษณ์ และประเด็นสังคม \n3. Language เน้นศึกษาการใช้ภาษาเพื่อการสื่อสาร การเขียน การนำเสนอ',
        fieldDescription: '-',
      },
    ],
    location: 'https://maps.app.goo.gl/SQnx4op4EhptLACR9?g_st=ipc',
    imagePath: '/info/faculty/arts.webp',
  },
  // สถาบันนวัตกรรมบูรณาการแห่งจุฬาลงกรณ์มหาวิทยาลัย
  {
    id: 'scii',
    name: 'สถาบันนวัตกรรมบูรณาการแห่งจุฬาลงกรณ์มหาวิทยาลัย',
    majors: [
      {
        id: 'scii1',
        name: 'Applied Digital Intelligence (เป็นสาขา ไม่มีภาควิชา)',
        description:
          'มุ่งเน้นการใช้ข้อมูล AI และเทคโนโลยีดิจิทัล เพื่อพัฒนาศักยภาพในการขับเคลื่อนนวัตกรรม ผ่านการเรียนรู้แบบลงมือทำจริง นักศึกษาจะได้ฝึกประยุกต์ใช้ดิจิทัลอินเทลลิเจนซ์แก้ปัญหาในหลากหลายอุตสาหกรรม เตรียมพร้อมสู่การเป็นผู้นำในเศรษฐกิจดิจิทัล',
        fieldDescription: '-',
      },
      {
        id: 'scii2',
        name: 'Health and Wellbeing (เป็นสาขา ไม่มีภาควิชา)',
        description:
          'มุ่งพัฒนาเทคโนโลยีและนวัตกรรมเพื่อยกระดับสุขภาพทั้งในระดับบุคคลและสังคม ผ่านการเรียนรู้แบบสหสาขา นักศึกษาจะประยุกต์งานวิจัย เทคโนโลยี และแนวคิดทางธุรกิจ เพื่อแก้ปัญหาด้านสุขภาพ ส่งเสริมคุณภาพชีวิตและความเป็นอยู่ที่ดีของชุมชน',
        fieldDescription: '-',
      },
      {
        id: 'scii3',
        name: 'Smart City and Sustainable Development (เป็นสาขา ไม่มีภาควิชา)',
        description:
          'เสริมศักยภาพให้นักศึกษาออกแบบและพัฒนาโซลูชันเมืองอย่างยั่งยืน สอดคล้องกับเป้าหมาย SDGs โดยผสานเทคโนโลยีล้ำสมัยกับแนวคิดการพัฒนาที่ยั่งยืน เพื่อแก้ปัญหาเมือง ทรัพยากร และการเปลี่ยนแปลงสภาพภูมิอากาศ สร้างเมืองอัจฉริยะที่ยืดหยุ่นและเป็นมิตรต่อสิ่งแวดล้อม',
        fieldDescription: '-',
      },
    ],
    location: 'https://maps.app.goo.gl/BtArHZ9HWn5bFRxYA',
    imagePath: '/info/faculty/scii.webp',
  },
  // คณะเกษตรศาสตร์บูรณาการ
  {
    id: 'cusar',
    name: 'คณะเกษตรศาสตร์บูรณาการ',
    majors: [
      {
        id: 'cusar1',
        name: 'การบริหารจัดการทรัพยากรการเกษตร',
        description:
          'หลักสูตรศิลปศาสตรและวิทยาศาสตรบัณฑิต (ศศ.วท.บ) สาขาวิชาการบริหารจัดการทรัพยากรการเกษตร มีแนวทางการผลิตบัณฑิตให้เป็น ""ผู้ประกอบการด้านธุรกิจการเกษตร ที่ถึงพร้อมด้วยจิตอาสา จิตสาธารณะในการพัฒนาชุมชนเกษตรกรรมในบ้านเกิด"" โดยมีแนวทางการให้ความรู้แบบองค์รวม ทั้งด้านการผลิตพืช ผลิตสัตว์ การแปรรูป การตลาด ตลอดห่วงโซ่คุณค่าของผลผลิตการเกษตรโดยเฉพาะอย่างยิ่งผลผลิตทางการเกษตรที่ใช้เป็นอาหาร รวมถึงการให้ความรู้ด้านกฎหมายที่เกี่ยวข้อง และสิ่งแวดล้อม',
        fieldDescription: '-',
      },
    ],
    location: 'https://maps.app.goo.gl/SNsRCSRWT2vdqGyW8',
    imagePath: '/info/faculty/cusar.webp',
  },
  // หอพักนิสิตจุฬาลงกรณ์มหาวิทยาลัย
  {
    id: 'dorm',
    name: 'หอพักนิสิตจุฬาลงกรณ์มหาวิทยาลัย',
    majors: [
      {
        id: 'dorm1',
        name: 'ตึกชวนชม',
        description: 'หอพักหญิง ประเภทรายเดือน',
        fieldDescription:
          'พักห้องละ 2 คน ค่าหอพัก 3,500 บาท/คน/เดือน (ไม่รวมค่าน้ำและค่าไฟ) มีเครื่องปรับอากาศ ห้องน้ำในตัว',
      },
      {
        id: 'dorm2',
        name: 'ตึกจำปี',
        description: 'หอพักชาย ประเภทรายเดือน',
        fieldDescription:
          'พักห้องละ 3-4 คน ค่าหอพัก 2,500 บาท/คน/เดือน (ไม่รวมค่าไฟ) มีเครื่องปรับอากาศ ห้องน้ำรวม',
      },
      {
        id: 'dorm3',
        name: 'ตึกพุดตาล',
        description: 'หอพักหญิง ประเภทรายเดือน',
        fieldDescription:
          'พักห้องละ 2-3 คน ค่าหอพัก 1,800 บาท/คน/เดือน (ไม่รวมค่าไฟ) ไม่มีเครื่องปรับอากาศ ห้องน้ำรวม',
      },
      {
        id: 'dorm4',
        name: 'ตึกพุดซ้อน',
        description: 'หอพักหญิง ประเภทรายเทอม',
        fieldDescription:
          'พักห้องละ 4 คน ค่าหอพัก 5,500 บาท/คน/เทอม (รวมค่าน้ำและค่าไฟ) ไม่มีเครื่องปรับอากาศ ห้องน้ำรวม',
      },
      {
        id: 'dorm5',
        name: 'ตึกจำปา',
        description: 'หอพักชาย ประเภทรายเทอม',
        fieldDescription:
          'พักห้องละ 4 คน ค่าหอพัก 4,500 บาท/คน/เทอม (รวมค่าน้ำและค่าไฟ) ไม่มีเครื่องปรับอากาศ ห้องน้ำรวม',
      },
    ],
    location: 'https://maps.app.goo.gl/j1DDqX6zEiLo2KXX6?g_st=ac',
    imagePath: '/info/faculty/dorm.webp',
  },
]

export interface Workshop {
  id: string
  name: string
  description: string
  hasPreregistered: boolean
  hasLimitParticipants: boolean
  url: string
  faculty: FacultyType
  timeSlot?: string // separated by /
  owner?: string
  locationName?: string
  locationURL?: string
}

export const WORKSHOP_DATA: Workshop[] = [
  // คณะครุศาสตร์
  {
    id: 'eduw1',
    name: 'การแข่งขันวิชาการและความเป็นเลิศทางวิทยาศาสตร์ ระดับมัธยมศึกษาตอนปลายv (คิดวิทย์ วิชาการ)',
    description:
      'การแข่งขันตอบปัญหาวิทยาศาสตร์ ประเภททีม 3 คน โดยมีขอบเขตของเนื้อหาในรายวิชาฟิสิกส์ เคมี และชีววิทยา ระดับชั้นมัธยมศึกษาตอนปลาย จาก หนังสือสถาบันส่งเสริมการสอนวิทยาศาสตร์และเทคโนโลยี (สสวท.) เป็นแหล่งอ้างอิง',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/kitwiz.edu.cu/',
    faculty: 'edu',
  },
  {
    id: 'eduw2',
    name: 'การแข่งขัน HIGH S-KRU DEBATE: The Second Competition การแข่งขันโต้วาที ระดับมัธยมศึกษาตอนปลาย ครั้งที่ 2',
    description:
      'การแข่งขันโต้วาที โดนรอบคัดเลือกเป็นการแสดงทรรศนะในหัวข้อ “สมควรสร้างสุขภาพใจทั่วหน้าให้กับนักเรียนในไทย” และในรอบ 8 ทีมสุดท้าย รอบ 4 ทีมสุดท้าย และรอบชิงชนะรองชนะเลิศอันดับ 2 และรอบชนะเลิศ เป็นการแข่งขันโต้วาที แสดงทรรศนะภายใต้ญัตติเกี่ยวกับการศึกษา',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/edu_cooldebate/',
    faculty: 'edu',
  },
  {
    id: 'eduw3',
    name: 'การแข่งขันการประกวดอ่านออกเสียงภาษาไทย เฉลิมพระเกียรติพระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัว เนื่องในวาระครบ 100 ปี วันสวรรคต พุทธศักราช 2568',
    description:
      'การแข่งขันประกวดอ่านออกเสียงภาษาไทยทั้งร้อยแก้วและร้อยกรอง (ทำนองเสนาะ) จากบทพระราชนิพนธ์ในพระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัว ซึ่งจะแบ่งรอบการแข่งขันเป็นรอบคัดเลือก และรอบชิงชนะเลิศ',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/th_langandcult/',
    faculty: 'edu',
  },
  {
    id: 'eduw4',
    name: 'ซุ้มวิชาเอก',
    description:
      'การนำเสนอข้อมูลพื้นฐานที่เกี่ยวข้องกับวิชาเอก โดยนำเสนอ 3 ประเด็น คือ การรับสมัครเข้าศึกษาต่อ ภาพรวมของการเรียนภายในวิชาเอก รายวิชาและกิจกรรมที่น่าสนใจ และในแต่ละวิชาเอกจะมีการจัดกิจกรรม หรือ workshop ที่เกี่ยวข้องกับสาขาวิชาเอก 20 ซุ้ม จัดแสดง ณ ห้องสุมน อมรวิวัฒน์ และห้องลีลาวดี',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/educu.openhouse/',
    faculty: 'edu',
  },
  {
    id: 'eduw5',
    name: 'นิทรรศการ',
    description:
      'นำเสนอนวัตกรรมทางการศึกษาที่พัฒนาโดยนิสิตและบุคลากรคณะครุศาสตร์ ซึ่งเป็นนวัตกรรมที่มุ่งพัฒนาและแก้ไขปัญหาที่เกิดขึ้นในกระบวนการเรียนรู้และระบบการศึกษาไทย และประชาสัมพันธ์ทุนการศึกษาภายในคณะ',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/educu.openhouse/',
    faculty: 'edu',
  },
  {
    id: 'eduw6',
    name: 'กิจกรรมกลาง',
    description:
      'กิจกรรม Workshop เกี่ยวกับการทำความรู้จักกับวิชาชีพครู หน้าที่ของครูเมื่อประกอบอาชีพครู รวมไปถึงกิจกรรมที่ออกแบบให้สอดคล้องกับวิชาครูที่ได้เรียนในคณะครุศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/educu.openhouse/',
    faculty: 'edu',
  },
  {
    id: 'eduw7',
    name: 'เวทีกลาง',
    description:
      'การเสวนาวิชาการ และเป็นพื้นที่แสดงศักยภาพของนักเรียนโรงเรียนสาธิตจุฬาลงกรณ์มหาวิทยาลัย และนิสิตคณะครุศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ผ่านการแสดงต่าง ๆ ติดตามรายละเอียดเพิ่มเติมได้ที่ Instagram : educu.openhouse',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/educu.openhouse/',
    faculty: 'edu',
  },
  // คณะจิตวิทยา
  {
    id: 'psyw1',
    name: 'The Psyche’s Symphony college (ซุ้มสอบเข้า)',
    description:
      'เป็นซุ้มแนะแนวข้อมูลการสอบเข้าของคณะจิตวิทยาทั้ง2ภาค ( ภาคไทยและภาคอินเตอร์ ) อย่างละเอียด ภายในซุ้มจะมีรายละเอียดของเกณฑ์การรับ ข้อมูลเอกสารที่ต้องยื่น ฯลฯ เพื่อให้ผู้เข้าร่วมได้เตรียมความพร้อมหากมีความสนใจจะเรียนต่อในคณะจิตวิทยา พร้อมทั้งยังแสดงเอกลักษณ์ของทั้งสองภาคเพื่อให้ผู้เข้าร่วมได้เข้าใจถึงความแตกต่างของแต่ละภาคและตัดสินใจเลือกภาควิชาที่เหมาะกับตนเองได้ดียิ่งขึ้น',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/psychecu.openhouse',
    faculty: 'psy',
  },
  {
    id: 'psyw2',
    name: 'Psyche’s Zenith Route (ซุ้มคณะ)',
    description:
      'เป็นซุ้มแนะนำคณะและสาขาวิชาจิตวิทยาที่เรียนเบื้องต้น ได้แก่ จิตวิทยาพัฒนาการ จิตวิทยาปริชาน จิตวิทยาคลินิก จิตวิทยาการปรึกษา จิตวิทยาสังคม จิตวิทยาอุตสาหกรรมและองค์กรณ์ เพื่อให้ผู้เข้าร่วมได้เห็นภาพของการเรียนจิตวิทยามากขึ้น แต่ละสาขาวิชาจะมีการแนะนำการเรียนและยกตัวอย่างเนื้อหาการเรียนผ่านกิจกรรมที่น่าสนใจ รวมถึงแนะนำการสาขาที่ทางคณะจิตวิทยาเปิดสอนในระดับชั้นป.โทและเอก',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/psychecu.openhouse',
    faculty: 'psy',
  },
  {
    id: 'psyw3',
    name: 'The Lunar Mindscape (ซุ้ม Workshop)',
    description:
      'Workshop บูรณาการความรู้ทางจิตวิทยาสาขาต่าง ๆ ให้ผู้เข้าร่วมได้ลงมือทำจริง ผ่านกิจกรรมจำลองสถานการณ์และการสะท้อนคิด เพื่อเห็นภาพคณะจิตวิทยา และสามารถนำไปประยุกต์ใช้ในชีวิตประจำวันได้',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/psychecu.openhouse',
    faculty: 'psy',
  },
  // คณะทันตแพทยศาสตร์
  {
    id: 'dentw1',
    name: 'ฐานแล็บดัดลวด (Orthodontics Lab)',
    description:
      'หลายคนอาจจะไม่รู้ว่าลวดกับงานทันตกรรมเป็นอีกอย่างที่เป็นของคู่กัน โดยเฉพาะในงานจัดฟัน และงานทันตกรรมประดิษฐ์ มาลองฝึกดัดลวด ตั้งแต่แบบรูปพื้นฐาน ไปจนถึงชิ้นงานที่หมอฟันใช้กันจริง ๆ ได้แล้วที่แล็บดัดลวด!',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.ticketmelon.com/dentcuopenhouse2026/lab-registration',
    faculty: 'dent',
    timeSlot:
      '08:50 - 09:30 / 09:40 - 10:20 / 10:30 - 11:10 / 11:20 - 12:00 / 12:50 - 13:30 / 13:40 - 14.20 / 14:30 - 15:10 / 15:20 - 16:00',
  },
  {
    id: 'dentw2',
    name: 'ฐานแล็บกรอฟัน-อุดฟัน',
    description:
      'หากเรานึกถึงงานของทันตแพทย์ สิ่งแรก ๆ ที่เรามักจะนึกถึงคือการอุดฟัน เพื่อรักษาฟันผุใช่มั้ยล่ะ! ในแล็บนี้จะให้น้อง ๆ ทุกคนจำลองตนเองเป็นทันตแพทย์  โดยจะได้ฝึกกรอฟันเอาฟันผุออกด้วยหัวกรอของทันตแพทย์ตัวจริง และได้อุดฟันด้วยวัสดุอุดจำลองด้วยนะ!',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.ticketmelon.com/dentcuopenhouse2026/lab-registration',
    faculty: 'dent',
    timeSlot:
      '08:50 - 09:30 / 09:40 - 10:20 / 10:30 - 11:10 / 11:20 - 12:00 / 12:50 - 13:30 / 13:40 - 14.20 / 14:30 - 15:10 / 15:20 - 16:00',
  },
  {
    id: 'dentw3',
    name: 'ฐานแล็บตรวจฟัน (Indirect Vision &Ergonomics Lab)',
    description:
      'เคยสงสัยกันไหมว่า..หมอฟันตรวจฟันในมุมที่มองไม่เห็นของช่องปากคนไข้ได้ยังไง? หมอฟันจำเป็นต้องมีกระจกหรือ “mouth mirror” ไว้ช่วย! แล็บตรวจฟันจะสอนน้อง ๆ ใช้อุปกรณ์ตรวจฟันในหุ่นคนไข้จำลอง พร้อมด้วยวิธีนั่งที่เหมาะสมกับการทำงานของหมอฟันด้วย!',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.ticketmelon.com/dentcuopenhouse2026/lab-registration',
    faculty: 'dent',
    timeSlot:
      '08:50 - 09:30 / 09:40 - 10:20 / 10:30 - 11:10 / 11:20 - 12:00 / 12:50 - 13:30 / 13:40 - 14.20 / 14:30 - 15:10 / 15:20 - 16:00',
  },
  {
    id: 'dentw4',
    name: 'ฐานแล็บเย็บแผล (Oral Surgery Lab)',
    description:
      'อีกหนึ่งการรักษาของหมอฟันที่แทบทุกคนต้องเจอสักครั้งในชีวิตอย่างการผ่าฟันคุด หมอฟันต้องทำการผ่าเหงือกเข้าไปเอาฟันออกมา สุดท้ายก็ต้องเย็บแผลที่ผ่าเหงือกเข้าไป เพราะฉะนั้นหมอฟันก็ต้องฝึกเย็บแผลด้วยนั่นเอง แล็บนี้เราจะพาน้อง ๆ มาฝึกเย็บแผล และได้เห็นว่าหมอฟันใช้อุปกรณ์อะไรและทำกันยังไงบ้าง!',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.ticketmelon.com/dentcuopenhouse2026/lab-registration',
    faculty: 'dent',
    timeSlot:
      '08:50 - 09:30 / 09:40 - 10:20 / 10:30 - 11:10 / 11:20 - 12:00 / 12:50 - 13:30 / 13:40 - 14.20 / 14:30 - 15:10 / 15:20 - 16:00',
  },
  {
    id: 'dentw5',
    name: 'Tour Gross',
    description:
      'ทำไมทันตแพทย์ถึงต้องเรียนร่างกายมนุษย์กันนะ? มาศึกษา Histology ในกล้องจุลทรรศน์ และ Gross Anatomy ในร่างอาจารย์ใหญ่ และความสำคัญของการศึกษาร่างกายมนุษย์กับอาชีพทันตแพทย์',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/dentcuopenhouse',
    faculty: 'dent',
    timeSlot: '8:50 - 12:00 / 12:50 - 16:00',
  },
  {
    id: 'dentw6',
    name: 'Tour Clinic',
    description:
      'พี่ ๆ ชั้นปีคลินิกจะพาน้อง ๆ ไปดู "ยูนิต" หรือเก้าอี้ทำฟันที่ใช้รักษาคนไข้จริงแบบกลุ่มเล็ก ได้เห็นสภาพแวดล้อมการเรียนชั้นปี 4-6 ของนิสิตทันตะ รวมไปถึงเครื่องมือที่ใช้ในเคสรักษาที่ต่างกันออกไป และยังได้ลองปรับเก้าอี้ทำฟันด้วยตัวเองอีกด้วยนะ!',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/dentcuopenhouse',
    faculty: 'dent',
    timeSlot: '8:50 - 12:00 / 12:50 - 16:00',
  },
  {
    id: 'dentw7',
    name: 'นิทรรศการ',
    description:
      'จัดแสดงชีวิตนิสิตทันตะ จุฬาฯ 6 ชั้นปี ทั้งปีพรีคลินิกและปีคลินิก ทั้งเรื่องเรียน กิจกรรม และอื่น ๆ อีกมากมาย',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/dentcuopenhouse',
    faculty: 'dent',
    timeSlot: '8:50 - 16:00',
  },
  {
    id: 'dentw8',
    name: 'Dent Talk',
    description:
      'Talk Show แชร์ประสบการณ์และคำแนะนำในหัวข้อต่าง ๆ โดยนิสิตปัจจุบันและนิสิตเก่าทันตะ จุฬาฯ ได้แก่ "ทันตะติดได้ ทำไงดีเอ่ย", "เรียนจบทั้งที ไปไหนต่อดีน้า", "วัน ๆ ของเด็กทันตะ", และ "ใต้เตียงทันตะ จุฬาฯ',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/dentcuopenhouse',
    faculty: 'dent',
    timeSlot:
      'Sat: 10:30 - 11:30 / Sat: 12:50 - 14:20 / Sun: 9:40 - 11:10 / Sun: 12:50 - 14:20',
  },
  {
    id: 'dentw9',
    name: 'Consult',
    description:
      'ปรึกษาพี่ ๆ ทันตะ จุฬาฯ แบบ 1:1 หรือแบบกลุ่มเล็ก ทั้งเรื่องการสอบเข้า ประสบการณ์ต่าง ๆ และการเรียนในคณะทันตะ',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/dentcuopenhouse',
    faculty: 'dent',
    timeSlot: '8:50 - 12:00 / 12:50 - 16:00',
  },
  {
    id: 'dentw10',
    name: 'พิพิธภัณฑ์ร่างกายมนุษย์',
    description:
      '1 ใน 11 พิพิธภัณฑ์ของโลกและพิพิธภัณฑ์แห่งแรกของเอเชียตะวันออกเฉียงใต้ ที่จัดแสดงร่างกายมนุษย์ด้วยเทคนิคพลาสติเนชัน จัดแสดงร่างกายและชิ้นส่วนมนุษย์แบบ 3 มิติ',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/dentcuopenhouse',
    faculty: 'dent',
    timeSlot: '8:50 - 16:00',
  },
  {
    id: 'dentw11',
    name: 'พิพิธภัณฑสถานวาจวิทยาวัฑฒน์',
    description:
      'แหล่งรวบรวมสิ่งอ้างอิงทางประวัติศาสตร์ วิวัฒนาการที่หลากหลายทางทันตกรรมของไทย เป็นศูนย์รวมความรู้แก่ผู้ศึกษาทางทันตแพทย์ได้ใช้ประโยชน์ในการเรียนรู้และศึกษาค้นคว้า พิพิธภัณฑสถานแห่งนี้มีประวัติความเป็นมาที่ยาวนาน นับเป็นความภูมิใจของชาวทันตแพทศาสตร์ จุฬาฯ เป็นอย่างยิ่ง',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/dentcuopenhouse',
    faculty: 'dent',
    timeSlot: '8:50 - 16:00',
  },
  {
    id: 'dentw12',
    name: 'เพนต์ฟัน (Paint Fun)',
    description:
      'กิจกรรมเพนต์ฟันปูนที่เปิดให้น้อง ๆ ได้นั่งพักผ่อนหย่อนใจ วาดลวดลาย และระบายสีปูนปลาสเตอร์รูปฟันซึ่งสามารถนำกลับบ้านเป็นของที่ระลึกจาก DentCU Open House 2026 ได้อีกด้วยยย',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/dentcuopenhouse',
    faculty: 'dent',
    timeSlot: '8:50 - 12:00 / 12:50 - 16:00',
  },
  // คณะนิติศาสตร์
  {
    id: 'laww1',
    name: 'นิทรรศการ',
    description:
      'มีการให้ความรู้ทางกฎหมาย ความหลากหลายทางอาชีพในสายนิติศาสตร์ และแนะนำชมรมภายในคณะนิติศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/lawchulaopenhouse?igsh=MWE0b3cyOTd5MW1r',
    faculty: 'law',
    timeSlot: '09:00 - 17:00',
    locationName:
      'Learning Space อาคารเทพทวารวดี คณะนิติศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย',
    locationURL: 'https://maps.app.goo.gl/tJokfjJPY3N4Ae5n8?g_st=ic',
  },
  {
    id: 'laww2',
    name: 'แนะแนวการศึกษา',
    description:
      'กิจกรรมแนะแนวการศึกษาทั้งในหลักสูตรนิติศาสตรบัณฑิตและหลักสูตร Bachelor of Laws, experiential learning in Business and Tech Law (LLBel) เพื่อค้นหาว่าตนเองเหมาะกับการเรียนในสาขาวิชา นิติศาสตร์หรือไม่ และเตรียมความพร้อมในการสอบเข้าศึกษาต่อในมหาวิทยาลัย',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/lawchulaopenhouse?igsh=MWE0b3cyOTd5MW1r',
    faculty: 'law',
    timeSlot: '09:00 - 16:00',
    locationName:
      'ห้องอุกฤษฏ์ ชั้น 5, ห้องสุรเกียรติและห้องประชุมตรงข้ามห้องสุรเกียรติ ชั้น 4 อาคารเทพทวารวดี คณะนิติศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย',
    locationURL: 'https://maps.app.goo.gl/tJokfjJPY3N4Ae5n8?g_st=ic',
  },
  {
    id: 'laww3',
    name: 'Workshop',
    description:
      'กิจกรรม Workshop เพื่อเปิดโอกาสให้ผู้เข้าร่วมงานได้ลองฝึกทักษะการเรียนรู้ และการคิดวิเคราะห์ในทางกฎหมาย แบ่งเป็นสายการเรียน ได้แก่ สายกฎหมายธุรกิจและภาษีอากร สายกฎหมายแพ่งและอาญา สายกฎหมายมหาชน และ สายกฎหมายระหว่างประเทศ',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://docs.google.com/forms/d/1W2OqaYGGN1G5XRHWcYiFlmdnFYgdDjCgxlIqqVp0gWo/edit',
    faculty: 'law',
    timeSlot:
      '09:00 - 10:00 / 10:00 - 11:00 / 11:00 - 12:00 / 13:00 - 14:00 / 14:00 - 15:00 / 15:00 - 16:00',
    locationName:
      'ห้อง 605, 606, 904, 905 อาคารเทพทวารวดี คณะนิติศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย',
    locationURL: 'https://maps.app.goo.gl/tJokfjJPY3N4Ae5n8?g_st=ic',
  },
  {
    id: 'laww4',
    name: 'เวทีกลาง',
    description:
      'ในบริเวณเวทีกลาง มีการจัดกิจกรรมตลอดทั้งช่วงเช้าและช่วงบ่าย โดยกิจกรรมในช่วงเช้าเป็นการจัดทอล์คโชว์ตลอดระยะเวลา 2 วัน โดยมีนิสิตคณะนิติศาสตร์ จุฬาลงกรณ์มหาวิทยาลัยร่วมเป็นวิทยากร นำเสนอประเด็นและหัวข้อที่แตกต่างกันในแต่ละวัน และกิจกรรมช่วงบ่ายเป็นกิจกรรมการแสดงจากหลากหลายชมรมภายในคณะนิติศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย เพื่อแสดงถึงความวามหลากหลายของกิจกรรมที่จะเกิดขึ้นในรั้วคณะนิติศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/lawchulaopenhouse?igsh=MWE0b3cyOTd5MW1r',
    faculty: 'law',
    timeSlot: '08:00 - 16:00',
    locationName:
      'ลานอเนกประสงค์ อาคารเทพทวารวดี คณะนิติศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย',
    locationURL: 'https://maps.app.goo.gl/tJokfjJPY3N4Ae5n8?g_st=ic',
  },
  {
    id: 'laww5',
    name: 'ศาลจำลอง',
    description:
      'กิจกรรมศาลจำลองเพื่อให้ผู้ร่วมงาน ได้รู้จักและเห็นถึงกระบวนการในการประสาทความยุติธรรมของไทย แบ่งเป็น 2 รอบ รอบละ 60 คน และจะมีการถ่ายทอดสด ณ เวทีกลางร่วมด้วย',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://docs.google.com/forms/d/1W2OqaYGGN1G5XRHWcYiFlmdnFYgdDjCgxlIqqVp0gWo/edit',
    faculty: 'law',
    timeSlot: '10:00 - 12:00 / 13:00 - 15:00',
    locationName:
      'ห้อง 1205, 1005 อาคารเทพทวารวดี คณะนิติศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย',
    locationURL: 'https://maps.app.goo.gl/tJokfjJPY3N4Ae5n8?g_st=ic',
  },
  // คณะนิเทศศาสตร์
  {
    id: 'commartsw1',
    name: 'Chitchat',
    description:
      'กิจกรรมที่ผู้เข้าร่วมงานสามารถพูดคุยสอบถามข้อมูลต่างๆกับนิสิตปัจจุบันได้อย่างใกล้ชิด ไม่ว่าจะเป็นเรื่องการสอบเข้า การเรียน กิจกรรม เเละการใช้ชีวิต',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/nitadecuopenhouse?igsh=ZzE0MjN3cDl3N2Vr',
    faculty: 'commarts',
    locationName: 'อาคารมงกุฎสมมติวงศ์',
    locationURL: 'https://share.google/TAFTVpd3DXusV7K7l',
  },
  {
    id: 'commartsw2',
    name: 'Exhibition',
    description:
      'เนื้อหาภายในนิทรรศการจะมีการให้ข้อมูลเกี่ยวกับทุกภาควิชารวมถึงจุดถ่ายรูปน่ารักๆ ให้มาเช็คอิน นอกจากนิทรรศการหลักเเล้วจะมีการเเสดงผลงานจากนิสิตจากแต่ละภาควิชา (ไม่ทุกภาค) ให้เดินชมเช่นกัน',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/nitadecuopenhouse?igsh=ZzE0MjN3cDl3N2Vr',
    faculty: 'commarts',
    timeSlot: '9:00 - 16:00',
    locationName: 'อาคารมงกุฎสมมติวงศ์',
    locationURL: 'https://share.google/TAFTVpd3DXusV7K7l',
  },
  {
    id: 'commartsw3',
    name: 'Showcase',
    description:
      'ผู้เข้าร่วมงานสามารถรับชมภาพยนตร์สั้นเเละผลงานในรูปแบบวิดิโอต่างๆที่สร้างโดยนิสิตคณะนิเทศศาสตร์ที่ห้อง screening room ของคณะ',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/nitadecuopenhouse?igsh=ZzE0MjN3cDl3N2Vr',
    faculty: 'commarts',
    timeSlot: '9:00 - 16:00',
    locationName: 'อาคารมงกุฎสมมติวงศ์ ',
    locationURL: 'https://share.google/TAFTVpd3DXusV7K7l',
  },
  {
    id: 'commartsw4',
    name: 'Studio Room Tour',
    description:
      'กิจกรรมที่ทีมงานนิสิตคณะนิเทศศาสตร์จะพาผู้เข้าร่วมงานเดินชมห้อง studio ขนาดใหญ่รวมถึงห้อง control room ของคณะ โดยกิจกรรมนี้จะเปิดให้ผู้เข้าร่วมงานเดินชมเป็นรอบๆ',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/nitadecuopenhouse?igsh=ZzE0MjN3cDl3N2Vr',
    faculty: 'commarts',
    locationName: 'อาคารมงกุฎสมมติวงศ์ ชั้น 1M ห้อง CART1 CDM2B',
    locationURL: 'https://share.google/TAFTVpd3DXusV7K7l',
  },
  {
    id: 'commartsw5',
    name: 'Workshop Film',
    description:
      'ผู้เข้าร่วมงานจะได้ลองลงมือทำกิจกรรมที่มีเนื้อหาเกี่ยวกับภาควิชาศิลปะภาพยนตร์ ตัวอย่างเช่น ฐานกิจกรรมอุปกรณ์กล้องเเละเสียง รายละเอียดโปรดติดตามเพิ่มเติม',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/nitadecuopenhouse?igsh=ZzE0MjN3cDl3N2Vr',
    faculty: 'commarts',
    owner: 'ภาควิชาศิลปะภาพยนตร์',
    locationName: 'อาคารมงกุฎสมมติวงศ์',
    locationURL: 'https://share.google/TAFTVpd3DXusV7K7l',
  },
  {
    id: 'commartsw6',
    name: 'Workshop PA',
    description:
      'ผู้เข้าร่วมงานจะได้ลองลงมือทำกิจกรรมที่มีเนื้อหาเกี่ยวกับภาควิชาศิลปะการแสดง รายละเอียดโปรดติดตามเพิ่มเติม',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/nitadecuopenhouse?igsh=ZzE0MjN3cDl3N2Vr',
    faculty: 'commarts',
    owner: 'ภาควิชาการสื่อสารการเเสดง',
    locationName: 'อาคารมงกุฎสมมติวงศ์',
    locationURL: 'https://share.google/TAFTVpd3DXusV7K7l',
  },
  // คณะพาณิชยศาสตร์และการบัญชี
  {
    id: 'cbsw1',
    name: 'ห้องหลักสูตร',
    description:
      'เป็นพื้นที่กิจกรรมที่แต่ละหลักสูตรจัดเตรียมกิจกรรมเชิงวิชาการแบบเจาะลึก โดยหมุนเวียนไปตามแต่ละหลักสูตร ใช้เวลาประมาณ 1 ชั่วโมง น้อง ๆ จะได้รับประสบการณ์เชิงปฏิบัติการเกี่ยวกับเนื้อหาวิชาเฉพาะทาง ซึ่งรายละเอียดเพิ่มเติมจะนำเสนอในหัวข้อห้องหลักสูตร รวมถึงเชิญศิษย์เก่าที่ประสบความสำเร็จ มาเล่าประสบการณ์ตรงในการทำงาน สถานการณ์ตลาดแรงงาน ทักษะที่จำเป็นในโลกการทำงานปัจจุบัน เพื่อช่วยในการตัดสินใจเลือกสายการศึกษาที่เหมาะสม',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://forms.gle/kjhZ23mANPczkmFY6',
    faculty: 'cbs',
    timeSlot: '8.40 - 10.10 / 10.25 - 11.55 / 12.40 - 14.10 / 14.25 - 15.55',
    locationName: 'อาคารไชยยศสมบัติ',
  },
  {
    id: 'cbsw2',
    name: 'Campus Tour',
    description:
      'กิจกรรม Campus Tour พาผู้เข้าร่วมชมสิ่งอำนวยความสะดวกและห้องปฏิบัติการที่สำคัญ ได้แก่ CBS Lounge ที่เปิดพื้นที่อิสระสำหรับการทำกิจกรรมกลุ่ม และ Financial Laboratory ซึ่งมีเทคโนโลยีและฐานข้อมูลสำหรับงานวิจัยและการวิเคราะห์ทางการเงินชั้นนำระดับโลก เพื่อให้น้อง ๆ ได้เห็นสภาพแวดล้อมการเรียนรู้อย่างแท้จริง',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://forms.gle/GsArkyGEQHhfRJV58',
    faculty: 'cbs',
    timeSlot: '8.40 - 10.10 / 10.25 - 11.55 / 12.40 - 14.10 / 14.25 - 15.55',
    locationName: 'อาคารไชยยศสมบัติ',
  },
  {
    id: 'cbsw3',
    name: 'บูธกลางให้คำแนะนำ',
    description:
      'ห้องแนะแนวกลางเป็นพื้นที่ที่นิสิตจากหลักสูตรต่าง ๆ ได้แก่ หลักสูตรบัญชี หลักสูตรบริหาร หลักสูตรสถิติ และหลักสูตร BBA มาให้คำแนะนำแก่น้อง ๆ โดยตรงเกี่ยวกับการเลือกหลักสูตร แนวทางการเรียน และภาพรวมชีวิตในรั้วมหาวิทยาลัย',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://forms.gle/BN2XWEV3Xr2g482M6',
    faculty: 'cbs',
    locationName: 'อาคารไชยยศสมบัติ',
  },
  {
    id: 'cbsw4',
    name: 'one-on-one',
    description:
      'เป็นพื้นที่สำหรับน้อง ๆ ที่มีข้อสงสัยและอยากรู้เพิ่มเติมเกี่ยวกับคณะบัญชีจุฬาได้มาพูดคุยกับพี่แนะแนวจากแต่ละสาขา มาคอยให้คำปรึกษาน้องแบบ 1:1',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://forms.gle/BN2XWEV3Xr2g482M6',
    faculty: 'cbs',
    locationName: 'คณะ',
  },
  {
    id: 'cbsw5',
    name: 'เวทีกลาง',
    description:
      'พื้นที่จัดแสดงความสามารถและศักยภาพของนิสิต ผ่านการแสดงดนตรีสากลและดนตรีไทย เพื่อสร้างแรงบันดาลใจและเพิ่มบรรยากาศแห่งความสนุกสนานตลอดกิจกรรม อีกทัเงยังมีทอล์คโชว์จากรุ่นพีที่กำลังศึกษามาให้ข้อมูลและเล่าประสบการณ์เกี่ยวกับชีวิตในรั้วบัญชีจุฬา',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://forms.gle/BN2XWEV3Xr2g482M6',
    faculty: 'cbs',
    locationName: 'คณะ',
  },
  {
    id: 'cbsw6',
    name: 'workshop',
    description:
      'พื้นที่ที่มุ่งเน้นการจัดกิจกรรมนันทนาการเพื่อเพิ่มความสนุกสนาน สร้างบรรยากาศที่ผ่อนคลายและเป็นกันเอง พร้อมกิจกรรมและของที่ระลึกให้น้อง ๆ ได้รับประสบการณ์และความประทับใจกลับไป',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://forms.gle/BN2XWEV3Xr2g482M6',
    faculty: 'cbs',
    locationName: 'คณะ',
  },
  {
    id: 'cbsw7',
    name: 'Sife MasterClass',
    description:
      'SIFE Master Class เป็นกิจกรรมที่เน้นการลงมือปฏิบัติจริงเกี่ยวกับธุรกิจเพื่อสังคมผ่านการเรียนรู้แบบ Activity-based Learning ผู้เข้าร่วมจะได้ฝึกทักษะการเป็นที่ปรึกษาธุรกิจ การวางกลยุทธ์ และการทำงานเป็นทีม เพื่อแก้ไขปัญหาธุรกิจอย่างเป็นรูปธรรม พร้อมรับประกาศนียบัตรจากคณะพาณิชยศาสตร์และการบัญชี',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/cbs.openhouse?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
    faculty: 'cbs',
    locationName: 'อาคาร 50 ปี',
  },
  {
    id: 'cbsw8',
    name: 'CBS Brunch & Buddy',
    description:
      '“อยากรู้จัก CBS ต้องคุยกับที่สุดของ CBS” CBS Brunch & Buddy จะพาทุกคนไปค้นหาคำตอบ “Why CBS?” เพราะชีวิตในมหาวิทยาลัย “ไม่ใช่เพียงแต่เลือกคณะที่ชอบ แต่ต้องเป็นคณะที่ใช่” ผ่าน Life-Changing Conversation บนโต๊ะอาหารกับรุ่นพี่คณะบัญชี จุฬาฯ และเพื่อนต่างโรงเรียนแบบสุด Exclusive เกี่ยวกับเรื่องราวและประสบการณ์จากคณะบัญชีในด้าน การเรียน กิจกรรม และการทำงาน ของรุ่นพี่มากกว่า 20 คน จากทุกภาควิชา)',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/cbs.openhouse?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw==',
    faculty: 'cbs',
    locationName: 'อาคารไชยยศสมบัติ',
  },
  // คณะแพทย์ศาสตร์

  // คณะเภสัชศาสตร์
  {
    id: 'pharmw1',
    name: 'ฐานแนะแนวการเรียน',
    description:
      'ฐานแนะแนวการเรียนของเราพร้อมให้คำแนะนำและตอบคำถามน้อง ๆ ทุกคนตั้งแต่หลักสูตร การเตรียมตัวสอบเข้า การเรียนและสังคมภายในคณะจากประสบการณ์ตรงของรุ่นพี่ตัวจริง กิจกรรมสุด EXCLUSIVE แบบนี้ จะพลาดไม่ได้แล้วนะ!',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/rxcu_openhouse?igsh=NjUxam5yZGh0YzBu',
    faculty: 'pharm',
    timeSlot: '8:15 - 12:00 / 12:30 - 16:15',
    locationName: 'ใต้อาคาร 80 ปี หน้าโรงอาหาร ',
    locationURL: 'https://maps.app.goo.gl/NafCdUmNp18ACybb7',
  },
  {
    id: 'pharmw2',
    name: 'การแนะแนววิชาชีพ',
    description:
      'เภสัชที่ไม่ได้อยู่แค่ในร้านยา และบทบาทในยุคเอไอเฟื่องฟู พบกับวิทยากรสุด exclusive ที่จะเปิดมุมมองชาวเภสัชในทุก ๆ ด้าน กับการบรรยายหัวข้อ “บทบาทของเภสัชกรในยุคโลกาภิวัตน์” พิเศษสุด ๆ ในช่วงถาม-ตอบ ที่พร้อมตอบคำถามที่ทุกคนอยากรู้จากผู้เชี่ยวชาญที่หาจากที่ไหนไม่ได้!!!',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/rxcu_openhouse?igsh=NjUxam5yZGh0YzBu',
    faculty: 'pharm',
    timeSlot: '9:00 - 11:00 / 13:00 - 15:00',
    locationName: 'อาคาร 80 ปี ห้อง 702',
    locationURL: 'https://maps.app.goo.gl/NafCdUmNp18ACybb7',
  },
  {
    id: 'pharmw3',
    name: 'ฐานวิชาการ Manufacturing',
    description:
      'เภสัชกรสายการผลิตคืออะไร? ต้องมามุงกันที่ฐาน MANUFACTURING! เราสามารถควบคุมเครื่องจักรและเครื่องมือที่หลากหลาย เรียนรู้ตั้งแต่เริ่มว่ายาเม็ด เกิดขึ้นมาได้อย่างไร รวมถึงขั้นตอนการทดสอบคุณภาพยา และได้ลองใช้เครื่องมือที่ใช้อุตสาหกรรมจริง',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/rxcu_openhouse?igsh=NjUxam5yZGh0YzBu',
    faculty: 'pharm',
    timeSlot:
      '8:15-9:00 / 9:15-10:00 / 10:15-11:00 / 11:15-11:45 / 12:45-13:30 / 13:45-14:30 / 14:45-15:30 / 15:45-16:15',
    locationName: 'อาคารเภสัชศาสตร์ ห้องตอกเม็ดยา',
    locationURL: 'https://maps.app.goo.gl/NafCdUmNp18ACybb7',
  },
  {
    id: 'pharmw4',
    name: 'ฐานวิชาการ Medical Chemistry',
    description:
      "MED CHEM ไม่ได้มีดีแค่หลอดทดลอง แต่ยังมี 'เครื่องมือวิเคราะห์สุดไฮเทค' มาโชว์น้อง ๆ อีกด้วย!  มาดูกันว่า QC ยาเขาทำกันยังไง มาเจอกันได้ที่ฐาน MED CHEM เลยจ้า!",
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/rxcu_openhouse?igsh=NjUxam5yZGh0YzBu',
    faculty: 'pharm',
    timeSlot: '8:15 - 9:55 / 10:05 - 11:45 / 12:45 - 14:25 / 14:35 - 16:15',
    locationName: 'อาคาร 80 ปี ห้อง 301',
    locationURL: 'https://maps.app.goo.gl/NafCdUmNp18ACybb7',
  },
  {
    id: 'pharmw5',
    name: 'ฐานวิชาการ Pharmaceutics',
    description:
      'มาเปิดเบื้องหลังอีกมิติของยา ที่ฐาน PHARMACEUTICS มารู้จักกับยารูปแบบอื่น ๆ ที่ไม่ได้มีแค่ยาเม็ดหรือแคปซูล พร้อมเชื่อมโยงความรู้จากยาไปสู่ผลิตภัณฑ์ดูแลผิวที่ใช้ในชีวิตประจำวัน ใครอยากรู้ว่าออกแบบและพัฒนากันยังไง ฐาน PHARMACEUTICS ห้ามพลาด!',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/rxcu_openhouse?igsh=NjUxam5yZGh0YzBu',
    faculty: 'pharm',
    timeSlot: '8:15 - 9:55 / 10:05 - 11:45 / 12:45 - 14:25 / 14:35 - 16:15',
    locationName: 'อาคาร 80 ปี ห้อง 303',
    locationURL: 'https://maps.app.goo.gl/NafCdUmNp18ACybb7',
  },
  {
    id: 'pharmw6',
    name: 'ฐานวิชาการ Pharmacognosy',
    description:
      'ฐาน PHARMACOGNOSY จะพาน้อง ๆ ไปดู "สมุนไพร" ผ่านการทัวร์ MUSEUM  มาหาคำตอบกันว่า จากใบไม้หนึ่งใบกลายมาเป็นยาช่วยชีวิตคนได้ยังไง? ฐานนี้มีคำตอบ!',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/rxcu_openhouse?igsh=NjUxam5yZGh0YzBu',
    faculty: 'pharm',
    timeSlot:
      '8:15-8:45 / 8:50-9:20 / 9:25-9:55 / 10:00-10:30 / 10:35-11:05 / 11:10-11:40 / 12:45-13:15 / 13:20-13:50 / 13:55-14:25 / 14:30-15:00 / 15:05-15:35 / 15:40-16:10',
    locationName: 'พิพิธภัณฑ์สมุนไพร ชั้น 3 โอสถศาลา',
    locationURL: 'https://maps.app.goo.gl/NafCdUmNp18ACybb7',
  },
  {
    id: 'pharmw7',
    name: 'ฐานวิชาการ Drug Discovery & Development (DDD)',
    description:
      'เคยสงสัยไหมว่า ยารู้ได้ไงว่าต้องวิ่งไปรักษาตรงไหน? แล้วระหว่างการเดินทางยาจะต้องเจออะไรในร่างกายบ้าง? ฐาน DRUG DISCOVERY & DEVELOPMENT จะพาน้อง ๆ ไปสนุกกับ 2 MISSION ภายในฐาน ห้ามพลาด!',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/rxcu_openhouse?igsh=NjUxam5yZGh0YzBu',
    faculty: 'pharm',
    timeSlot: '8:15 - 9:55 / 10:05 - 11:45 / 12:45 - 14:25 / 14:35 - 16:15',
    locationName: 'ตึก 80 ปี ห้อง 401',
    locationURL: 'https://maps.app.goo.gl/NafCdUmNp18ACybb7',
  },
  {
    id: 'pharmw8',
    name: 'ฐานวิชาการ Social and Administrative Pharmacy (SAP)',
    description:
      'อยากรู้ไหมว่าเภสัชกรมีบทบาทใน “ระบบสุขภาพทั้งประเทศ” อย่างไร ฐานนี้จะพาไปรู้จักเส้นทางอาชีพที่อยู่เบื้องหลังความปลอดภัยของประชาชน ไม่ว่าจะเป็นงานคุ้มครองผู้บริโภคด้านยา งานส่งเสริมสุขภาวะ ไปจนถึง ผู้ดูแลการขออนุมัติและขึ้นทะเบียนผลิตภัณฑ์สุขภาพ มาค้นพบว่าเภสัชกรสามารถขับเคลื่อนระบบสุขภาพได้มากกว่าที่คิด!',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/rxcu_openhouse?igsh=NjUxam5yZGh0YzBu',
    faculty: 'pharm',
    timeSlot: '8:15 - 9:55 / 10:05 - 11:45 / 12:45 - 14:25 / 14:35 - 16:15',
    locationName: 'ตึก 80 ปี ห้อง 503',
    locationURL: 'https://maps.app.goo.gl/NafCdUmNp18ACybb7',
  },
  {
    id: 'pharmw9',
    name: 'ฐานวิชาการ เภสัชกรรมร้านยา',
    description:
      'มาลองเป็นเภสัชกรร้านยาตัวจริง เรียนรู้บทบาทการจัดเตรียมยาให้ผู้ป่วย ฝึกนับเม็ดยาด้วยถาดนับยา และทดลองเขียนฉลากยาแบบเภสัชกรตัวน้อย ให้ถูกต้อง ครบถ้วน และปลอดภัย แล้วจะเข้าใจว่าทุกขั้นตอนเล็ก ๆ ล้วนส่งผลต่อความปลอดภัยของคนไข้',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/rxcu_openhouse?igsh=NjUxam5yZGh0YzBu',
    faculty: 'pharm',
    timeSlot: '8:15 - 9:55 / 10:05 - 11:45 / 12:45 - 14:25 / 14:35 - 16:15',
    locationName: 'ตึก 80 ปี ห้อง 402',
    locationURL: 'https://maps.app.goo.gl/NafCdUmNp18ACybb7',
  },
  {
    id: 'pharmw10',
    name: 'ฐานวิชาการ เภสัชกรรมชุมชน',
    description:
      'มาลองเป็นเภสัชกรร้านยาตัวจริง เรียนรู้บทบาทการจัดเตรียมยาให้ผู้ป่วย ฝึกนับเม็ดยาด้วยถาดนับยา และทดลองเขียนฉลากยาแบบเภสัชกรตัวน้อย ให้ถูกต้อง ครบถ้วน และปลอดภัย แล้วจะเข้าใจว่าทุกขั้นตอนเล็ก ๆ ล้วนส่งผลต่อความปลอดภัยของคนไข้',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/rxcu_openhouse?igsh=NjUxam5yZGh0YzBu',
    faculty: 'pharm',
    timeSlot: '8:15 - 9:55 / 10:05 - 11:45 / 12:45 - 14:25 / 14:35 - 16:15',
    locationName: 'ตึก 80 ปี ห้อง 402',
    locationURL: 'https://maps.app.goo.gl/NafCdUmNp18ACybb7',
  },
  {
    id: 'pharmw11',
    name: 'ฐานวิชาการ เภสัชกรรมโรงพยาบาล',
    description:
      'เภสัชกรในโรงพยาบาลมีหน้าที่แค่จ่ายยาเท่านั้นไหมนะ? มารู้จักหลักการสื่อสาร ISBAR ผ่านสถานการณ์จำลองและกิจกรรมภายในฐาน พร้อมโอกาสสวมบทบาทเป็นเภสัชกรตัวน้อยในทีมรักษา ที่ฐานเภสัชกรโรงพยาบาล!',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/rxcu_openhouse?igsh=NjUxam5yZGh0YzBu',
    faculty: 'pharm',
    timeSlot: '8:15 - 9:55 / 10:05 - 11:45 / 12:45 - 14:25 / 14:35 - 16:15',
    locationName: 'ตึก 80 ปี ห้อง 402',
    locationURL: 'https://maps.app.goo.gl/NafCdUmNp18ACybb7',
  },
  {
    id: 'pharmw12',
    name: 'ฐานวิชาการ Pharmaceutical Microbiology',
    description:
      'กว่ายาจะถึงมือคนไข้ ต้องผ่าน “ด่านจุลชีวะ” ก่อนเสมอ! เพราะโลกของเภสัชฯ ไม่ได้มีแค่เม็ดยา แต่ยังมีโลกของจุลินทรีย์ที่มองไม่เห็น  อยากรู้ไหมว่าจุลชีวะเกี่ยวข้องกับงานเภสัชยังไง? มาเจอกันที่ฐาน Microbiology ได้เลย!',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/rxcu_openhouse?igsh=NjUxam5yZGh0YzBu',
    faculty: 'pharm',
    timeSlot: '8:15 - 9:55 / 10:05 - 11:45 / 12:45 - 14:25 / 14:35 - 16:15',
    locationName: 'ตึก 80 ปี ห้อง 501',
    locationURL: 'https://maps.app.goo.gl/NafCdUmNp18ACybb7',
  },
  {
    id: 'pharmw13',
    name: 'ฐานวิชาการ Pharmaceutical Nutrition',
    description:
      'ใครบอกว่าเภสัชมีแต่เรื่องยา? เรื่อง “กิน” ก็สำคัญไม่แพ้กันนะ! มารู้จักโลกของโภชนาการในมุมเภสัชกร กับกิจกรรมสนุก ๆ ที่ได้ทั้งความรู้และความมันส์  อยากอัปสกิลเรื่องปากท้องแบบโปร ๆ มาเจอกันที่ฐาน Nutrition เลย!',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/rxcu_openhouse?igsh=NjUxam5yZGh0YzBu',
    faculty: 'pharm',
    timeSlot: '8:15 - 9:55 / 10:05 - 11:45 / 12:45 - 14:25 / 14:35 - 16:15',
    locationName: 'ตึก 80 ปี ห้อง 502',
    locationURL: 'https://maps.app.goo.gl/NafCdUmNp18ACybb7',
  },

  // คณะรัฐศาสตร์
  {
    id: 'polsciw1',
    name: 'Polsci Café ☕',
    description:
      "กิจกรรม 'ห้องปรึกษาทั่วไป' เป็นกิจกรรมให้คำแนะนำด้านการศึกษาที่จัดเป็นรอบ ๆ เพื่อเปิดโอกาสให้น้อง ๆ ได้ทำความรู้จักคณะรัฐศาสตร์ในภาพรวม โดยจะมีการแนะนำโครงสร้างและลักษณะการเรียนของแต่ละภาควิชาในเบื้องต้น ก่อนจะแยกการพูดคุยตามภาควิชาอย่างใกล้ชิด กิจกรรมจัดรอบละ 40 คน แบ่งเป็น 2 ห้อง ตลอดระยะเวลา 2 วัน คือวันเสาร์และวันอาทิตย์ ภายในกิจกรรม น้อง ๆ จะได้พูดคุยกับพี่ ๆ ตัวแทนจากแต่ละภาควิชาในรูปแบบวงสนทนา โดยมีการเวียนพูดคุยทั้งหมด 2 รอบ น้องสามารถเลือกอยู่พูดคุยกับภาควิชาเดิมเพื่อสอบถามข้อมูลเชิงลึกเพิ่มเติม หรือเลือกเปลี่ยนภาควิชาเพื่อรับฟังมุมมองและข้อมูลที่หลากหลายมากขึ้นตามความสนใจ กิจกรรมนี้เหมาะสำหรับน้อง ๆ ที่ยังไม่รู้จักคณะรัฐศาสตร์มากนัก หรือผู้ที่สนใจเข้าศึกษาในคณะ แต่ต้องการทำความเข้าใจภาพรวมของแต่ละภาควิชาก่อนตัดสินใจเลือกแนวทางการเรียนในอนาคต",
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://docs.google.com/forms/d/e/1FAIpQLSdICBgxJ_kYVQiQui5SncdKsYWLG6nm78J1bCxhGjkneAI59A/viewform?usp=publish-editor',
    faculty: 'polsci',
    timeSlot: '13:00 - 13.45 / 14.00 - 14.45 / 15.00 - 15.45',
    locationName: 'อาคารเกษม อุทยานิน (รัฐศาสตร์ 60 ปี) ห้อง 607-608',
    locationURL: 'https://maps.app.goo.gl/7bC9QwXTxRhomXvE9',
  },
  {
    id: 'polsciw2',
    name: 'Polsci Lounge 🛋️',
    description:
      "กิจกรรม 'ห้องปรึกษาเชิงลึก' เป็นกิจกรรมให้คำแนะนำแบบตัวต่อตัวระหว่างน้อง ๆ กับรุ่นพี่ เพื่อเปิดพื้นที่สำหรับการพูดคุยในประเด็นที่มีความเฉพาะเจาะจงและลงรายละเอียดมากยิ่งขึ้น กิจกรรมนี้เหมาะสำหรับน้อง ๆ ที่มีพื้นฐานความรู้เกี่ยวกับคณะรัฐศาสตร์ในระดับหนึ่งแล้ว และต้องการสอบถามข้อมูลเชิงลึกเกี่ยวกับเนื้อหาการเรียน แนวทางการศึกษา หรือประสบการณ์ในแต่ละภาคสาขาวิชา ภายในห้องจะมีพี่ ๆ จากแต่ละภาคสาขาวิชาที่มีความรู้และประสบการณ์ตรงคอยให้คำปรึกษา โดยน้องสามารถเลือกพูดคุยในประเด็นที่ตนเองสนใจ ไม่ว่าจะเป็นรายละเอียดของหลักสูตร การเรียนในแต่ละชั้นปี แนวทางการทำงานในอนาคต หรือข้อสงสัยเฉพาะด้านอื่น ๆ นอกจากนี้ ห้องปรึกษาเชิงลึกยังเหมาะสำหรับน้อง ๆ ที่มีความตั้งใจจะเข้าศึกษาต่อในคณะรัฐศาสตร์ แต่ยังลังเลหรือไม่แน่ใจว่าควรเลือกภาคสาขาวิชาใด โดยจะมีพี่ ๆ คอยให้คำแนะนำแบบตัวต่อตัว เพื่อช่วยให้น้องสามารถประเมินความสนใจและตัดสินใจเลือกแนวทางการเรียนที่เหมาะสมกับตนเองมากที่สุด",
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/polscicu.oph?igsh=Y2plNjB0NWxkcjJs',
    faculty: 'polsci',
    timeSlot: '13:00 - 16:00',
    locationName: 'อาคารเกษม อุทยานิน (รัฐศาสตร์ 60 ปี) ห้อง 614',
    locationURL: 'https://maps.app.goo.gl/7bC9QwXTxRhomXvE9',
  },
  {
    id: 'polsciw3',
    name: 'SD Career Talks (เวทีพูดคุยเส้นทางอาชีพกับศิษย์เก่าสิงห์ดำ)',
    description:
      'กิจกรรม "เสวนาเส้นทางอาชีพ" เป็นกิจกรรมที่พี่ ๆ ศิษย์เก่าจะมาร่วมแบ่งปันประสบการณ์ตั้งแต่ในช่วงที่ยังเป็นนิสิต รวมไปถึงการแนะนำในพาร์ทของการทำงาน และความเป็นรัฐศาสตร์สามารถนำไปปรับใช้กับการทำงานได้อย่างไรบ้าง ซึ่งจะช่วยให้ผู้เข้าร่วมมองเห็นเส้นทางอาชีพของผู้ที่จบการศึกษาจากคณะรัฐศาสตร์ได้ชัดเจนมากขึ้น',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/polscicu.oph?igsh=Y2plNjB0NWxkcjJs',
    faculty: 'polsci',
    timeSlot: '10.00 - 12.30',
    locationName: 'อาคารเกษม อุทยานิน (รัฐศาสตร์ 60 ปี) Singhdam Space',
    locationURL: 'https://maps.app.goo.gl/7bC9QwXTxRhomXvE9',
  },
  {
    id: 'polsciw4',
    name: 'Talking with Insiders (PGS)',
    description:
      'กิจกรรม "ห้องแนะแนวหลักสูตร PGS" เป็นกิจกรรรมที่เปิดโอกาสให้น้อง ๆ ที่สนใจในคณะรัฐศาสตร์หลักสูตรนานาชาติได้เข้าถึงข้อมูลของหลักสูตรมากยิ่งขึ้น และช่วยให้น้องๆ มีความเข้าใจเกี่ยวกับหลักสูตร PGS อย่างลึกซึ้ง นอกจากนี้ กิจกรรมดังกล่าวยังช่วยแนะแนวเส้นทางการประกอบอาชีพในอนาคตของน้อง ๆ ไม่ว่าจะเป็น 1) นักการทูต 2) นักวิจัย หรือ 3) ต่อยอดธุรกิจครอบครัว (อย่างไรก็ตาม ขนาดของกลุ่มตัวอย่างยังคงมีจำนวนจำกัด เนื่องจากหลักสูตรนี้เพิ่งเปิดดำเนินการได้ไม่นาน)',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/polscicu.oph?igsh=Y2plNjB0NWxkcjJs',
    faculty: 'polsci',
    timeSlot: '10.00 - 12.30 / 13.00 - 16.00',
    locationName: 'อาคารเกษม อุทยานิน (รัฐศาสตร์ 60 ปี) ห้อง 614',
    locationURL: 'https://maps.app.goo.gl/7bC9QwXTxRhomXvE9',
  },
  {
    id: 'polsciw5',
    name: 'กิจกรรมการแข่งขันตอบปัญหาวิชาการรัฐศาสตร์',
    description:
      'กิจกรรม "การแข่งขันตอบปัญหาวิชาการรัฐศาสตร์ ครั้งที่ 9" เป็นกิจกรรมการแข่งขันทางวิชาการที่เปิดโอกาสให้นักเรียนระดับมัธยมศึกษาตอนปลายได้มาลองวัดประชันความรู้ด้านสังคมศึกษาและรัฐศาสตร์ พร้อมชิงของรางวัลมากมาย',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/polscicu.oph?igsh=Y2plNjB0NWxkcjJs',
    faculty: 'polsci',
    timeSlot: '08:00 - 17:00',
    locationName: 'อาคารเกษม อุทยานิน (รัฐศาสตร์ 60 ปี) ห้อง 507-508 และ 1308',
    locationURL: 'https://maps.app.goo.gl/7bC9QwXTxRhomXvE9',
  },
  {
    id: 'polsciw6',
    name: 'Mock Classroom (PGS)',
    description:
      'กิจกรรมห้องเรียนจำลองเป็นการเปิดห้องเรียนจำลองให้ผู้เข้าร่วมงานได้สัมผัสบรรยากาศการเรียนการสอนเสมือนจริงในหลักสูตรการเมืองและโลกสัมพันธ์ คณะรัฐศาสตร์',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/polscicu.oph?igsh=Y2plNjB0NWxkcjJs',
    faculty: 'polsci',
    timeSlot: '13:00 - 14:30',
    locationName: 'อาคารเกษม อุทยานิน (รัฐศาสตร์ 60 ปี) ห้อง 609',
    locationURL: 'https://maps.app.goo.gl/7bC9QwXTxRhomXvE9',
  },
  {
    id: 'polsciw7',
    name: 'กิจกรรมห้องเรียนจำลอง (Classroom Simulation)',
    description:
      'กิจกรรมห้องเรียนจำลองเป็นการเปิดห้องเรียนจำลองให้ผู้เข้าร่วมงานได้สัมผัสบรรยากาศการเรียนการสอนเสมือนจริงในหลักสูตรภาคปกติของคณะรัฐศาสตร์ทั้งสี่ภาควิชา ได้แก่ ภาควิชาการปกครอง (Government) ภาควิชาความสัมพันธ์ระหว่างประเทศ  (International Relations) ภาควิชารัฐประศาสนศาสตร์ (Public Administration) และภาควิชาสังคมวิทยาและมานุษยวิทยา (Sociology and Anthropology)',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://docs.google.com/forms/d/e/1FAIpQLSe4t5Ub9uM4EoCzeYCTn7Hh-WpFdZc6zUdnX3T0Cr_TF5fC8A/viewform?usp=publish-editor',
    faculty: 'polsci',
    timeSlot: '09.00 - 12.30',
    locationName: 'อาคารเกษม อุทยานิน (รัฐศาสตร์ 60 ปี) ห้อง M08',
    locationURL: 'https://maps.app.goo.gl/aUsm2S7Y8ap1woXY9',
  },
  {
    id: 'polsciw8',
    name: 'กิจกรรมการแข่งขันโต้วาทีระดับชั้นมัธยมศึกษาตอนปลาย',
    description:
      'กิจกรรมแข่งขันโต้วาทีในระดับชั้นมัธยมศึกษาตอนปลาย เพื่อแสดงทรรศนะและพัฒนาทักษะด้านการพูด ผ่านมิติของรัฐศาสตร์',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/polscicu.oph?igsh=Y2plNjB0NWxkcjJs',
    faculty: 'polsci',
    timeSlot: '8.30-15.00',
    locationName: 'อาคารเกษม อุทยานิน (รัฐศาสตร์ 60 ปี)',
    locationURL: 'https://maps.app.goo.gl/7bC9QwXTxRhomXvE9',
  },
  // คณะวิทยาศาสตร์
  {
    id: 'sciw1',
    name: 'นิทรรศการภาควิชา นิทรรศการกลาง และบูธ TCAS',
    description:
      'นิทรรศการให้ข้อมูลการเรียนและเส้นทางอาชีพในอนาคตของภาควิชาและหลักสูตรนานาชาติ รวม 18 บูธ พร้อมบูธกลางและบูธแนะแนว TCAS สำหรับนักเรียนที่สนใจเข้าศึกษาในคณะวิทยาศาสตร์',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/scichulaopenhouse?igsh=eTdudzFhMXFkYmNu',
    faculty: 'sci',
    locationName: 'บริเวณใต้อาคารมหามกุุฏ',
    locationURL: 'https://maps.app.goo.gl/cN23XxNUfm7QKn6M9',
  },
  {
    id: 'sciw2',
    name: 'Workshop ภาควิชาคณิตศาสตร์และวิทยาการคอมพิวเตอร์',
    description: 'กิจกรรม workshop : Secret Code',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/scichulaopenhouse?igsh=eTdudzFhMXFkYmNu',
    faculty: 'sci',
    owner: 'ภาควิชาคณิตศาสตร์และวิทยาการคอมพิวเตอร์',
    locationName: 'อาคารมหาวชิรุณหิศ',
    locationURL: 'https://maps.app.goo.gl/yESKbs1e7ueKnxx9A',
  },
  {
    id: 'sciw3',
    name: 'Workshop ภาควิชาเคมีเทคนิค',
    description:
      'กิจกรรมเปิดโลกที่ห้องปฏิบัติการชั้นใต้ดิน (Unit Lab) ชมชุดทดลองจริงทั้งท่อ ปั๊ม วาล์ว ระบบการไหล การถ่ายเทความร้อน และการแยกสาร พร้อมคำอธิบายเข้าใจง่าย ให้เห็นภาพการเรียนของภาควิชาอย่างชัดเจน',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/scichulaopenhouse?igsh=eTdudzFhMXFkYmNu',
    faculty: 'sci',
    owner: 'ภาควิชาเคมีเทคนิค',
    locationName: 'อาคารมหามกุฏ ชั้นใต้ดิน',
    locationURL: 'https://maps.app.goo.gl/cN23XxNUfm7QKn6M9',
  },
  {
    id: 'sciw4',
    name: 'Workshop ภาควิชาธรณีวิทยา',
    description:
      'กิจกรรม workshop : การคัดตะกอน และผู้เข้าร่วมจะได้ออกแบบ size chart ของตนเอง',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/scichulaopenhouse?igsh=eTdudzFhMXFkYmNu',
    faculty: 'sci',
    owner: 'ภาควิชาธรณีวิทยา',
    locationName: 'อาคารแถบนีละนิธิ ในพื้นที่ Sci Space',
    locationURL: 'https://maps.app.goo.gl/hgfFDT8zsBWPLEvc8',
  },
  {
    id: 'sciw5',
    name: 'Workshop ภาควิชาวิทยาศาสตร์สิ่งแวดล้อม',
    description: 'กิจกรรม workshop : วัดต้นไม้และคำนวณคาร์บอน',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/scichulaopenhouse?igsh=eTdudzFhMXFkYmNu',
    faculty: 'sci',
    owner: 'ภาควิชาวิทยาศาสตร์สิ่งแวดล้อม',
    locationName: 'บริเวณอาคารวิทยาศาสตร์ทั่วไป (อาคารวิทยาศาสตร์สิ่งแวดล้อม)',
    locationURL: 'https://maps.app.goo.gl/LRXQiwwKwXAPA3UX7',
  },
  {
    id: 'sciw6',
    name: 'Workshop ภาควิชาชีวเคมี',
    description: 'กิจกรรม workshop : การสกัด DNA จากกล้วย',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/scichulaopenhouse?igsh=eTdudzFhMXFkYmNu',
    faculty: 'sci',
    owner: 'ภาควิชาชีวเคมี',
    locationName: 'อาคารแถบนีละนิธิ ในพื้นที่ Sci Space',
    locationURL: 'https://maps.app.goo.gl/hgfFDT8zsBWPLEvc8',
  },
  {
    id: 'sciw7',
    name: 'Workshop ภาควิชาวัสดุศาสตร์',
    description:
      'ภายในพื้นที่ SCI SPACE : Workshop ทำสไลม์แม่เหล็กและหล่อปูนปลาสเตอร์ และบริเวณตึกวัสดุศาสตร์ : Workshop throwing+PU Foam+processing',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/scichulaopenhouse?igsh=eTdudzFhMXFkYmNu',
    faculty: 'sci',
    owner: 'ภาควิชาวัสดุศาสตร์',
    locationName: 'อาคารแถบนีละนิธิ ในพื้นที่ Sci Space และตึกวัสดุศาสตร์',
    locationURL: 'https://maps.app.goo.gl/hgfFDT8zsBWPLEvc8',
  },
  {
    id: 'sciw8',
    name: 'Workshop ภาควิชาจุลชีววิทยา',
    description: 'กิจกรรม workshop : Streak and Pour',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/scichulaopenhouse?igsh=eTdudzFhMXFkYmNu',
    faculty: 'sci',
    owner: 'ภาควิชาจุลชีววิทยา',
    locationName: 'อาคารมหาวชิรุณหิศ',
    locationURL: 'https://maps.app.goo.gl/yESKbs1e7ueKnxx9A',
  },
  {
    id: 'sciw9',
    name: 'Workshop ภาควิชาเทคโนโลยีทางภาพและการพิมพ์',
    description:
      'Munsell 100 Hue Test :การแข่งขันการแยกแยะสี โดยให้ผู้ทดสอบจัดเรียงแถบสีที่มีเฉดสีใกล้เคียงกัน 85 แถบใน 4 แถว ตามลำดับสีธรรมชาติ เพื่อประเมินความแม่นยำในการมองเห็นสีและตรวจหาภาวะบกพร่องทางการมองเห็นสี',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/scichulaopenhouse?igsh=eTdudzFhMXFkYmNu',
    faculty: 'sci',
    owner: 'ภาควิชาเทคโนโลยีทางภาพและการพิมพ์',
    locationName: 'อาคารแถบนีละนิธิ ในพื้นที่ Sci Space',
    locationURL: 'https://maps.app.goo.gl/hgfFDT8zsBWPLEvc8',
  },
  {
    id: 'sciw10',
    name: 'Workshop ภาควิชาเทคโนโลยีทางอาหาร',
    description: 'กิจกรรม workshop : ตะลุยวิทยาศาสตร์อาหาร',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/scichulaopenhouse?igsh=eTdudzFhMXFkYmNu',
    faculty: 'sci',
    owner: 'ภาควิชาเทคโนโลยีทางอาหาร',
    locationName: 'อาคารแถบนีละนิธิ ในพื้นที่ Sci Space',
    locationURL: 'https://maps.app.goo.gl/hgfFDT8zsBWPLEvc8',
  },
  {
    id: 'sciw11',
    name: 'Workshop ภาควิชาเคมีและหลักสูตรเคมีประยุกต์ (BSAC)',
    description: 'กิจกรรม workshop : การทำน้ำหอม',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/scichulaopenhouse?igsh=eTdudzFhMXFkYmNu',
    faculty: 'sci',
    owner: 'ภาควิชาเคมีและหลักสูตรเคมีประยุกต์ (BSAC)',
    locationName: 'อาคารแถบนีละนิธิ ในพื้นที่ Sci Space',
    locationURL: 'https://maps.app.goo.gl/hgfFDT8zsBWPLEvc8',
  },
  {
    id: 'sciw12',
    name: 'Workshop หลักสูตรเทคโนโลยีชีวภาพ (BBTech)',
    description: 'กิจกรรม workshop : ไขปริศนาด้วย STR',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/scichulaopenhouse?igsh=eTdudzFhMXFkYmNu',
    faculty: 'sci',
    owner: 'หลักสูตรเทคโนโลยีชีวภาพ (BBTech)',
    locationName: 'อาคารแถบนีละนิธิ ในพื้นที่ Sci Space',
    locationURL: 'https://maps.app.goo.gl/hgfFDT8zsBWPLEvc8',
  },
  {
    id: 'sciw13',
    name: 'Workshop หลักสูตรวิทยาศาสตร์และเทคโนโลยีอุตสาหการ (BISTECH)',
    description: 'กิจกรรม workshop : F1 Car Race',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/scichulaopenhouse?igsh=eTdudzFhMXFkYmNu',
    faculty: 'sci',
    owner: 'หลักสูตรวิทยาศาสตร์และเทคโนโลยีอุตสาหการ (BISTECH)',
    locationName: 'SIS Lounge อาคารแถบ นีละนิธิ',
    locationURL: 'https://maps.app.goo.gl/hgfFDT8zsBWPLEvc8',
  },
  {
    id: 'sciw14',
    name: 'โครงการการแข่งขันตอบปัญหาวิทยาศาสตร์ SCiLYMPIC',
    description:
      'กิจกรรม SCiLYMPIC เป็นการแข่งขันวิชาการด้านวิทยาศาสตร์และคณิตศาสตร์ สำหรับนักเรียนระดับมัธยมศึกษา ครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ มุ่งพัฒนาทักษะการคิดวิเคราะห์ การแก้ปัญหา และการประยุกต์ความรู้ในสถานการณ์ต่าง ๆ',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/scilympic_official?igsh=cXhoeHQ0ZGN5Zmx6&utm_source=qr',
    faculty: 'sci',
    timeSlot: '8:00 - 18:00',
    locationName: 'อาคารมหามกุฏ',
    locationURL: 'https://maps.app.goo.gl/cN23XxNUfm7QKn6M9',
  },
  // คณะวิทยาศาสตร์การกีฬา

  // คณะวิศวกรรมศาสตร์
  {
    id: 'engw1',
    name: 'โซน Booth ภาควิชา',
    description:
      'กิจกรรม ให้แต่ละภาควิชามา present ในรูปของบูธกิจกรรม ให้น้อง ๆ เข้ามาสอบถาม',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/cuintaniaopenhouse?igsh=YmF1bmJvc3ZqcDB3',
    faculty: 'eng',
    locationName: 'ลาน intania',
    locationURL: 'https://maps.app.goo.gl/tCxBd5GxDi3QvL6B8',
  },
  {
    id: 'engw2',
    name: 'โซน Booth ชมรม',
    description:
      'กิจกรรม ให้แต่ละชมรมมา present ในรูปของบูธกิจกรรม ให้น้อง ๆ เข้ามาสอบถาม',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/cuintaniaopenhouse?igsh=YmF1bmJvc3ZqcDB3',
    faculty: 'eng',
    locationName: 'บริเวณถนน หน้าอาคารวิศวกรรม 1 และ 2',
  },
  {
    id: 'engw3',
    name: 'Workshop ภาควิชา',
    description:
      'กิจกรรมให้แต่ละภาค workshop ให้ผู้เข้าร่วมมีส่วนร่วมได้ โดยแต่ละภาคจะมีกิจกรรม ที่แตกต่างออกไปในสายนั้น ๆ',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/cuintaniaopenhouse?igsh=YmF1bmJvc3ZqcDB3',
    faculty: 'eng',
    timeSlot:
      '9:00 - 10:00 / 10:15 - 11:15 / 11:30 - 12:30 / 13:15 - 14:15 / 14:30 - 15:30',
  },
  {
    id: 'engw4',
    name: 'โซน Workshop innovation ของคณะ และทางอาจารย์',
    description: 'มีการนำ innovation มาให้น้องๆรับชม และลงมือ workshop',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/cuintaniaopenhouse?igsh=YmF1bmJvc3ZqcDB3',
    faculty: 'eng',
  },
  {
    id: 'engw5',
    name: 'เวทีกลางจัดแสดง',
    description: 'มีการแสดงของชมรมและกิจกรรมทั่วไป ในการประชาสัมพันธื',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/cuintaniaopenhouse?igsh=YmF1bmJvc3ZqcDB3',
    faculty: 'eng',
  },
  {
    id: 'engw6',
    name: 'กิจกรรมแนะแนวภายในหอประชุม Hall of intania',
    description:
      'เป็นกิจกรรมทีจะนำ รุ่นพี่ คณะอาจารย์มาพูดถึง คณะวิศวะ ภายในหอประชุม',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/cuintaniaopenhouse?igsh=YmF1bmJvc3ZqcDB3',
    faculty: 'eng',
    locationName: 'หอประชุม Hall of intania',
    locationURL: 'https://maps.app.goo.gl/75v8d4iGP2DQHBKX9',
  },
  {
    id: 'engw7',
    name: 'การแข่งขันตอบปัญหาคณิตศาสตร์เชิงวิศวกรรม (Integation Bee challenge)',
    description:
      'กิจกรรม แข่งขัน อินทิเกรตเชิงคณิตศาสตร์ ผู้เข้าร่วมเป็นน้อง ๆ มปลาย ',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/cuintaniaopenhouse?igsh=YmF1bmJvc3ZqcDB3',
    faculty: 'eng',
    locationName: 'หอประชุมอาคาร 4 ชั้น 2',
    locationURL: 'https://maps.app.goo.gl/bsZ6nesbJcqWXbHt8',
  },
  {
    id: 'engw8',
    name: 'โซนจัดแสดงนวัตกรรมที่เกี่ยวข้องกับวิศวกรรม',
    description: 'มีการนำ innovation มาให้น้องๆรับชม',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/cuintaniaopenhouse?igsh=YmF1bmJvc3ZqcDB3',
    faculty: 'eng',
  },
  // คณะศิลปกรรมศาสตร์
  {
    id: 'faaw1',
    name: 'เวทีกลาง',
    description:
      'ตั้งเวทียกสูงสำหรับจัดแสดงความสามารถของนิสิตคณะศิลปกรรมศาสตร์',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/smo.singum?igsh=MTg4YnYwbmt5bmZvNw==',
    faculty: 'faa',
    timeSlot: '09.00-15.00',
    locationName: 'บริเวณหน้าอาคารศิลปกรรมศาสตร์',
  },
  {
    id: 'faaw2',
    name: 'นิทรรศการ',
    description:
      'จัดแสดงตัวอย่างผลงาน ข้อมูลคณะ รวมถึงรายละเอียดเกี่ยวกับแต่ละภาควิชาสำหรับผู้ที่สนใจ',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/smo.singum?igsh=MTg4YnYwbmt5bmZvNw==',
    faculty: 'faa',
    timeSlot: '09.00-15.00',
    locationName: 'บริเวณหน้าอาคารศิลปกรรมศาสตร์',
  },
  {
    id: 'faaw3',
    name: 'พื้นที่ ถาม-ตอบ',
    description:
      'พื้นที่สำหรับให้น้อง ๆ ที่สนใจคณะศิลปกรรมศาสตร์เข้ามาแลกเปลี่ยน สอบถามข้อมูลจากรุ่นพี่ในคณะ',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/smo.singum?igsh=MTg4YnYwbmt5bmZvNw==',
    faculty: 'faa',
    timeSlot: '09.00-15.00',
    locationName: 'ห้องฟ้าใหม่ อาคารศิลปกรรมศาสตร์',
  },
  // คณะเศรษฐศาสตร์
  {
    id: 'econ1',
    name: 'Exhibition',
    description:
      'จัดนิทรรศการให้ความรู้เบื้องต้นเกี่ยวกับการเรียนในสาขาเศรษฐศาสตร์ โดยเนื้อหาครอบคลุมการอธิบายหลักสูตรที่คณะเศรษฐศาสตร์มี สายการทำงานเบื้องต้น วิธีการรับเข้า รวมไปถึงมีการจัดกิจกรรมเกมที่มีการประยุกต์เนื้อหาทางเศรษฐศาสตร์เพื่อให้ผู้เข้าชมมีความเข้าใจในหลักวิธีคิดทางเศรษฐศาสตร์มากขึ้น',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/econlab_cu?igsh=cWFuMjkwOWZtY3Ay',
    faculty: 'econ',
    timeSlot: '09:00 - 12:00 / 13:00 - 16:00',
    locationName: 'บริเวณโถงใต้อาคารคณะเศรษฐศาสตร์',
  },
  {
    id: 'econ2',
    name: 'รุ่นพี่ Talk',
    description:
      'จัดกิจกรรมให้ผู้เข้าร่วมได้มีโอกาสพูดคุย ปรึกษา และสอบถามข้อมูลเบื้องต้นเกี่ยวกับการเข้าเรียนในสาขาเศรษฐศาสตร์ รวมไปถึงประสบการณ์ และบรรยากาศในการเรียนจากรุ่นพี่นิสิตคณะเศรษฐศาสตร์โดยตรง',
    hasPreregistered: false,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/econlab_cu?igsh=cWFuMjkwOWZtY3Ay',
    faculty: 'econ',
    timeSlot:
      '28 March: 09:00 - 12:00 / 28 March: 13:00 - 13:30 / 28 March: 15:30 - 16:00 / 29 March: 09:00 - 12:00 / 29 March: 13:00 - 16:00',
    locationName: 'ห้องสมุด คณะเศรษฐศาสตร์',
  },
  {
    id: 'econ3',
    name: 'ศิษย์เก่า Talk',
    description:
      'จัดกิจกรรมเสวนา โดยศิษย์เก่าจากคณะเศรษฐศาสตร์ 3 ท่าน มาร่วมเสวนาเกี่ยวประสบการณ์ชีวิตในตอนเป็นนิสิตและตอนทำงาน โดยเป็นการแลกเปลี่ยนมุมมองและประสบการณ์ในการทำงานหลังจบการศึกษาจากคณะเศรษฐศาสตร์ในสายงานที่หลากหลายในยุคปัจจุบัน เพื่อเป็นการให้ความรู้ และแนะแนวทางแก่ผู้เข้าร่วม',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/econlab_cu?igsh=cWFuMjkwOWZtY3Ay',
    faculty: 'econ',
    timeSlot: '28 March: 14:00 - 15:30',
    locationName: 'ห้องสมุด คณะเศรษฐศาสตร์',
  },
  {
    id: 'econ4',
    name: 'เปิดทรรศน์คณะเศรษฐศาสตร์',
    description:
      'จัดกิจกรรมเปิดทรรศน์ของชมรมต่างๆในคณะเศรษฐศาสตร์ อาทิ ชมรมโต้วาที ชมรมยิงปืน ฯลฯ แต่ละชมรมจะมีการจัดกิจรรมเพื่อให้ผู้เข้าร่วมงานได้มีโอกาสเปิดมุมมองต่อคณะ ได้สัมผัสกับกรรมนอกเหนือจากการเรียนที่หลายหลาย',
    hasPreregistered: false,
    hasLimitParticipants: false,
    url: 'https://www.instagram.com/econlab_cu?igsh=cWFuMjkwOWZtY3Ay',
    faculty: 'econ',
    timeSlot: '09:00 - 12:00 / 13:00 - 16:00',
    locationName: 'บริเวณโถงใต้อาคารคณะเศรษฐศาสตร์',
  },
  {
    id: 'econ5',
    name: 'ห้องเรียนจำลอง',
    description:
      'จัดการจำลองการเรียนในคณะเศรษฐศาสตร์ เพื่อให้ผู้เข้าร่วมกิจกรรมได้รับความรู้และมีความเข้าใจในพื้นฐานหลักวิธีคิดทางเศรษฐศาสตร์มากยิ่งขึ้น รวมถึงเป็นการได้ลองสัมผัสบรรยากาศการเรียนการสอนในคณะเศรษฐศาสตร์',
    hasPreregistered: true,
    hasLimitParticipants: true,
    url: 'https://www.instagram.com/econlab_cu?igsh=cWFuMjkwOWZtY3Ay',
    faculty: 'econ',
    timeSlot: '29 March: 09:00 - 09:45 / 29 March: 10:15 - 11:00',
    locationName: 'อาคารคณะเศรษฐศาสตร์ ห้อง 209',
  },

  // คณะสถาปัตยกรรมศาสตร์
  // คณะสหเวชศาสตร์
  // คณะสัตวแพทยศาสตร์
  // คณะอักษรศาสตร์
  // สถาบันนวัตกรรมบูรณาการแห่งจุฬาลงกรณ์มหาวิทยาลัย
  // คณะเกษตรศาสตร์บูรณาการ
  // หอพักนิสิตจุฬาลงกรณ์มหาวิทยาลัย
]
