export const PRIVACY_TEXT = `1. บทนิยาม
1.1 “โครงการฯ” หมายความว่า CU Open House 2026
1.2 “ลงทะเบียนเข้าร่วมงาน” หมายความว่า การลงทะเบียนเพื่อเข้าร่วมกิจกรรมต่างๆ ที่จัดขึ้นโดยโครงการ CU Open House 2026 ผ่านเว็บไซต์ของโครงการ
1.3 “ข้อมูลส่วนบุคคล” หมายความว่า ข้อมูลที่สามารถเชื่อมโยงกับบุคคลได้หรือสามารถระบุตัวตนของบุคคลนั้นได้ แต่ไม่รวมถึงข้อมูลที่ไม่สามารถระบุตัวตนได้

2. การเป็นผู้ใช้งาน
2.1 หากท่านประสงค์จะลงทะเบียนเข้าร่วมกิจกรรมของโครงการฯ สามารถดำเนินการได้ที่เว็บไซต์ที่จัดทำขึ้นโดยโครงการ CU Open House 2026
2.2 ข้อตกลงในการใช้บริการและเงื่อนไขต่าง ๆ ของโครงการฯ จะเป็นไปตามข้อกำหนดและเงื่อนไขของแต่ละประเภทบริการ ซึ่งจะมีการแจ้งให้สมาชิกทราบล่วงหน้าก่อนการใช้บริการ

3. เกี่ยวกับข้อมูลส่วนบุคคล
3.1 แหล่งที่มาและข้อมูลที่โครงการฯ เก็บรวบรวม โครงการฯ จะเก็บรวบรวมข้อมูลส่วนบุคคลจากผู้ให้ข้อมูลเฉพาะในกรณีที่จำเป็นเท่านั้น ซึ่งข้อมูลที่โครงการฯ เก็บรวบรวมจะประกอบด้วย: ข้อมูลส่วนบุคคล ได้แก่ ชื่อ-นามสกุล วัน/เดือน/ปีเกิด สถานภาพปัจจุบัน อีเมล จังหวัดที่อยู่ การศึกษา ได้แก่ สถานศึกษา
3.2 โครงการฯ จะเก็บรวบรวมข้อมูลส่วนบุคคลเพียงเท่าที่จำเป็นตามวัตถุประสงค์ในการเก็บรวบรวมข้อมูล และจะปฏิบัติตามกฎหมายที่เกี่ยวข้องในการจัดเก็บและใช้ข้อมูล
3.3 วัตถุประสงค์ในการเก็บรวบรวมข้อมูล ข้อมูลส่วนบุคคลที่ท่านให้ไว้จะถูกนำไปใช้ในวัตถุประสงค์ดังต่อไปนี้:
- เพื่อการพัฒนาบริการและการประชาสัมพันธ์งาน CU Open House 2026
- เพื่อการดำเนินการตามคำขอของท่านในการใช้บริการ
- เพื่อการพัฒนาเว็บไซต์หรือกิจกรรมต่าง ๆ
- เพื่อการปฏิบัติตามข้อกำหนดทางกฎหมายและข้อบังคับ
- เพื่อการเก็บรวบรวมสถิติและตรวจสอบจำนวนผู้เข้าร่วมกิจกรรม

4. เงื่อนไขสำคัญของการเป็นผู้ใช้งาน
4.1 เงื่อนไขการเป็นผู้ใช้งาน โครงการฯ ขอสงวนสิทธิ์ในการให้สิทธิประโยชน์และบริการต่าง ๆ เฉพาะสำหรับงาน CU Open House 2026 เท่านั้น การสมัครสมาชิกต้องใช้ชื่อ - นามสกุลจริงตรงกับบัตรประชาชน (ทั้งภาษาไทยและภาษาอังกฤษ) หากข้อมูลที่ท่านกรอกไม่ถูกต้องหรือไม่ครบถ้วน อาจส่งผลให้ท่านไม่สามารถใช้สิทธิประโยชน์หรือบริการจากโครงการฯ ได้ เมื่อการลงทะเบียนเสร็จสมบูรณ์ ผู้ใช้งานจะได้รับสิทธิประโยชน์ตามที่โครงการฯ กำหนด การใช้สิทธิประโยชน์จะต้องยืนยันตัวตนด้วยการแสดงบัตรประชาชนและข้อมูลต้องตรงกับที่ลงทะเบียน สิทธิประโยชน์ที่ได้รับขึ้นอยู่กับเงื่อนไขที่โครงการฯ แจ้งให้ทราบในแต่ละครั้ง สิทธิประโยชน์ทั้งหมดของโครงการฯ เริ่มมีผลทันทีเมื่อท่านทำการลงทะเบียนเสร็จสมบูรณ์ โครงการฯ ขอสงวนสิทธิ์ในการยกเลิกการเป็นสมาชิกหากท่านกระทำการที่อาจสร้างความเสียหายให้กับโครงการฯ

5. สิทธิประโยชน์
5.1 ผู้ที่ลงทะเบียนกับโครงการฯ จะได้รับสิทธิประโยชน์ดังต่อไปนี้:
- สิทธิประโยชน์พิเศษจากผู้สนับสนุนโครงการฯ
- สิทธิประโยชน์ในการเข้าชมงาน CU Open House 2026 ผ่าน QR Code
- สิทธิประโยชน์ในการรับข่าวสารหรือข้อมูลประชาสัมพันธ์จากโครงการฯ
- สิทธิประโยชน์ในการรับเกียรติบัตรสำหรับเข้าร่วมงาน

6. การเข้าถึงสิทธิประโยชน์
6.1 สิทธิประโยชน์ที่ท่านได้รับจะจัดส่งในรูปแบบของ QR Code หรือรูปแบบอื่นๆ ตามที่โครงการฯ กำหนด

7. นโยบายการยกเลิก
7.1 โครงการฯ ขอสงวนสิทธิ์ในการยกเลิกการเป็นผู้ใช้งานหลังจากการลงทะเบียนเสร็จสมบูรณ์

8. กรณีข้อโต้แย้งหรือทุจริต
8.1 ในกรณีที่มีข้อโต้แย้งเกี่ยวกับสิทธิประโยชน์จากการเป็นผู้ใช้งาน ท่านตกลงและยอมรับว่าโครงการฯ มีสิทธิ์ในการตรวจสอบและปรับปรุงสิทธิประโยชน์ให้กับผู้ใช้งาน
8.2 หากมีการฉ้อฉล ปลอมแปลง หรือกระทำการทุจริตใด ๆ เพื่อให้ได้มาซึ่งสิทธิประโยชน์ โครงการฯ ขอสงวนสิทธิ์ในการปฏิเสธการโอนสิทธิประโยชน์ให้กับผู้ใช้งาน

9. การเปลี่ยนแปลง แก้ไข หรือเพิ่มเติม
9.1 โครงการฯ ขอตกลงในการพิจารณาทบทวนนโยบายคุ้มครองข้อมูลส่วนบุคคลและข้อตกลงนี้ให้สอดคล้องกับกฎหมายที่เกี่ยวข้อง และจะเผยแพร่การเปลี่ยนแปลงผ่านเว็บไซต์หรือสื่อออนไลน์ของโครงการฯ

10. ภาษาและกฎหมายที่ใช้บังคับ
10.1 ข้อตกลงและเงื่อนไขนี้ให้ใช้ภาษาไทยเป็นภาษาที่ใช้บังคับ และจะปฏิบัติตามกฎหมายไทย
10.2 หากมีการโต้แย้งหรือข้อพิพาทเกิดขึ้น ให้ศาลไทยมีอำนาจในการพิจารณาคดี

ผู้ให้ข้อมูลได้อ่านศึกษา พิจารณาและตรวจสอบข้อกำหนดตามข้อตกลงและเงื่อนไขการใช้บริการ CU Open House 2026 ของโครงการฯแล้ว และผู้ให้ข้อมูลตกลงยอมรับ และตกลงเข้าผูกพันตามข้อตกลงและเงื่อนไขการใช้บริการข้างต้นทุกประการ`
